{
  "posts": [
    {
      "title": "当一个小镇青年",
      "date": "2020-07-30T20:01:00+08.00",
      "path": "https://blog.imalan.cn/archives/be-a-young-man-in-town/",
      "text": "我从来没有像今年这样待在县城的家里这么久。出生于藏区小镇，长于县城，在四川第二大的城市读高中，在首都念大学。我一直在迁徙，所处的环境越发广阔，所见所闻在变多。然而滑稽的是在此特别的、临近毕业的紧要关头，似乎有意安排似的，我被困在这个小镇。关于居家隔离、远程办公已经有很多论述。李如一在《一天世界》播客第七十九期里说：\n……有的人甚至为此（居家隔离办公）寻求心理医生的帮助。我当时一听觉得，哇，那如果这样的话，像我们这样的人不就是病入膏肓了吗？\n李如一口中的「我们这样的人」指的是基本不用到固定办公场所坐班的人。某些职业天生具有远程特性，比如记者、作家、独立开发者等等，这些人已经很适应透过屏幕办公了。但是也正如李如一所说，可能不适应 social distancing 才是正常的，而他那样的人才应该看医生。若不是这次疫情，我可能没意识到自己几乎丧失了和家人在同一屋檐下朝夕相处的能力。春节期间我的预测是至多需要在家里住到三月，然后返校。三月 —— 大概就是我和家人互相看不惯的临界点。现在快八月了，我敲下这行字时还坐在家里的餐桌前，听着窗外淅淅沥沥的雨声。我和家人几乎已经过了互相讨厌的阶段，进入井水不犯河水的生活模式。我一度纳闷世界上怎么会有到中年还跟父母住在一起的人？我是绝对受不了的。现在明白，也许我才应该看医生。身处小镇与身处都市最大的不同是什么呢？也许就是人与人的关系：小镇就是中国，而一群人就是小镇。\n这半年来体重跌了不少。母亲总在我耳边说，你看吧，这样的生活适合你，瘦下来健康。但我最清楚体重跌下来的原因。体重下跌，来自于不健康的精神状态和健康的生活状态。当我在家办公，我没有必要与任何人打交道，结果便是我不与任何人打交道。而在小镇，拒绝与人打交道是行不通的，只面对自己时，负面情绪就开始蔓延。一个重要的人对我说：我觉得你没有很爱自己。后来我明白了，如果我在乎自己觉得重要的人，那我要爱自己，只有这样才有可能维护健康的关系，否则一切都是只存在于脑海里的烟花。六月份搞砸了一些事，自己也受了一点不大不小的打击。好在有朋友不离不弃，先是陪我长谈，大骂了我一顿；接着教给我上面这个道理。我逐渐缓过来之后，带着愧疚决定成为更好的人。每天六点半准时起床，出门晨跑；晚上在瑜伽垫上做一些力量训练；咖啡、糖都减少摄取；晚上尽量在午夜前睡觉。效果很明显。这些天县城雨季，早上经常下雨，跑步也无从进行。有时蒙头一睡再醒就是九点，我会有点惶恐，感觉自己浪费了一个上午。晨跑确实改变了一些东西。\n关于自我认识，我曾经与好几个朋友聊过，但似乎并不是每个人都有类似困扰。仅当理想、见识、能力三者不匹配时，这种苦恼才尤为严重。我在 Twitter 上说：\n...不过我最近的感受是，相比起整天把正义、理想、社会秩序挂在嘴边的人，喜欢吃、关注自身、关注身边事物的人宜人度显著更高。\n但我从不避讳「理想」这个词。大家羞于谈起自己的远大理想和细腻情绪，只顾着说一些不上不下的废话。这是一种逃避，因为你对自己的期望就是你的理想。不去思考理想，那就活得不明不白。只是不可否认：认识自己往往伴随着失望和痛苦。去年双十一趁打折买了各色的 DNA 测试，收到报告上赫然写着：「创造力一般」，我大失所望。这样从天而降的定论我可以不服，但某些蛛丝马迹却不得不服。在小镇生活的这大半年，我逐渐心安：挂在嘴上的、心心念念的远方，它终究只是远方；眼前可感知的，是楼下面馆，是菜市场喧嚣，是步行街的熙攘。我终究是一个俗不可耐的小镇青年。",
      "categories": [
        {
          "name": "Default",
          "slug": "Default",
          "permalink": "https://blog.imalan.cn/category/Default/"
        }
      ],
      "tags": [

      ]
    },
    {
      "title": "Nintendo Switch | 揽件日志",
      "date": "2020-02-10T20:09:00+08.00",
      "path": "https://blog.imalan.cn/archives/nintendo-switch/",
      "text": "受 NCP 疫情影响，这个春节十分轻松，也十分无聊。正是尝试新事物的大好时机。虽然文章题目已说明我购买了任天堂的游戏主机 Switch，但容我扯远一些。我不玩游戏。若非说玩过，那就只限于魂斗罗、超级玛丽之类；其它主机、PC、手机游戏一概不沾。对我这代人而言，「不玩游戏」这个标签是与「好学生」绑定的，因此对这一点，即使称不上骄傲，我也觉得相当无所谓。但到上了大学，我开始觉得有所谓。当室友、同学以及老友们聚在一起讨论王者荣耀、GTA 5、巫师时，自己却在一边插不上话，这种感觉是十分难受的。我清楚地记得一次饭局上，别人说吃完饭一同去「召唤师峡谷」，我不解地问「召唤师峡谷」是哪里，招致一片嘲笑。不要误解，我对游戏没有任何偏见。不仅没有偏见，我后来还花了很多时间去了解游戏设计与理念。在不玩游戏的人里，我自认为是很懂游戏的（笑）。但终归是纸上谈兵。也有几次尝试玩一玩，比如借来室友的 PS4，玩《神秘海域4》，然而并没有玩下去。手柄、摇杆都非常生疏，这种考验操作的游戏十分劝退。\n春节前期沉迷《爱情公寓5》，喜欢上了诸葛大力这个角色及其演员成果。在 Bilibili 冲浪时碰巧看到她玩《健身环大冒险》的视频，突然想起之前也对 Nintendo Switch 这款游戏机产生过兴趣。于是进一步做了做功课。任天堂不爱难度超高、画质超好的硬核游戏，更注重游戏性本身，旗下主机是世界闻名的老幼妇孺机，这种理念非常吸引我。Switch 问世之后顺道而来的大量新奇玩法更是 mind-blowing（此处呼叫专业人士 @Zeee）。基于 Joy-Con（Switch 上的可拆卸手柄）体感功能开发的《健身环大冒险》就是其中之一。\n这款游戏自发售以来一直处于供不应求的状态，价格也是居高不下；受疫情影响，更是上涨到将近 1200 RMB。我实在受不了憋在家里的无聊生活，最终选择了附近的商家一并买下了主机本体与这款游戏。游戏形式以跑酷收集金币为主，战斗是回合式的对战。拿到手尝试之后方觉这游戏绝非过家家，真正是一个移动健身房。根据当前的运动能力设置好难度之后，运动量其实相当大，两三关下来就出汗喘气了。另外游戏也考虑到了均衡锻炼各个部位的需求，身体从上到下都有相应的运动可以练到，总计运动种类有 40 种之多。闯关式的游戏本身并没有太多新意，最具创新性的还是腿部绑带与 Ring-Con（游戏附带的一个普拉提环，需要将一只 Joy-Con 插入使用），这两个组件共同检测身体姿态与运动状态并反馈给主机。实际体验下来精度相当不错；曾出现过一次腿部绑带姿态偏差，在设置里校正陀螺仪就好了。我在 Switch 上为父母分别创建了账户，晚饭后休息一会儿就一人玩几关，确实十分愉快。这应该是任天堂主机才能带来的快乐吧。\n除《健身环大冒险》，我也准备物色一款真正意义上的游戏。最终的选择毫无意外是《塞尔达传说：旷野之息》，直接从在线商店以 499 港币入手了数字版。不过上手之初还是让我吃了些苦头。花了大量时间习惯键位、摇杆之后，总算是成功通过了初始台地的三座神庙拿到了滑翔伞，一头扎进了广阔的海拉鲁大地。塞尔达传说 · 旷野之息很难说我已经完全理解了这款游戏的迷人之处，但惊喜确实在一个接一个地找上门来。射出去的每一支箭都想捡回来，树上结着的每一个苹果都想去摘；荒野上、峭壁上任何闪闪发光的东西都想去一探究竟。路边的石头有点可疑，搬开一看竟然得到一个克洛格果实！在海拉鲁大地上探险，就像是给十四岁的我以无穷的勇气，让好奇心与童心肆无忌惮地释放。经常忘了还有神兽等我解放，还有灾厄盖侬等我讨伐，我只顾在这片原野上流连忘返。这款游戏应该能成为我真正的游戏入门作。何等幸运呀。\n说回 Switch 这款主机本身。主机 + 掌机二合一的设计在发售前还有质疑声，认为两者皆做 = 两者皆差。但最终都被折服了。得益于任天堂的游戏理念，作为主机的 Switch 并没有在性能上吃什么苦头（评论区纠正可能只有任天堂第一方游戏如此），同样能给硬核玩家提供诸如《旷野之息》之类的优质大作；可拆卸带体感的 Joy-Con 更是提供了无限的可能性，配合特别设计的游戏，Switch 完全可以成为家庭娱乐中心，也是聚会上的优质玩具。作为掌机时体验也相当完整，足够大的屏幕、足够好用的按键与手柄、足够长的续航、通用的 Type-C 接口等等让 Switch 完全能塞满玩家手痒的每一刻。如今我相信了，任天堂可能真是世界主宰。",
      "categories": [
        {
          "name": "Default",
          "slug": "Default",
          "permalink": "https://blog.imalan.cn/category/Default/"
        }
      ],
      "tags": [

      ]
    },
    {
      "title": "Maverick - Go My Own Way.",
      "date": "2019-12-13T11:27:00+08.00",
      "path": "https://blog.imalan.cn/archives/blog-now-powered-by-maverick/",
      "text": "首先是在少数派上写一些折腾经验，然后是自己基于 WordPress、Typecho 建站，我在各种网络平台上涂鸦也快三年了。这期间尝试了许多写作、建站工具，深感该领域百花齐放，令人眼花缭乱。很长的一段时间里，我沉浸于给博客程序写主题写插件、使用诸如 CDN 等方式优化网站速度、研究 SEO 玄学，不亦乐乎。但终究有些厌倦了。Typecho 这类动态博客程序固然方便，然而自己管理一个服务器确实是负担，而且对图片、内容的管理不甚自由，一旦需要迁移就是噩梦一场；若只是在第三方平台上发表东西，就总觉得互联网上少了属于自己的一亩三分地。因此我曾几次把目光转向静态博客。诸如 Hexo、Jekyll 这类静态博客生成器让用户在本地编写 Markdown 文本，再由生成器完成从原始文件到博客网页的转换。某种程度上，这类程序让写作者从维护网站的繁琐中解脱出来，而专注创作本身。MWeb、Gridea 作为博客写作工具时也属于此类。然而实践下来，仍然有两个问题没能得到解决：\n博客源文件的管理问题。想要达到真正的内容与展示分离，就不应该限制源文件的存储方式。现在的生成器要么要求把内容存储到自己的库中，要么要求放在生成器目录下的特定位置，某些甚至对目录结构都有要求。这并不是我想要的；\n图片等静态资源的处理问题。Markdown 对图片的处理一直都是痛点。我不希望把图片放在任何第三方图床，且不提上传图片-获得外链-插入外链这个过程多么不便，远程图床还有随时跑路的风险；而现在的生成器又不能很好地处理本地图片，至少处理起来并不优雅。\n\nAlan Key 的一句名言，被 Steve Jobs 引用后众人皆知：\nPeople who are really serious about software should make their own hardware.\n拿来活用，则「任何认真对待博客的人都应该自己写博客系统」。这话说起来固然偏执，但确实为吹毛求疵的人指了一条明路。既然现在的轮子都不满意，那就应该造自己的轮子。本着学习与探索的目的，我使用 Python 自己写了一个静态博客生成器，取名 Maverick，开源于 GitHub。它现在正驱动着我的个人 Wiki。项目主页 | 个人博客 | 演示站点 | 欢迎反馈与Star现在可以说说 Maverick 本身。大致上，它与 Hexo 等相似，都是通过解析 Markdown 文件生成网页。不过我在设计它时考虑到了上文所述的系列问题，并做了针对性的改进。首先是 Maverick 对源文件的处理。Maverick 不限制源文件的存储位置，你可以把文章目录放在电脑上的任何路径下，例如 Dropbox、iCloud Drive，以便备份、同步、版本管理，以及在任何设备上用任何编辑器写作。Maverick 也不限制源文件的组织结构，你可以按照你喜欢的方式组织它们，按时间、按类别都可以。为了达到这一点，Maverick 通过叫做 source_dir 的选项在指定路径下搜索所有 Markdown 文件，并根据里面提供的信息将它们分门别类，生成日期标签等等。这些内容被称作 frontmatter，也就是使用 Hexo 等写文章时顶部的使用 --- 包裹起来的那部分东西。这样的设计让以前的内容可以被复用，也便于以后的迁移。此外是对图片的处理。Maverick 允许在 Markdown 文件中引用任何位置的图片，并且都能在生成网站时合适地处理它们。若你在原始文本中通过绝对路径或者相对路径引用本地图片，Maverick 会在生成网站时自动寻找它们，并把它们复制到统一的位置，同时修改文章里的引用链接；若通过 URL 引用了远程图片，则（可选地）将它们下载到本地缓存，按本地图片对待。这样处理的好处很多。\nTypora、VS Code 等软件都支持插入与预览本地图片。尤其是 Typora，本身还提供了插入图片时自动将图片复制到相对文章的某个目录的功能，这与 Maverick 的处理方式十分契合；\n通过本地缓存，减小了图片丢失的风险。若图床跑路，你还可以在本地找到一份备份，不会影响你发布的内容；\n虽然目前还没有实现这个功能，但通过本地化以及统一的发布流程，可以实现自动图片处理（例如压缩）；\n可以提前获知图片的大小尺寸等信息，并在网页展示时提供优化的体验（比如图片排版与点击放大）。\n\n而这一切都发生在生成站点时，不会对原本的文章有任何影响，不需要在文章里多加什么标注或者声明。只需要用标准的 Markdown 语法引入图片就好。此外，不论是缓存还是尺寸信息，Maverick 都会在生成时缓存下来，不会反反复复地请求与解析。\n除了以上两点改进，Maverick 还自带了一些博客的常用功能，例如 RSS 源生成、实时搜索、Sitemap 等。这一切你都可以在示例站点上体验到。目前，Maverick 没有插件机制，但以我自己的体验而言，应该具备了个人博客应有的功能。我在 Lepture 开发的 Markdown 解析器 mistune 基础上进行扩展，添加了一些 Markdown 语法，使之能够良好地支持代码高亮、行内脚注、数学公式、图片排版等。网页端的展示方面，Maverick 使用自带的主题 Galileo。这是一个比较简洁的主题，以文字阅读体验为重心开发，样式上借鉴了安妮薇日报与 hexo-theme-cactus 的设计。文字排版效果请参见 Typography - Maverick。\n总之，我从自己的观察与需求出发，自己写了一款静态博客生成器。本文只覆盖了关于 Maverick 的很小的一部分，欢迎各位移步 项目主页 阅读完整的说明。这是我用 Python 写的第一个像点样的东西，因此不免有些遗漏与错误，任何建议与反馈都十分欢迎。当然 Star 则是特别欢迎😜。那么，就这样，感谢各位阅读。周末愉快~",
      "categories": [
        {
          "name": "Default",
          "slug": "Default",
          "permalink": "https://blog.imalan.cn/category/Default/"
        }
      ],
      "tags": [

      ]
    },
    {
      "title": "《长日将尽》：一种慰藉",
      "date": "2019-10-22T22:35:00+08.00",
      "path": "https://blog.imalan.cn/archives/the-remains-of-the-day/",
      "text": "《长日将尽》这本书是在高铁上读完的。去程读了三分之一，回程一口气读完。也许列车这一物件与此书气质相合，毕竟石黑一雄正是借由史蒂文斯驾车远游途中的回忆写出了本书。以一位老牌英国管家的口吻叙事，让这本书趣味无穷。谨小慎微、面面俱到的语言，有时甚至显得絮絮叨叨，让隐含其中的情感无比细腻。必须认真揣摩才能抓住史蒂文斯镇定自若的叙述中流露出的真情实感；一旦抓住，则让人感触至深，甚至合卷叹息。虽然只是一位管家的回忆，展现的图景却相当宏大。一二战期间达林顿府往来无白丁，达官显贵是府上常客；至战后门可罗雀，落到宅邸出售给外国人的境地。历史如同车轮般滚滚向前，其间兴衰交替、人物沉浮，既体现在世界大局上，也体现在每一个小人物身上。诺贝尔文学奖给石黑一雄的评语是：\n以其巨大的情感力量，发掘了隐藏在我们与世界的虚幻联系之下的深渊。\n以小见大是《长日将尽》的一大特色。这或许这不是石黑一雄的本意，他说本书的出发点是想书写：\n你是如何为了成就事业而荒废了你的人生，又是如何在个人的层面上蹉跎了一辈子的。\n在我看来，成书真正达到的高度何止如此。书里涉及的议题非常多，大至世界如何运行，小至职务细节，都借史蒂文斯的口表达了有趣的见解。当然，他绝不会直接说出来，但是通过许多顾左右而言他的叙述，周周转转之下我们还是能揣摩一二。不可否认的是，这本书很大程度上是以史蒂文斯为中心的，写他的一生，以及他所经历的巨变。他对「伟大管家」的理解以及对职业精神的追求构成了他做出抉择的依据，也直接导致了他的成就与遗憾。坚决声称自己只是旁观者的史蒂文斯对自己以及达林顿勋爵的态度是非常复杂的。一方面坚决地维护「达林顿勋爵是一位真正的绅士」，另一方面又对爵爷亲纳粹的倾向感到不快，甚至拒绝承认自己是达林顿府管家；一方面只字不提对肯顿小姐的感情，一方面又一厢情愿地希望在若干年后请她回府上共事。这是一位非常矛盾的人，恐怕他自己也因为这些矛盾而感到困扰。这本书的动人之处是其细致入微的人文关怀。石黑一雄能将藏在事物背后的情感呈给读者，又做到恰到好处、绝无煽动读者的嫌疑。这可能就是二三流作者与一流作家的差距。总之，我为能读到这样一部一流作家的一流作品感到无比幸运。\n一件趣事。读《长日将尽》时我不禁想，这要是能由霍普金斯出演拍成电影就好了……合上书，发现书背上写着确实已经在 1993 年拍成了电影，主演也确实就是安东尼·霍普金斯。 ​",
      "categories": [
        {
          "name": "Default",
          "slug": "Default",
          "permalink": "https://blog.imalan.cn/category/Default/"
        }
      ],
      "tags": [

      ]
    },
    {
      "title": "入手《风之谷》漫画 | 揽件日志",
      "date": "2019-10-15T16:40:00+08.00",
      "path": "https://blog.imalan.cn/archives/kaze-no-tani-no-naushika-manga/",
      "text": "《风之谷》（日语：風の谷のナウシカ）是宫崎骏于 1982 至 1994 年间在杂志《Animage》上连载的漫画作品。整个故事以末日幻想为题材，架构在一个过去兴盛的文明受到毁灭，大地严重污染、遍布毒物，以及充斥着巨大异形昆虫的世界里1。在这个世界里，「散发着毒气的森林（腐海）」不断侵蚀生活场所，人类与虫族时有摩擦，总体上生活在夹缝之中。关于剧情先不多说。大多数人对《风之谷》的印象来自宫崎骏监督的同名动画电影，原作得到的关注要少一些。漫画第一辑销量约五万本，动画上映后作品收到大量关注，销量激增。至连载结束前，各册合计销量约 527 万本；连载结束后漫画多次再版，至 2005 年全部累计销售 1100 万本以上。\n以上都不是重点，这次的主题是开箱新入手的漫画全辑。看了《风之谷》电影后迷上了作品里的世界观，同时被娜乌西卡全面圈粉。考虑到电影只是漫画的部分剧情，并且人物塑造、剧情等都有所简化，我决定入手原作补完整个故事。下单后等了两天，今天中午终于收到了包裹，迫不及待地拆包：来自台湾东贩出版社，简盒装。由于外包装非常非常严实，因此外观没有什么瑕疵。 相比起普通漫画开本要大一些，差不多是普通杂志的大小。里面每本分册也有塑封膜，拆一本看看内页吧： 印刷质量还不错。这也是我第一次看到宫崎骏的画风。宫老的电影作画属于比较清新的，没想到漫画画风相当繁复。当然也与故事的主题有关。现在一般认为宫崎骏主要成就来源于动画电影，漫画作品并不算多，《风之谷》则是难得的、出自宫老本人之手的长篇漫画作品。在漫画领域屡屡碰壁，再加上意识到自己的作品难以突破手冢治虫漫画设下的各种限制，作为漫画家的宫崎骏总体来讲并没有得到很高的成就。其实《风之谷》漫画本身在日本漫画史上的地位也算不得十分重要。但即使如此，通过漫画一窥宫崎骏早期的思想与风格还是很有意义。\n\n来自维基百科，下文销量数字同。&#8617;\n\n\n",
      "categories": [
        {
          "name": "Default",
          "slug": "Default",
          "permalink": "https://blog.imalan.cn/category/Default/"
        }
      ],
      "tags": [

      ]
    },
    {
      "title": "国庆揽件：Apple Watch 五号机 | 揽件日志",
      "date": "2019-10-05T15:57:00+08.00",
      "path": "https://blog.imalan.cn/archives/apple-watch-series-5/",
      "text": "说起来，心情烦闷的时候就喜欢胡吃海喝、大手大脚花钱。国庆更是给我底气，「过节嘛，花点钱也无可厚非」。于是便有了本文主角：Apple Watch Series 5。这款手表今年 9 月随 iPhone 11 一同发布。一直以来，9 月的发布会都只有一个重头戏，因为任何产品都很难抢得过 iPhone 的风头，这次的 Apple Watch 也不例外。我的上一只 Apple Watch 还是 2015 年发布的「初号机」；之后苹果依次发布了 Series 1-4，直到今年 9 月的 Series 5。初号机发布后，虽然苹果每次发布会都强调「这是世界上卖得最好的智能手表」，甚至是「卖得最好的手表」，但仍无法掩盖市场需求疲软，销售不及预期的现实。很长一段时间里，苹果都拒绝公布 Apple Watch 具体销量。这与可穿戴设备逐渐退潮有关，也与初号机的定位定价有关。苹果一开始的算盘是打入时尚市场，走奢侈品路线，以致最贵的一款初号机售价高达 12 万人民币。但时尚界显然不买账，没有哪位名媛愿意戴着一只电子手表出席晚宴。苹果开始改变路线，转而聚焦健康领域，这才算是上道了。在后续机型中，苹果大幅改进了 Apple Watch 的传感器性能，陆续加入陀螺仪、GPS、罗盘、蜂窝网络；Series 4 中引入了电极式心率传感器，甚至还支持腕上 ECG；提高了防水级别，以方便游泳运动员使用。软件层面，诸如久坐提醒、正念、摔倒报警、心率报警、环境噪音报警等功能都是苹果的宣传重点。今年发布会上苹果播放了一个短片，由一些因 Apple Watch 而生活得更健康，甚至是捡回一命的人讲述自己的故事。 \n现在看来，初号机是一款问题多多的产品。从手机到手表，设备本身的变化、应用场景的变化都十分巨大，新的交互模式也需要重新探索。特别让人印象深刻的一点是：初号机真的很慢。初号机的慢不是因为硬件过时，而是从一开始就没有给够性能。我想任何使用过初号机的人都能清晰地回忆起抬手打开一个 App 是什么样的体验。简单来说，煎熬得如同地狱。更不用提续航。习惯了一颗电池能用上一年半载的石英表，亦或是充一次电能用半月的智能手环，谁能忍受每天一充的手表呢？手表一天一充，simply makes no sense。以上这些怨念，有些延续至今，有些在迭代更替中得到解决或者改善，今年发布的 watchOS 6 与「五号机」则是苹果提交的最新答卷。从第一代开始见证一款产品的进化历程是非常有意思的事情，在其中，能看见商业公司的坚持与妥协，也能看见市场的起起伏伏。\n苹果对 Apple Watch 的重视程度从初号机的包装就能看出来，不同于简洁的 iPhone 包装盒，Apple Watch 产品线过度包装很严重。初号机长条形的包装盒拿在手上沉甸甸的，外面是苹果标志性的白色纸盒，里面还有一个精致的纯白塑料盒。细腻的阻尼感，严丝合缝的接口，处处体现着严谨的高级感，甚至让人无从下手。这次我从官网下单，预计到货是 12 号，实际上两天就拿到了包裹。外形仍然是长条形，纯白的纸盒上有 Apple Watch 字样的压印。这只是外包装，展开后才是真正的包装盒。两个盒子叠在一起，上面是手表本体与充电线、适配器，下面则是表带。 表体被一块手感细腻的毛毡套保护起来。以前似乎没有这个设计，平添一丝高级感。刚好用来收纳我的初号机。 完整的包装内容：与 iPhone 配对设置的过程就略过了。前段时间我还买了一只米家石英表。与其说它是智能手表，不如说是能连接手机的普通手表。本来的打算是用来看看时间，并设一个震动闹钟，以免手机闹钟吵醒室友，但没想到它的震动弱到难以察觉。可笑的是其包装上还堂而皇之地写着：「若感觉震动感太弱，请系紧表带」。我不太明白怎么才算紧？要勒到血流不畅吗？但米家石英表的好处是续航不错，外观也好看。作为一只「石英表」大概还是及格的。来张合照吧：米家石英表、初号机、五号机我在微博上说：\n从 Apple Watch 第一代直接跳到 Apple Watch Series 5，我真切地体会到了科技的进步。\n一方面，watchOS 愈发强大；另一方面，整个手表的运行速度大幅提升，再也不用抬着手等待 App 慢吞吞地启动了。五号机还带来了常亮屏幕，使其可用性提高了一个等级。对我来说，最重要的因素，也基本上是吸引我购买它的唯一因素，是其内置的陀螺仪、GPS 与心率传感器，这使我可以脱离 iPhone 只戴手表去跑步，同时得到准确的路径、速度与心率监控信息。另外，Watch 可以与 AirPods 无缝衔接，对我这个跑步必须听点东西的人来说这一点非常重要。但同时，这也是 watchOS 做得不太好的地方。要想在手表上独立听歌或者听播客，目前为止选择还是非常有限，似乎很少有开发者愿意真正地去优化手表 App 的体验。我目前的选择是 Overcast 听播客；iTunes 同步音乐至 iPhone 再同步至 Watch。Overcast 传输有时会不稳定，至于 iTunes 嘛……you know.今年苹果与几家机构合作，宣布开启三项全新的研究计划，侧重女性健康、心脏与运动健康、听力健康，Apple Watch 在其中扮演关键角色。这似乎是理所应当的，除 Apple Watch 外，还有哪款产品能有如此广泛的受众，又有能取得如此丰富的传感器数据呢？绕不开的一个话题是隐私与数据安全。硅谷公司中，苹果一直扛着隐私保护的大旗，在这方面的立场最为鲜明，也最为苛刻，以至于许多分析师认为在隐私问题上拒绝让步已经对其产生了不利影响。一个例子是苹果拒绝将用户数据上传至服务器，而将依赖大量数据的机器学习算法全部放到用户本机上进行，许多人认为，这是阻碍苹果人工智能研究的一块绊脚石。虽然如此，作为消费者的我们最好还是保持警惕。商业公司总能找到出路，但泄漏的隐私不存在找回一说。在换脸 App、DeepNude 大行其道的今天，有必要搞明白一点：密码可以重设，但生物信息是不能改的。把生物认证信息泄露给不可靠的第三方，这就如同把银行卡密码广而告之；二者之间的主要差别是：前者影响更深远，而且目前看来没什么补救措施。话又说回产品本身，乔布斯也许不会同意这个观点，但我确实认为一款伟大的产品是商业公司与消费者共同造就的。Apple Watch 从一开始的奢侈品逐渐转变成侧重医疗健康的「实用品」，获得商业成功的同时朝着「make the world a better place」迈进了一步。这样的一番事业，也难怪有人会为之热血沸腾。",
      "categories": [
        {
          "name": "Default",
          "slug": "Default",
          "permalink": "https://blog.imalan.cn/category/Default/"
        }
      ],
      "tags": [

      ]
    },
    {
      "title": "泸沽湖游记",
      "date": "2019-08-25T17:54:00+08.00",
      "path": "https://blog.imalan.cn/archives/422/",
      "text": "今年暑期觅得两周空闲，赶紧收拾行李赶去与家人朋友相聚。人也真是奇怪，工作时盼着放假，真要放假了却又闲不住。想起之前就与朋友有约要出去自驾游，刚巧几个好友都能凑出时间，那就出发吧！这次的目的地是泸沽湖，位于四川与云南交界。该景点由于「亲爱的客栈」播出而名声大振，游人络绎不绝，物价也水涨船高。然而终究受制于当地落后的管理与建设，设施与服务都不尽人意。\n7 月 31 日，一行五人晚饭后从成都出发，驾车至雅安市驶上成昆高速雅西段，直奔西昌。从雅安开始就多为山路，虽已是盛夏，随着海拔攀升再加上一路的绿水青山，倒也不觉得烦闷。大家都喜欢音乐，于是在车内一人一首地点歌，会唱的跟唱，气氛非常欢乐。一路上总体顺利，但仍然有个惊险的插曲。雅西高速西昌出口附近正在施工，道路狭窄，我们跟在一辆小车后面行驶时前方突然急刹并左右摇摆，我们也赶紧急刹，正纳闷怎么回事时发现路面上有很多大小不一的黑色物体，有的高度超过底盘，于是立刻降速并且左右躲闪。最终仍然有一块物体擦到了底盘，幸亏后来检查并无大碍。这段路照明不佳，想起来还是十分后怕，若是驾驶员精神稍有涣散没有及时反应，最终的结果肯定是事故。至今也没想明白黑色物体从何而来，或许是山间横风从工地中吹来的，或许是前车掉落的货物。到达西昌已是晚间十点过。五人点外卖填填肚子就洗漱睡觉，准备迎接第二日的旅程。\n第二日从西昌向泸沽湖景区出发。除开始的一小段高速外就是弯弯曲曲的省道，全是山路，仅 300 多千米的路程足足开了七八个小时。一路上肉眼可见风土人情变迁。西昌已是川内出名的民风剽悍之地，但毕竟是市；越接近泸沽湖则越有待开发的少数民族聚集地之感，常住人口也主要是彝族、藏族。我幼年住在藏族自治州，对这种环境甚是熟悉，见此番景观觉得十分亲切。其实不太好形容这类区域给我的感觉，想了半天仍然不能离开「蛮荒」这个听上去有些贬义的词，但必须明白，蕴含在蛮荒背后的是活力、生机与无限的可能性。路途遥远，我们不时停车在路边吃零食、聊天、小憩。比起成都平原潮湿闷热的空气，这里显得干爽清新不少。\n大越下午三点到达预定的民宿。住处共两层，楼下是一张大床，我们三个男生准备挤在上面；楼上其实是阁楼，有一张小床，给两位女生住。巨大的落地窗占满了一面墙，屋内明亮宽敞。可惜没留下照片。我们安顿好，稍微吃了点干粮，迫不及待地想要去看看湖。民宿距湖边还有一段距离，仍要驾车前往，此时已经快到晚饭时间，于是一瞥美景，收获了下面的照片。至此我对景区有了大概的印象。据说泸沽湖目前正在创建五星级景区，但目前来看还差得太远。虽然有一等的景色，但管理与开发实在太差。基础设施缺乏、湖边被当地居民的摊点占据，甚至拍照都有原住民在守着漫天要价。不过我想这其中的大问题还是出在原住民身上。他们受教育程度不高，能想到的也只是守着湖边卖点烤串饰品，无心也无力加入更赚钱的诸如开客栈之类的行列，在外来资本的挤压下，他们的生存空间只会更小。有时，他们对祖辈流传下来的生活方式有一种近乎固执的坚持，这时常成为一种阻碍。晚餐去了朋友推荐的一家餐馆，名叫「鱼味」，以景区的标准来看算是美味实惠。五人在半露天的二楼吃饭聊天，十分惬意。专门点了一道名叫「水性杨花」的小菜，这是一种水生植物，春夏季节会伸出水面开白色的花，远看似一片花海。离开的前一天晚我们又去了这家餐馆。同样的座位，服务员换成了一位当地的小姑娘，不到 20 岁的年龄，笑起来十分甜美。我们点饮料时习惯性地说要「肥宅快乐水」，她有点疑惑，我们笑着改口说就是可乐，姑娘也跟着捂嘴笑起来。结账时向店长夸赞这位姑娘做事干练，店长笑着回答说已经有不少客人这么说了，店里正在与她商量以后的职业道路。祝她好运。晚餐后去湖边散步，由于欠开发没有太多的光污染，得以一览湖面夜景。 买了一箱啤酒回到住处，五人玩德州扑克，筹码是喝酒，一口起跳，五口封顶。最终男生平均喝了四五瓶，女生可以折半，一人也是两瓶左右。到后半夜牌玩腻了，开始一句接一句地喝酒聊天，聊生活，聊以往的趣事（我们是初中同学），这一聊知晓不少八卦，甚是有趣。不知不觉已经凌晨三点过。五人在床上玩德州扑克第二天的主角是泸沽湖。景区有一条环湖公路，驾车绕一圈即可把湖面大部分风光尽收眼底。适逢天气大好，景色美不胜收。第一项活动是划船。早晨的泸沽湖静谧宜人，微风不时吹起涟漪，不久便平静下来，又能尽览湖底植被。远处山腰云雾缭绕，如同仙境。终于在湖面看到了「水性杨花」，但可惜很稀疏，据划船的大叔说原本很多的，但游人多起来后餐馆会偷偷摘走做菜，所以现在所剩无几。原来花海都被我们这些游客吃进肚了。划完船阳光逐渐热辣起来，幸亏起了个大早，躲过日晒。环湖公路沿途有许多观景台与沙石滩供游人逗留，我们挑选了几处下车。女生忙着拍照，男生顽劣，捡起石子开始打水漂。  边走边玩，终于到了里格观景台，在这里留下了我最爱的一张照片：我几乎不能形容看到这景象时的感受。脸上是拂来的微风，视野被硕大的湖面占满，游人的喧闹听不见，毒辣的阳光感受不到，所谓沉浸不过如此。其实已经看过很多壮美的景观了，但这次还是被震撼：蕴含其中的，是大自然怎样的精巧与善意呢？\n还有个打卡处名叫「走婚桥」，名字来源于当地摩梭族的走婚传统。桥上有人给人编发辫，我们怂恿两位女生试了试，还真挺好看。 走婚桥上人特别多，也许大家都想蹭蹭「过桥者能长长久久」的彩头。不过桥头遇到一对吵架的情侣，吵架方式挺奇特，就像在谈合同。晚上回到住处，打开阁楼天窗发现夜空晴朗，便有人拿出手机张罗着要拍星星。拍星星的忙着，其他人就每人一瓶啤酒听歌聊天，分享各自拍的照片。大家都比较疲惫，这一晚休息得早。\n第二天返程全天都在车上度过，听歌、聊天、吃零食、睡觉。到家已经是晚上九点过，至此泸沽湖之旅圆满结束，大家纷纷在群里晒照片，把几个没去成的朋友气得牙痒痒。有人说我们几个人一起出去玩时是最轻松的，不用担心能不能玩到一块儿，没有拧巴的人，不用端着，互相知根知底，什么都能聊，没有人扫兴。这大概就是十多年的友情吧。说到底，是景色重要，还是游玩重要，还是与友人共度的时光重要呢？对我来说答案倒是显而易见的。",
      "categories": [
        {
          "name": "Default",
          "slug": "Default",
          "permalink": "https://blog.imalan.cn/category/Default/"
        }
      ],
      "tags": [

      ]
    },
    {
      "title": "泛用人形决战兵器 ─ EVA 初号机、装配完毕！",
      "date": "2019-08-18T20:59:00+08.00",
      "path": "https://blog.imalan.cn/archives/421/",
      "text": "朋友最近沉迷高达模型不可自拔，于是送了一个 EVA 初号机模型给我作为生日礼物，企图拉我入坑。其实我小时候拼过高达，但都是玩的盗版，这次就让我来看看万代正版的实力吧！  说明书内页是日文，一开始担心看不懂，但实际上涉及装配的地方都有非常明了的图示，完全不必担心看不懂，只需要按部就班装配即可。说明书内页 零件板关于图示我要表扬一下，真的非常细致，各种标记、剖面图都很准确，不知怎的竟然回忆起了本科时被工程制图支配的恐惧。模型还原度还是非常高的，连日常看不见的插入栓都有，最终成品上也可随时取出与植入：暴露在外部的插入栓 上半身组装完成不知道与高达模型比起来零件算多还是少，由于 EVA 结构比较特别，这个模型又是所有关节都可以活动的，因此有很多细小零件，用剪刀取的时候要特别注意，装配时也要小心，不可用蛮力。模型带的武器有：高振动粒子刀（收起状态）、高振动粒子刀（出鞘状态）、Pallet Gun、Gatling Gun，另外还有一个 A-T Field 附件。为了使用这些武器，模型的手部组件就有好几套呢。直接看看装配完成的图片吧！（加特林机枪忘了照）初号机出动！ Pallet GunA-T Field 撕裂 - 正面 A-T Field 撕裂 - 侧面高振动粒子刀准备出鞘 高振动粒子刀战斗状态遗憾的是我的细节处理很毛糙。理论上应该把所有的水口（零件与零件板的连接处）用砂纸打磨，最后还要喷消光漆去除塑料感，但是我既没有砂纸也没有漆，就作罢了。如果后续还有机会的话我可能会购置一套工具与漆，到时候再补上吧。",
      "categories": [
        {
          "name": "Default",
          "slug": "Default",
          "permalink": "https://blog.imalan.cn/category/Default/"
        }
      ],
      "tags": [

      ]
    },
    {
      "title": "少数派聚会、在地铁站啜泣的女孩",
      "date": "2019-07-14T23:06:00+08.00",
      "path": "https://blog.imalan.cn/archives/405/",
      "text": "7 月 13 日少数派来北京举行了一场线下聚会，主题是「跟那些过去聊聊」。之所以叫这个名字，是因为举办地在中国第一家苹果电脑博物馆即北京中关村创业博物馆。少数派创始人老麦与博物馆主理人张淼都上台分享了一些关于创业、关于理想的故事，另外请来一位少数派作者吕江涛以及 MarginNote 开发者 Min 分别分享了自己领域的心得。与老麦合影 整个活动还是很充实的。参加少数派线下聚会是我期待已久的事情，但奈何其大本营在深圳，迟迟没有来北京举办；这一次也不只是少数派聚会，还有介绍宣传创业博物馆的意图。对少数派我是很有感情的。因为第一次写教程文章被人读到并且收获许多正面评价就是在少数派的 Matrix 社区，那也是我第一次收到稿费。当时大概是大二大三的样子，兴趣正浓、势头正劲，每天会花很多时间折腾各种应用各种工具，也努力钻研自动化和效率流程。那时与效率圈子里的同好交流频繁，特别从少数派目前的主编 JailbreakHum 身上学到了很多做事的态度，可以说是受益至今吧。后来渐渐起了一些变化。随着 Hum、文刀、千千主理的科技播客 Checked 停播、少数派改版、自己也临近毕业渐渐忙碌起来，我逐渐不再花太多时间了解新的 App、折腾新的技术，也很少再与圈子里的同好交流，仅仅是偶尔在微博上发表一些简短的看法。Hum 似乎从社交媒体毕业，现在很少能看到他的动态，应该是把主要的精力放在制作少数派的付费内容上了。 经典的彩色 iMac 系列少数派上次的改版是一个很重要的改变。这次聚会老麦聊到，2017 年底少数派已经到了很艰难的时刻，他能靠着借来的 100 万硬撑下来，完全靠着少数派目前看来相当成功的转型，即推出付费内容、付费教程，直至今年，少数派已经稍有盈利。这次改版商业上相当成功，但是也有一些人不喜欢。比如我，就觉得网站体验甚至不如以前；而且文章开始变得，怎么说呢，「油腻」起来了。另一个变化是少数派的稿酬结算方案，在改版前，发在 Matrix 的文章只要被推上首页就能获得稿酬，比如像我这样；改版后，必须要成为签约作者、保证产出才行，门槛高了不少，这无疑打击了了许多「业余作者」的积极性。我在微博上发牢骚，抱怨少数派现在「社区氛围很淡」，老麦回应说「现在随便写写的确实不太顾得上了」，也就是明确地说明，少数派仍然是媒体，重心不在社区。但是这次惊喜的是老麦表示有计划对 Matrix 社区进行重造，更改稿酬结算方案，更贴近之前的方案，并且引入包括推荐、量化、结算在内的自动化流程，这让我非常期待。我向来相信社区的力量，有非常多厉害的人都藏在社区里，但他们中很多没有出来分享，引诱他们现身绝对是社区主理人的重要任务。不过老麦也说，新版少数派目前的重点还是先把首页做好，Matrix 改造属于下一步工作。Matrix 从少数派创立伊始就在整个版图中有着重要的地位，老麦还有很多想法待尝试与验证。现在回想起来，少数派的一系列决定确实相当明智。现金流不足当然无法维持慷慨的稿酬、文章晦涩难懂自然难以得到有效的传播。我作为旁观者，真心的希望少数派这类良心媒体不仅能走下去，还能过得很好。\n聚会当晚有个小插曲。当时我与朋友唱完 K 准备回寝，在五道口地铁站遇到了一位缩在长凳上啜泣的女生，与我年龄相仿，身边放着一个电脑包，看上去像是学生或者公司职员。也许是因为失恋，也许是因为被老板责备，也许是因为加班到末班车时刻带来的疲惫，她看上去很难过，也很累。我不是会去安慰人的类型，但可能五道口的特殊气质使然，我走近她说：「别太难过了，问题不大……累了休息一下也挺好的」，对方随即抬起头抹掉眼角的泪水，挤出笑容对我点点头，然后又把脸埋回了手臂。我没有再说什么。过一会儿传来了更清晰的哭泣声，不知道是因为更难过了还是想开了什么。地铁已经到站，我只能上车留下她继续休息。现代人非常可怜，即使被现实压迫到午夜缩在地铁站哭泣，也不能有什么像样的反抗。这样的事情天天都在发生，「悲喜世间烂剧，昼夜轮播不停」。我们都知道自己的悲喜太渺小，无法激起任何涟漪，只能稍微掉几滴泪然后打起精神继续挣扎。我们没法一走了之，没法浪迹天涯，因为冲不破社会这个坚固的牢笼。也不必太绝望。虽然不能改变的事情很多，但我们永远可以改变自己。自由首先是精神上的概念，然后才是空间上的概念。",
      "categories": [
        {
          "name": "Default",
          "slug": "Default",
          "permalink": "https://blog.imalan.cn/category/Default/"
        }
      ],
      "tags": [

      ]
    },
    {
      "title": "一则不大不小的旧闻",
      "date": "2019-07-02T15:46:00+08.00",
      "path": "https://blog.imalan.cn/archives/399/",
      "text": "2015 年北京骨髓库来学校宣讲，号召学生把造血干细胞配型信息入库，待需要骨髓移植的患者查询，需要时以备捐献。我觉着是一桩好事，也入库了。没想到今年四月末真收到北京骨髓库的通知，说我与一名患者十个基因位点配型全相合，问我能不能继续完成骨髓捐献。我第一反应感觉是骗子，但经过核实确有此事。  工作人员把我的反应详细记录下来了，可见我最初是怀疑的从动员我的工作人员口里了解到一些事实，我觉得有点唏嘘。中华骨髓库目前有超过二百五十万条志愿者配型信息，但从建立至今二十多年间，全球范围内完成捐献仅仅 7000 多例，其中北京分库只有 300 多例。相当一部分中止捐献不是因为配型不合，而是志愿者临时反悔。骨髓捐献是自愿的，所以不能强迫志愿者，但是悔捐确实使患者在看到一丝希望后又不得不再次面对绝望。特别是在患者已经进入待移植状态时（这时候患者已经接受了大剂量的放疗和化疗，自身原来的干细胞几乎全部被杀死了，免疫力也接近零），若志愿者拒绝捐献，那患者就约等于死路一条（不过到这个阶段近年貌似有强制措施了）。病人家属只能通过这一个个小方盒与病房内交换物品，避免污染 病区探视窗口，患者是被隔离的，只能通电话我觉得配型相合真的是很难得的缘分。特别是与我这样非亲缘关系的人十个基因都相合，概率很低。这时真是冥冥之中自有天意。后续是我去接受了高分辨率配型复核，现在还在等待患者的治疗计划下来，然后就是体检和正式捐献。但这个过程可长可短，说不清具体的时间。也有很多志愿者最终也没能捐出去，因为患者，因为各种原因，不再需要了。我不知道跟我相合的患者是什么情况，只能默默希望他或她能好起来。呐，这事要是能成，难道不是一件大好事么。",
      "categories": [
        {
          "name": "Default",
          "slug": "Default",
          "permalink": "https://blog.imalan.cn/category/Default/"
        }
      ],
      "tags": [

      ]
    },
    {
      "title": "Mailer：又一款评论邮件提醒插件",
      "date": "2019-05-24T10:07:00+08.00",
      "path": "https://blog.imalan.cn/archives/349/",
      "text": "Typecho 的轻量导致某些基础设施缺失，邮件通知就是其中一项。这些年来无数人写了无数的邮件通知插件，其中许多要不是极度臃肿，要不就是年久失修了。我之前在用的插件（CommentToMail）使用队列来保存发信任务，需要外部访问某个触发网址才能一次性发信。之所以不在评论完成时立即发信，是因为发信是耗时操作，会导致前端等待很久。终于，2017 年 11 月 Typecho 开发版中增加了一个异步回调方法，正好用来完成耗时的、但又不需要立即获得结果的任务。Joyqi 使用这个新特性写了一个邮件提醒 Demo，我基于此 Demo 增加了自定义模板以及一些其它细碎功能，调整了发信规则，最终替换掉 CommentToMail 用在了自己博客上。这里放出来，供需要的人取用。项目地址 | 欢迎 Star！本插件需要使用 Typecho 开发版（17.11.15 及以上版本）。使用方法\n下载插件，上传至插件目录，后台启用后设置相关信息。然后在博客评论区 form 元素中合适位置添加：&lt;span&gt;\n  &lt;input name=&quot;receiveMail&quot; type=&quot;checkbox&quot; value=&quot;yes&quot; checked /&gt;\n  &lt;label for=&quot;receiveMail&quot;&gt;&lt;strong&gt;接收&lt;/strong&gt;邮件通知&lt;/label&gt;\n&lt;/span&gt;\n\n以上代码必须添加，不添加不会发信。VOID 主题开发版已做了处理。然后在插件设置页面填写发件信息。注意，如果你是用的 QQ 之类的邮箱，可能需要生成专用密码，而不能直接使用登陆密码。插件默认提供了一个比较简单的发信模板，如果有好看的模板欢迎在评论区分享。模板中可以使用一些变量，见插件设置页说明。发信规则\n基于如下规则发信：\n\n\n  评论者\n  被评论对象\n  发信规则\n\n\n\n\n  博主\n  文章\n  不发信\n\n\n  博主\n  博主\n  不发信\n\n\n  博主\n  访客\n  提醒访客\n\n\n  访客\n  文章\n  提醒博主\n\n\n  访客\n  博主\n  提醒博主\n\n\n  访客\n  访客（本人）\n  提醒博主\n\n\n  访客\n  访客（非本人）\n  提醒评论对象与博主\n\n\n\n也可以单独设置是否提醒博主或者访客。待审或垃圾评论不会提醒访客。LICENSE\nMIT © AlanDecode. You are welcome.",
      "categories": [
        {
          "name": "Default",
          "slug": "Default",
          "permalink": "https://blog.imalan.cn/category/Default/"
        }
      ],
      "tags": [

      ]
    },
    {
      "title": "数字世界舒适区",
      "date": "2019-05-19T15:39:00+08.00",
      "path": "https://blog.imalan.cn/archives/348/",
      "text": "网易云音乐给我推送了一个名叫《拯救歌荒大作战！下一首单曲循环》的歌单，简介里是这么写的：\n无论你正在处于歌荒期还是一堆好听的歌听不过来，这个歌单都不会让你失望！从流行到说唱、从民谣到摇滚，这张歌单都能满足你的期望。\n跳出听歌舒适区，这里有好音乐在等你！\n我最近换了手机，新手机下载网易云音乐后尚未登录账号，这时打开首页直让我惊讶：这都是些什么啊！有此感受的人应该不在少数，这就是所谓的「filter bubble」：精准推送限制了用户接收信息的广度，人们只能看到自己喜欢的东西，以至于久而久之就以为世界真是如此。此事若深究起来其实相当可怕。许多科幻作品中都有通过生物技术入侵人脑控制思维的桥段，但要掌控一个群体的意志根本不需要这种程度的科技，今日头条、微博、Twitter、Google 已经做到了。你看看你时间线上的萌宠视频、篮球集锦，有没有一时间觉得这个世界喜欢宠物才是主流、大家都是球迷？实际上不一定如此，但互联网公司只给你看一面之词，你就被这一面之词所骗。上次美国大选期间特朗普支持者就曾指责希拉里团队通过在 Google、Facebook 上展示特朗普负面新闻来干预大选，足以说明上文的忧虑绝不是耸人听闻。利用「filter bubble」操纵群体行为已经进入实操阶段了。这很讽刺。互联网曾经许诺全世界：信息流通将会无比自由，交流无比通畅，误解与隔阂将会越来越少。现在却反其道而行之。文首提到的歌单介绍中有一个词：「舒适区」。这个舒适区是互联网企业一手造就的，当它们整天把「垂直细分」、「领域深耕」这些词挂在嘴边时就应该预料到。留给我们的问题是如何反抗。反抗很难。也许 RSS 这类古早技术是一个路子 ── 至少目前我不知道有通过 RSS 收集用户偏好的方法。RSS 是反商业潮流的，历史已经证明反商业潮流很难行得通。也许我们真的要等互联网企业认识到这个问题的严重性，然后在推荐算法中加入更多的随机量，就像网易云音乐给我推荐那张歌单一样。ACG 听了太多，听一些重金属未尝不可。",
      "categories": [
        {
          "name": "Default",
          "slug": "Default",
          "permalink": "https://blog.imalan.cn/category/Default/"
        }
      ],
      "tags": [

      ]
    },
    {
      "title": "春天、联谊、新耳机",
      "date": "2019-04-16T23:04:00+08.00",
      "path": "https://blog.imalan.cn/archives/317/",
      "text": "很久没写这个日常系列了。倒不是没有可写的东西，而是可写的太多太杂，反而不知道该如何切入。我读林檎的这篇博客，类比其中的说法1后发现在写博客这个层面上我竟也陷入了 naive 这个类别：即渐渐变得更愿意在博客上写所谓的技术文，也就是「干货」，而自己内心的杂思却难以下笔。技术文固然有技术文的价值，分享技术是我写博客的初衷之一。但既然我同时有一个更长远、更稳定2的 Wiki 站点，当前这个博客可以变得更多彩一些。写心中随想是很困难的。技术自身就蕴含着逻辑性，只要我自己懂了，写出来的东西总不至于乱七八糟；但是心中的杂思却不同。逻辑性并不是胡思乱想的特征，相反，正是随意与没有逻辑才使白日梦生机勃勃。因此写作者会经受巨大的考验。从一团乱麻中理出线头，然后娓娓道来；挖掘出藏在深处的关联，悟出这些念头的偶然性与必然性。这几乎是艺术与哲学的范畴了。另外，蔡琴是这项活动的绝配。\n北京的春天确实短暂，今天我就脱下了外套，上身只剩一件短袖。早晨通勤路上的老者惊讶地对我说「小伙儿身体真好！我这还穿着毛衣，你就只穿短袖了！」，我才意识到街上确实只有我穿得这么单薄。就当是 23 岁的任性吧。春天最深刻的记忆就是过敏与杨絮。今年我做好了准备，开瑞坦早早地买好、口罩早早地备好，因此没有受太多苦。今年春天的记忆可加上一条：与北京师范大学教育学部的女生们联谊。联谊会由我所在学院与北师教育学部的研究生会共同举办，地点在北师校园。男生们下午一点半从学校出发，在北师英东楼集合，待男男女女都到齐后便开始主要活动：打卡闯关游戏。主办方在北师校园各处设置打卡点，每到一点即可获取下一点的线索。两男两女共四人一组，通力合作解谜闯关，用时少者获胜。与我一组的男生就住我对面寝室，但平时并没有太多来往，借这次机会也相互了解了一些（即在楼道相遇时能不尴尬地打招呼了）。我和他都以为这个打卡游戏是边走边聊的休闲活动，顺道欣赏春天的北师校园，哪曾想两位女生相当期待胜利，游戏开始便一路狂奔，我一度吃不消（因为脚上有伤），不得不满怀歉意地要求慢一些。慢下来后才有机会闲聊与参观校园。北师校园绿化极佳，树木、灌木、花草各有特色，刚好是开花的时节，真是赏心悦目，但可惜并没有留下太多好看的照片。令我印象最深的是北师数量惊人的郁金香，以及路边大片大片的不知名小花。路边小花 大片郁金香两位女生都很活泼开朗，交谈起来没有生涩的感觉。我发现其中一位相当博学，对教育、植物、形势、技术都有了解。聊天得知她的研究方向是「用技术解决教育问题」3，还有一位老师与 Apple 合作开发 AR/VR 相关产品，涉及的领域包括计算机图形学、机器学习、数据挖掘等等，我觉得非常酷。另外最令我羡慕的是她所在的实验室分工相当明确，从设计到编码到测试到反馈迭代都有完善的流程和明确的分工，不禁感叹我所处的工科院校实验室竟然会在这上面落了下风。另一位的研究范围我没有听得很明了。我的理解是类似「为社会谱基调」的工作。大概意思是目前的教育培养出的人才从根本上就是不利于社会与环境的可持续发展的，她的研究就是寻求一种教育方式上的范式转换，从教育的角度为环境问题与可持续发展问题求一个解。当然这不容易，她也觉得这有些空洞。但相反，我觉得这很重要。大概是一两年前，我在火车上有感而发，发过一条微博（准确的内容记不清了）：\n理工科素养是成为创造者的要素，但是文科素养是一个人行事风格的基调。这种「基调」是会扩散到周围环境的。\n教育就是在帮人谱基调。这在我看来是非常重要、非常有意义的一件事。真心期望这位女生能在该领域取得一些进展。活动结束后四人一块儿去北师一家饭店吃了晚饭。菜似乎点多了，最后在女生的高压下吃得八九不离十了（好撑）。附上一张合照～\n算了，还是不放了\n另，打卡闯关环节本组在女生们的 carry 下斩获一等奖?。\n都说不要在晚上做任何购买决策，果不其然，没忍住入手了铁三角家的 LS50IS 入耳式耳机……我之前曾说我受不了任何入耳的东西，因而与很多高端耳机无缘，但这次仿佛是找到了入耳式耳机的正确打开方式。红色款，形象气质佳一者，LS50IS 是耳挂式，会比普通的入耳戴的稳固一些；另一方面 LS50IS 相比起 im 系列导管短了一丢丢，这也提升了佩戴舒适感。经过这一天的使用，发现我对入耳式耳机的听诊器效应还是有些不适应，但整体上是可以接受的。音质是一大亮点。入耳式耳机隔音性能远胜于平头，因此在营造声场、解析力等性能上有得天独厚的优势。蔡琴的《渡口》里那几声鼓和梆子听的我热泪盈眶。不过评价音质是文学家的领域，我不擅长。关于隔音，还记得戴着 AirPods 乘地铁的体验吗？那时我的手机音量会开到近 70% 才能听清声音，这已经是相当危险的数值了。但是 LS50IS 只需要 40% 左右，要知道，这甚至都不是一副降噪耳机。另外我办公室工位旁边有一台装了 4 张 1080 Ti 的主机，24 小时不断输出噪音，LS50IS 的隔音性能也让我相当受用。其实不久之前我还入手了一副平头：拜亚动力 DP100。早就知道平头塞爱好者生存环境很差，选购找评测的时候确实深感不易。优质的平头都已经停产，只剩下创新 Air 等几款扛把子在售；新的中高端耳机几乎没有平头，DP100 也不过是 200 RMB 的价位，实在称不上是中端耳机。刚拿到的时候还是相当满意的，从声音到外形都物价相符，后来发现不知道为什么，也许是因为材料，这款耳机很容易起静电。你能想象耳机在你耳朵里放电打火花吗？所以不得不结束了 DP100 短暂的服役期。最后思来想去只有苹果自带的 EarPods 是属于我的理想平头。当然也包括 AirPods，毕竟二者外形相同，佩戴感也相同，音色差别不大。\n按理说我是没空写这篇日志的，因为还有许多事情没做完。接下来又要去南京出差几日，待回北京肯定是身心疲惫。不过趁着联谊记忆还在，新耳机的新鲜感尚未消退，还是赶紧把当前的心绪记录下来。那么，下次再见。\n\nnaive reader、imaginative investigator、dreamer / interpreter&#8617;\n托管于 Github Pages 上&#8617;\n引用原文&#8617;\n\n\n",
      "categories": [
        {
          "name": "Default",
          "slug": "Default",
          "permalink": "https://blog.imalan.cn/category/Default/"
        }
      ],
      "tags": [

      ]
    },
    {
      "title": "Tp2MD：导出 Typecho 文章与页面",
      "date": "2019-03-16T12:40:00+08.00",
      "path": "https://blog.imalan.cn/archives/303/",
      "text": "项目地址：Typecho-Plugin-Tp2MD。一边听歌一边写了这个插件，作为工作之余的消遣。这个插件可以将 Typecho 中的页面、文章导出到 Markdown 文件中，并且支持将自定义字段、slug、分类、标签、标题、作者等等 metadata 以 YAML front-matter 的形式存储在文件顶部。同时也支持将文章按分类放在不同文件夹中。除了作为文章备份使用，对想要将博客迁移到 Hexo 等平台的同学来说这个插件可能也会有用。LICENSE：MIT © AlanDecode。",
      "categories": [
        {
          "name": "Default",
          "slug": "Default",
          "permalink": "https://blog.imalan.cn/category/Default/"
        }
      ],
      "tags": [

      ]
    },
    {
      "title": "编舟记",
      "date": "2019-03-10T11:58:00+08.00",
      "path": "https://blog.imalan.cn/archives/291/",
      "text": "若要你解释「右」这个词，你会如何作答？《编舟记》刻画了一本名叫《大渡海》的辞典从立项到出版的过程，历时 12 年之久。我昨天午夜看完同名电影，直到现在不能释怀，三浦紫苑的剧本加上几位演员的精湛表演给了我极大的震撼。虽说作品本身讲的是辞典编纂的故事，但实则是对「宅人」的礼赞。三浦女士大概对这类小众而执着的工种有特别的偏爱，《真幌站前》讲的也是便利屋这种说不上高端的职业。这前后是说得通的，越是小众的工种，越无法被大众理解，即使如此还要一门心思投身其中的人，可说是值得尊敬的职人。这其中出神入化者，可称为「宅人」。由于荒木编辑退休而被调来的马缔从一开始就被定性为「宅」：迟钝而不善交际，甚至由于名字谐音而被同事叫做「认真先生」。不过荒木的一句话点出了重点：不认真的人，编不了辞典这么说吧：不认真的人什么也干不了。主编也好，荒木也好，香具矢也好，造纸工人也好，他们看上去都只是正正经经的社会人，然而在我看来都是不折不扣的「死宅」，中二感爆棚。\n其实昨天我去参加了联谊，听到的全是些新词，真是度过了一段有意义的时光。\n能说出上面这一段话的人，恐怕是要被骂成「直男癌」的吧。联谊会上不推杯换盏谈天说地，倒是关注什么「新词」，这与无线电爱好者、铁路爱好者、字体排印爱好者等等 maniac 别无二致，而这些统统都是大概率会被视为「异类」的人。我说过我喜欢「宅」所蕴含的精神属性。这个词用来挖苦不善交际、活在自己世界里的人，从一开始就是纯粹的贬义。不过令我感到意外的是，这反倒是成了现代社会所缺乏的一种特质。社会大可对宅人宽容一些，其实人浮于事的一个原因便是人们找不到自己所愿意投身的事业，换言之，找不到自己的「宅点」。无论是电影里的马缔，还是他一心学习厨艺的女友，一旦宅起来都很帅气：和式菜刀有很多种。这是切鳗鱼用的菜刀，这是厚尖刃菜刀，厚尖刃菜刀是用来切鱼和鸡之类有骨头的硬质食材的。然后这是柳刃刀，切生鱼片用的。锻造菜刀的方法也有两种：全钢和霞。全钢用的是纯钢锻造，而「霞」是用钢和铁复合锻造，钢的部分就成了坚硬而锐利的刀锋，钢与铁的交界处会形成美丽的「霞」。听说这就是它名称的由来。\n我才不管什么时代，我想编出「大渡海」。\n宅人的能量是可以超乎想象的，去骂骂蔡徐坤和吴亦凡你就能体会到了。但这是坏事吗？这是好事啊。如果可以因为偶像被诋毁而爆发中二宇宙，那也可以因为其它任何事爆发同样的宇宙：只要那触到了你的「宅点」。宅人之所以无法为世人接受，背后的原因大致是信息上的割裂，我曾发过一条朋友圈：\nUnderground 不是指见不得光的东西，而是除圈里人外没人能 get 到 high 点的东西。据此我认为吴亦凡和蔡徐坤都是 Underground 典范。\n与外界交流信息、互通有无是宅人永远的痛点。你所专注的东西是小众的，不为世人了解的，世人自然而然的无法理解你，无法与你感同身受。因此宅人们「活在自己的世界里」，变成了被世人猎奇的稀奇物种。反过来也是，宅人无法理解世人：你们为什么会对铁路不感兴趣呢？？？老太太给了我们回答：不懂别人的感受不是很正常吗？就是因为不懂才会对那个人感兴趣吧？就是因为不懂才需要交流吧？「宅人」与「非宅人」之间的和解是电影中很重要的一条线。马缔与同事西冈之间从无法相互理解到能够合理分工利用自己的特长，就是一个很好的案例。另外，马缔逐渐向心上人吐露真情，也代表着这位宅人终于与外界接轨了：「恋慕」：喜欢上一个人，无论是梦是醒，脑海中都萦绕着对方的身影，无心做任何事，烦恼苦闷的心理状态。一旦成功，则欣喜若狂，如直冲九霄宅人很酷，我想说的就是这个意思。「宅」的精神与所谓工匠精神底层上有相似之处。「宅」的状态与雕刻家聚精会神完成作品时的状态根本就是相同的，这是一种排他的、高能的状态。说到底，若要想真正地完成些精妙的东西，不中二是不行的。马缔对辞典纸张手感挑三拣四时，造纸工人除了一句「我们再研发！」之外别无多言，这才是我们需要追求的。若你向别人说起某事物时得到评价说「这是除了你之外没人关心的东西」，直接大方的回应吧：「这确实是我关心的东西。而且，我认为它很棒。」\n另，「右」：面朝西方站立时，朝北的方向。当翻阅这本辞典时，偶数页的方向。数字 10 中，0 所在的方向。",
      "categories": [
        {
          "name": "Default",
          "slug": "Default",
          "permalink": "https://blog.imalan.cn/category/Default/"
        }
      ],
      "tags": [

      ]
    },
    {
      "title": "观《网络谜踪》有感",
      "date": "2019-02-28T23:35:00+08.00",
      "path": "https://blog.imalan.cn/archives/273/",
      "text": "我给这部影片打了 5 星。这绝对是值得一看的作品，若你自认为自己对科技、网络安全、隐私了解不少，那你更应该看看这部电影。电影的剧情当然很精彩，但是这是一部剧情片，我不好剧透。况且最触动我的并不是剧情。对科技有一定敏感度的人一定会对电影里出现的各种操作系统印象深刻。从 Widows XP，到 iOS，到 OS X，到 Ubuntu，电影里在不同场合不同时间出现各种界面 —— 男主正是在这些不同的设备、操作系统中搜集信息，破解谜团。特别让我感到震动的是：电影对这些界面的模拟几乎到了吹毛求疵的地步，或者说「模拟」这个词都不恰当，因为据说某些场景剧组是直接在实机上拍摄的。这让我得到了非常强的沉浸感，因为我会把自己带入成男主，思考如果是我该怎么处理。这是一个打动我的点。电影中的 OS X 界面\n另一个点在于数字世界的隐私问题。世界上鼎鼎有名的三家公司：Facebook、Google、Apple 每天都把隐私放在嘴边，但实际上第一家的隐私丑闻从来就没有停过；后两者名声稍好，但是电影里我们可以看到男主如何巧妙地利用安全邮箱重置密码来破解账户。要知道，安全邮箱或者安全电话号码是世界上最广泛采用的验证方式。实际上：只要攻击者对你的信息有足够的掌握，没有密码是不能破解的，没有系统是不能攻入的。使用安全邮箱重置密码这或许让一部份笃信「数字世界无隐私」的人信心大增，毕竟电影给出了一个活生生的例子。这些人觉得，若要有隐私，那就别上网吧。我不愿接受这种略显犬儒的思想。但说实话，我有什么解决方案吗？我没有。\n最后一点是：网络究竟能在多大程度上还原作为数字世界原住民的我们。「数字世界原住民」指的是没有经过刻意的学习就会上网的人群，比如我这一代人。我们近乎无私地把自己的身份、偏好等等信息奉献给了互联网。那么利用互联网到底能在多大程度上拼凑出我这个活人呢？No，使用互联网不能拼凑出现实世界中的我。But yes，使用互联网能拼凑出网络世界中的我。现实世界中的我、网络世界中的我都是我，甚至很难说到底哪个才最接近我的本质。我活在网络上时，身上少了世俗礼仪的负担，也少了道德约束，因此看上去更容易暴露出面具下的本质，这时候网络就成了一个照妖镜。不如试着以局外人的视角看看自己的博客、微博、Twitter，试着构想一下这些账号的主人，与你自认的自己是否有偏差？这么想来真不可思议：几十亿网民，活生生地因为上网而人格分裂了。",
      "categories": [
        {
          "name": "Default",
          "slug": "Default",
          "permalink": "https://blog.imalan.cn/category/Default/"
        }
      ],
      "tags": [

      ]
    },
    {
      "title": "Setup 变更：MacBook Pro！| 揽件日志",
      "date": "2019-02-24T21:43:00+08.00",
      "path": "https://blog.imalan.cn/archives/267/",
      "text": "从去年下半年开始我一直是同时在使用两个笔记本：联想 R720 与华为 MagicBook，一个用于实验室项目，一个用于个人项目以及日常使用。如今有了点小变化：MagicBook 淘汰，MacBook Pro 加入！\n联想 R720 是本科毕设的时候买的，当时的项目有用到 CUDA，但之前的笔记本并没有独显，因此就选了个相对性能强劲的笔记本。512G 固态 + 1TB 机械、16G 内存、i7 7700HQ 的配置足够我使用好几年了。因此它现在在实验室好好地待着，处理所有的脏活累活。但是 R720 实在太大太重，而且太丑了。于是我购入了华为 MagicBook 锐龙版，使用了半年。说实话我对这个本子大体而言还是相当满意的，它轻薄、小巧、续航强劲，而且有一块超出我期望的触控板，半年里用这个笔记本写作业写博客写代码都毫不费劲。不过这个本子于我而言还是不那么适合。锐龙处理器虽然在性价比上确实没的说，但是在某些吃性能的场景下就比较吃力了，另外似乎这个处理器有一些兼容性问题，成了日常使用的不稳定因素。屏幕是另一个问题，MagicBook 的屏幕偏色严重，我在社交网络上搜索了一圈，发现这不是个例。另外，2018 年冬天 MagicBook 曝出了严重的品控问题：转轴鼓包，我身边就有朋友中招。因此我动了换掉它的心思。话说我对 MacBook 神往已久了。大一时用过，但是由于专业的原因不得已换掉了（当时尚没有能力去折腾调教），现在我折腾技术逐渐成熟，加上有 R720 帮我做脏活，工作需求上不再有问题。我对 macOS 这样类 UNIX 的系统也十分感兴趣。过多的思考只会导致优柔寡断，于是下手了一台 MacBook Pro 2015。macOS之所以是 2015，是因为这是我觉得最综合的一款 MacBook Pro。没有 Touch Bar，但是有完整的功能区按键；没有 Type C，但是有齐全的 Type A USB 接口与  历史上的神级设计：MagSafe（我认为苹果把这个砍掉是极其愚蠢的决定）；触控板面积比 2016 要小，但是却有手感好得多的键盘！在这台机器上我确定能得到完整的 Mac 体验。到手之后就一个字：香！Mac 这块屏幕真的太舒服了，非常细腻，色彩准确，导致许多东西颜值直接攀升。另外得益于 macOS 的渲染机制，在如此高分辨率的屏幕上也不会出现 Windows 上文字与图标小得瞎眼的问题。苹果的硬件生态是一大杀手锏。Mac 上直接通过 iPhone 接打电话、收短信；通过 AirDrop 与 iPhone 互传文件；这些比较细微（看起来也不常用）的功能，一旦用上了就会直呼真香。另外 AirPods 与 Mac 的配合也很舒服：在 Windows 上 AirPods 必须以传统的蓝牙耳机的方式配对，多有不便；在 Mac 上则是无缝配对，与 iPhone 无缝切换。顿时有了这一切都在我控制中的感觉。软件生态是另一大杀手锏。我有段时间对折腾 App 很着迷，因此我知道 Mac 上有很多设计精良的  App，这次也如愿以偿用地上了它们。我购入了 Setapp，这个订阅服务还是相对比较划算的：学生价 $5 一月，包含的 App 还算质量上乘、内容全面。办公软件方面直接用 Office 365 即可。我在使用的部分 App另外 macOS 是类 UNIX 的系统，许多东西会方便得多，也快得多。PHP、Apache、Python、Ruby 等等都是自带的，加上 Mac 上强大的包管理工具 Homebrew，软件安装、管理都很方便。代码编辑器我仍然使用 VS ​Code，配合 Dash 写代码也很舒服。终端环境我还是在使用 bash，但是有点想换到 zsh 试试。写文章还是用 Typora（Ulysses 的 Markdown 语法不全面)。总而言之，对这次 Setup 转换很满意，everything is cool.",
      "categories": [
        {
          "name": "Default",
          "slug": "Default",
          "permalink": "https://blog.imalan.cn/category/Default/"
        }
      ],
      "tags": [

      ]
    },
    {
      "title": "Typecho 搜索增强：ExSearch",
      "date": "2019-02-19T20:30:00+08.00",
      "path": "https://blog.imalan.cn/archives/261/",
      "text": "Typecho 中没有单独的搜索页，绝大多数主题的所谓「搜索页」只是为搜索框单独写了一个样式，具体的搜索还是靠页面跳转。我对 Typecho 的搜索从来没有满意过，因此这次我想办法将其增强。\n🔍 为 Typecho 带来实时搜索体验\n项目地址：ExSearch，使用方法见：README.md。对于 VOID 主题，只需要下载启用插件，并建立缓存即可,主题已针对插件做了适配。我需要为 Typecho 添加搜索实时响应、高亮与预览功能。泽泽的搜索插件通过 hack Typecho 的内部方法实现了高亮与过滤功能，但是仍然不能实现实时响应。其实也能理解，如果跟随输入实时响应的话，数据库的压力大大增加，而且网络压力也大大增加。必须另辟蹊径。我在为什么每个人都应该有自己的 Wiki中提到自己启用了 Wikitten 这个 Hexo 主题作为自己的 Wiki 站点主题。其中很重要的一个原因就是它舒服到无以复加的搜索体验。Hexo 这样无后端的博客为我提供了新的思路：将内容静态化，使搜索在前端进行。这样不仅降低了数据库压力，节省了网络请求数，同时也不用与 Typecho 的内部方法作斗争。唯一的缺点是对内容过多的站点来说需要传输一定数量的内容到前端，但这通过缓存静态化与前端长缓存也能缓解。最终的结果便是这个插件。",
      "categories": [
        {
          "name": "Default",
          "slug": "Default",
          "permalink": "https://blog.imalan.cn/category/Default/"
        }
      ],
      "tags": [

      ]
    },
    {
      "title": "VOID：现在可以公开的情报",
      "date": "2019-01-21T18:08:00+08.00",
      "path": "https://blog.imalan.cn/archives/247/",
      "text": "作为计算机术语时，VOID 的意思是「无类型」。在本文中，它是由我开发并开源的第二款 Typecho 主题。写本文时距离我发布上一款也是第一款主题 RAW 并不久。一开始我对 RAW 很满意，但它逐渐成为了我的试验田、游乐场，而不是一个可以给大家使用的作品。一团乱麻的代码，不甚合理的设计，冗余过度实用不足的功能集，让维护与进一步开发变得没有乐趣可言。回头想想，这几个月通过开发与维护 RAW 也学到了不少东西，认识了不少朋友。当它无法为我带来更多的乐趣时，我意识到 RAW 在我这里的使命已经完成，是时候前进了。博客交流群已建立，目前处于无人打理的自由水状态，欢迎进群讨论：777536599。Telegram 群组：进群\n\n🐒 猴子打字机原理的产物\nVOID 是我从头开发的全新作品。开发过程中借鉴了 Ghost 默认主题 Casper 与水八口开发的 Bitcron 主题 Card。VOID 中图片的展示占了很大的比重，首页上文字量很少，一眼看过去是十来张图片。另外，你或许会有这样的感觉：VOID 这个主题方方正正的，显得很端庄的样子。确实是这样的，主题中圆角很少，不规则的图形也很少。这其实是我自己动的一点小心思。既然是挂上了 MIT 许可的开源项目，自然就没有立场干涉别人怎么用。但多少是自己的作品，心底里对别人如何使用它还是有所期待的。DIYgod 在关于开源项目赞助这件事里提到 DPlayer：\n...再加上用户大多是盗版站和小黄站，这曾一度让我产生了弃坑的想法。\n若要我说出最诚实的想法：我希望使用这些主题的博主，能认真地多写几篇正经文章，这才是独立博客的精髓。一两句话的牢骚，大可以去微博与 Twitter 上说；花花绿绿的代刷广告与盗版采集还是免了吧。「媒介即讯息」。虽然这句话放在这里不甚恰当，我实际要表达的意思是主题的形式能在一定程度上影响作者的产出。VOID 的排版很规整，可以用来修改的空间并不大，甚至连个广告都很难找到合适的地方放。再加上图片占了很大比重，若是不认真对待，恐怕用这个主题的结果就很难看了。这是自损八百的做法：我丢失了一部分潜在的使用者。但并非不值得。去除了繁杂的功能、版式，最终还是回归到文本上来。如何使网页可用性更高是一个很大的话题，涉及到排版、无障碍等等方面。VOID 的文字样式使用 Lepture 的项目 yue.css，经过我的反复考虑，这个 CSS 集应用到内容块上效果很好。有一个小的改动：原项目的字体默认大小是 18px，综合考虑下 VOID 使用了 17px。相比起 RAW，以及其他许多主题，应该能感觉到 VOID 的文字可读性要高得多。无障碍这一块 VOID 现在做得不好。主要是因为我主业并非前端，全凭兴趣，某些基础修养尚有欠缺。这将在后续的维护中逐步提升。我不准备在这篇文章中详叙 VOID 的使用方法与功能，罗列功能是一件很无聊的事情。这部分内容请参阅主题的 GitHub 主页：AlanDecode/Typecho-Theme-VOID，功能更新与 bug 修复记录请查看 GitHub 上的提交记录。\n其实基本的思考是：独立博客到底应该是什么样的。这个问题我无法回答，恐怕叱咤独立博客界 17 年之久的 Daring Fireball 作者 John Gruber 也给不出让所有人信服的回答。这个问题大概本来就没有答案。互联网发展到现在，带宽、内容丰富程度都与 20 年前不可同日而语。独立博客这样需要坐下来花上个把小时写文章的介质实在很难与 GIF、视频、emoji 抗衡。作为一个写主题的人，能做的只有为博主带来无障碍的写作环境、为读者带来无障碍的阅读环境。不要去打击博主可能的创作欲，也不要给想获取信息的读者平添难度。你觉得这简单吗？这一点也不简单。",
      "categories": [
        {
          "name": "Default",
          "slug": "Default",
          "permalink": "https://blog.imalan.cn/category/Default/"
        }
      ],
      "tags": [

      ]
    },
    {
      "title": "2018：宅、然后继续温柔地反抗吧",
      "date": "2018-12-24T00:23:00+08.00",
      "path": "https://blog.imalan.cn/archives/225/",
      "text": "有时候觉得写总结文章很可怕，往往回头一看，又是碌碌无为的一年。但是，2018 于我而言恐怕确实有总结的必要，因为在平淡的四年后，生活总算有了变化。年初，寒假尚未结束就匆匆返校，为毕业设计做准备。进入大四下，按理说已经没有课了，全力应付毕设就好，但我因为保研的原因可提前选修研究生的课程。我便挑选了几门看上去只需花时间即可的课程，为大四下多加了一些课业负担。那是最黄金的时间。一切都是自由的。我可以选择看论文，敲代码，或者读书看番，基本上全由自己掌握。同时我也有机会去发展自己的爱好，做一些有趣的尝试。虽说学院对毕设看得很重，要求也相当严格，但一切都很顺利。\n暑假是我的一个遗憾，因为没能出去走走。而这也许是我能自在逍遥的最后一个暑假。「世界」一词，「世」是时间，「界」是空间。我们称其为「宅」的人，多是说他在空间上爱出没于一处：他最舒适的一处。我是希望体验整个世界的，因此我不喜「宅」所蕴含的空间属性。但我喜欢「宅」所蕴含的精神属性，后文再谈。此后迎来的是「奋进的暑假」，在往日的文章中有所提及。另外，同任何一次减肥的决定一样，在年末的现在，失败了（笑）。若有另一个我在看着我，他应该不会喜欢我，因为我不喜欢无法贯彻自己理念的人。正因如此，减肥的尝试仍然会继续。\n这个暑假的重要之处不是这次失败的减肥尝试。正是在这个暑假里，我重新开始阅读了。我原来是很喜欢阅读的，但入高中以后，就难以静心读书了；进入大学，更加自由，分心的东西更多，读书越发不可能。这个暑假里，吃住在作坊，有师长在一旁，不敢大张旗鼓地看剧，索性买书来读。阅读能够带来什么呢？其实我读过的许多书，内容都记不不清楚了。我不敢说我从阅读中得到了多少知识上的裨益。阅读主要带给我的是专注的能力。现代人都很擅长 multi-tasking，这是不得已而为之的。久而久之，就真的丧失了专注地做一件事的能力。然而我认为这是不好的，大脑在不同的 context 之间切换需要消耗能量。注意力是消耗品，必须将它花在合理的地方。我（重新）开始认真地读书，认真地看电影，认真地听音乐，认真地体会「世界」。因此变得越发细腻。许多事物原来只有模糊的轮廓，如今在我的脑海中清晰起来。我还小时，父亲让我在街上观察形形色色的人，看他们的穿着，举止，言行，让我从中推断别的事情，当时我觉得很难。现在想起来，无非是专注的能力不够。不够专注，注意力就容易涣散，便抓不住事物的精髓。话说到这里，那么足够专注之后的自己，变成什么了呢？「宅」。我觉得应该将「废柴」这一物种从宅人中剔除出去，因为我认同的「宅」不但不废，恐怕比任何人都有能量得多。若一个人对某事物达到了癫狂的地步，英文称之为 maniac，中文即可称之为「宅」。这是「宅」的精神内涵。Marco Arment 宅吗？坂本龙一宅吗？他们宅得不能再宅了。程序员尤其需要「宅」，这便是我在 2018 后半年的行动纲领。闭门造车，出门合辙。开学以来一直在忙活实验室的一个项目，是单纯的编码工作。同时在业余也写一些练手的东西，包括 RAW 这个主题（以及许多已经放弃的主题）。对（非工业化的）编程来说，其实程序员就是神的角色。为这个世界奠基，为这个世界制定规则，为这个世界添砖加瓦。因此需要高度的专注，总揽全局。这种感觉也是让我上瘾的地方。做博客就是一个实例；为自己的博客编写主题，甚至重写后端，是进阶。\n若要我为 2018 选一个汉字，我会选「变」字。无论是用在我自己身上，还是用在这个世界上，都可以。从三月的修宪，到层出不穷的社会事件，以及至年末时接二连三的名人去世，都在提醒我，这个世界是变化的，而且变得比我想象的要快。异变中，有许多我认为不合理的事情。不合理的事情出现得越来越频繁了，我不怕它们出现，我怕的是人们对坏事习以为常。前段时间，博友在博客抱怨外卖不净，我在下面评论：\n有许多人喜欢自嘲说在中国毒空气毒操场毒奶粉都习惯了，中国人已经百毒不侵。\n我不太喜欢这类抖机灵，相似的还有提起Google、Twitter就说“不存在的网站”一样。\n我总觉得这些明显不合理的事情出现了，我们不应该去适应它们，而应该反抗它们。\n这其实也是我在 2018 年的一个变化：外面变得温和，但恐怕内里变得更尖锐了。相比起前几年，我已经习惯不在朋友圈做太多的时事评论，转而在行为上抗拒我不认同的一切。我似乎有点一条道儿走到黑了。\n我很开心，度过了非凡的一年。但遗憾的是，读的书还不够多，看的电影还不够多，听的音乐还不够多，写的代码还不够多。这一年我真实地感觉到了时间不够用。一天 24 小时，根本不够完成自己想要做的事，这才明白找准方向的重要性。随着时间流逝，试错的机会越来越少，必须抓紧时间了。继续专注，继续不妥协，继续用心感受世界，继续那些不切实际的幻想：这是进入 2019 之际我对自己的嘱咐。「宅」，然后继续温柔地反抗吧。\n2019-03-10 修订：「抵抗」改为「反抗」。",
      "categories": [
        {
          "name": "Default",
          "slug": "Default",
          "permalink": "https://blog.imalan.cn/category/Default/"
        }
      ],
      "tags": [

      ]
    },
    {
      "title": "使用 Travis CI 自动生成与部署 Hexo 博客",
      "date": "2018-11-20T17:08:00+08.00",
      "path": "https://blog.imalan.cn/archives/213/",
      "text": "我相信有许多同学选择使用 Hexo + GitHub Pages 作为自己的博客解决方案，例如我的 Wiki 站点即是如此。但是 Hexo 每次写完文章后都要执行一次生成与部署，当文章比较多时这个过程可能变得很慢。本文介绍了使用 Travis CI 作为自动化手段实现构建、部署 Hexo 博客的过程。这种方法无需手动执行 hexo g 与 hexo d ，只需在每次编写文章后将更改 push 至远程仓库即可，顺带实现了博客源码备份。使用该方法在第一次配置完成后即使是无 NodeJS 与 Hexo 环境时也可以编写并发布文章，因为构建与部署本身是由 Travis CI 完成的。Travis CI\nCI 是 Continuous Integration 的缩写，即「持续集成」，本意是帮助开发者在开发过程中随时对小规模的的代码更改进行生成、测试、部署。Travis CI 提供基于 GitHub 的 CI 服务，它可以从 GitHub 上随时同步代码，并对其进行生成与部署。或许有同学接触过 GitHub 的 Webhooks 功能，即当代码仓库发生某些操作时，GitHub 会向指定的地址发送请求，当服务端收到这些请求时即可进行下一步操作，例如拉取最新代码-生成-部署。Travis CI 所做的事情与之是类似的。思路\n基本的思路如图（诚意手绘）：原理流程例如我的代码仓库 alandecode.github.io ，其 master 分支用于存储 Hexo 生成的静态文件，即博客网页；source 分支则用于存储博客源码，一般包括了 _config.yml、source、themes、package.json 、scaffolds 等文件与目录。整个工作循环是这样的：在 source 分支下编写新的文章并保存，commit 后 push 至 GitHub 上的 source 分支。Travis CI 探测到 push 操作，即从 source 分支拉取新的源代码，并在自己的服务器上执行生成过程，并将生成结果 push 至代码仓库的 master 分支，完成部署过程。实现\n\n假设你已经对 Hexo 的部署与发布有一定的了解，博客已经部署在 xxxx.github.io 这个仓库的 master 分支上。\nGitHub 侧\n仓库设置\n首先将博客仓库 clone 至本地：git clone git@github.com:xxxx/xxxx.github.io.git\n\n然后进入代码仓库，创建并切换至新的分支 source：cd xxxx.github.io\ngit checkout -b source\n\n删除 xxxx.github.io 目录下的所有代码文件（注意不要删除 .git 目录），然后将你的 Hexo 博客源代码尽数拷贝至 xxxx.github.io 目录下。确保除 xxxx.github.io 根目录下存在 .git 文件夹外，其余位置均不存在，例如你的第三方主题可能是直接 clone 下来的，里面会有 .git 文件夹，删掉它。某些临时文件是不必要推送到远端的，为了加快 push 速度，在 xxxx.github.io 下新建 .gitignore 文件，内容为：.DS_Store\nThumbs.db\ndb.json\n*.log\nnode_modules/\npublic/\n.deploy*/\n\n检查一下此时 xxxx.github.io 目录下应该包括了 package.json 文件，里面记录了所有的依赖包。此时执行一次 commit 与 push：git add .\ngit commit -m &#39;init source&#39;\ngit push --set-upstream origin source\n\n此时 source 分支应该已经推送至 GitHub 了。由于以后我们只会修改 source 分支，为了方便将 source 分支设置为默认分支：GitHub 仓库 Settings → Branches → Default Branch 设置为 source。获取 Access Token\n点击 GitHub 右上角头像 → Settings → Developer settings → Personal access tokens，点击 Generate new token，设置 token 名称，并勾选 repo 前面的框。access-token.png点击 Generate，然后将新生成的 token 记下。保管好它，你以后不会再看到这个 token 第二次了。Travis CI 侧\n去 Travis CI 官网，使用 GitHub 账号登录，然后添加仓库：待仓库列表同步完成后将 xxxx.github.io 勾选。add-repo.png然后点击旁边的 Settings 按钮，如图设置：travis-settings.png下方 Environment Variables 填写 name 为 travis，然后 Value 为 GitHub 获得的 Access Token，取消勾选 Display value in build log，点击 add。添加 travis 配置文件\n回到 xxxx.github.io 目录下，创建一个 .travis.yml 的文件，内容为：\nlanguage: node_js\nnode_js: stable\ninstall:\n  - npm install\nscript:\n  - hexo g\nafter_script:\n  - cd ./public\n  - git init\n  - git config user.name &quot;【GitHub 用户名】&quot;\n  - git config user.email &quot;【GitHub 邮箱】&quot;\n  - git add .\n  - git commit -m &quot;Update docs&quot;\n  - git push --force --quiet &quot;https://${travis}@${GH_REF}&quot; master:master\nbranches:\n  only:\n    - source\nenv:\n  global:\n    - GH_REF: 【github.com/AlanDecode/alandecode.github.io.git】\n\n对应修改其中用【】括起来的部分。再执行一次 commit 与 push：git add .\ngit commit -m &#39;update&#39;\ngit push\n\n稍等片刻，在 Travis CI 的控制面板将可以看到构建历史：build-history.png若状态为 passed 则说明部署成功。总结\n如此下来，Hexo 生成、部署繁琐的问题也没有了。不过即使它万般好，评论系统仍然令人头疼。以上。",
      "categories": [
        {
          "name": "Default",
          "slug": "Default",
          "permalink": "https://blog.imalan.cn/category/Default/"
        }
      ],
      "tags": [

      ]
    },
    {
      "title": "音乐 - 游戏的点睛之笔",
      "date": "2018-11-16T00:14:00+08.00",
      "path": "https://blog.imalan.cn/archives/197/",
      "text": "\n熊猫注：这篇文章是我的好朋友 Ben 的作品，上次我写了一篇聊日漫配乐的文章，没想到激发了他的创作欲，当即表示要写一篇游戏配乐的文章。没想到一个月了，我都以为他要鸽了，结果他今天给了我一个惊喜，稿子来了！我赶紧给排好版发出来，来跟我一起拜读之~\n一个月前看了熊猫的博客，文中列举了他心目中能拨动心弦的动漫配乐。自己也是越看越来劲，仿佛把童年以来的美好回忆再品味了一遍，文章读罢自己也饶有兴致，想着也来列举一些游戏相关的配乐，当即夸下海口，想让熊猫帮忙推推，殊不知懒癌一犯就是一月，再不完成恐会被其狠狠调侃，故特此呈上。说到游戏中的配乐，不管是有没有玩过游戏的人都会听过几段，《超级马里奥》、《CS》、《坦克大战》等等，这些重复了一遍又一遍的配乐已经深深的印入了人们的脑海里。但是今天所要讨论的，不一定就是那些让人耳熟能详的游戏配乐，相反甚至大多数人都未曾听过，但无论怎样，接下来所推荐的配乐，都是我十几年游戏经历里，让游戏体验性直接升华的点睛之笔。\n以下列举无排名先后，仅按照小编游玩顺序。\n《最终幻想7：核心危机》 OST By 石元丈晴\n最终幻想7.jpgSE 大厂的看家 IP，游戏本身名气不用说，其中又以《最终幻想7》为最受欢迎的系列作品（不接受辩驳），但是此系列在国内的受众还是相对较低，属于听说过没玩过的那一类游戏。而《核心危机》作为 7 代的外传反而在中国大陆上有相当高的普及度（受益于 PSP 的引进和破解）。《核心危机》拥有着比 7 代本体好 N 倍的画面，同时还保留了本体所有的优点：剧情，人设，游戏性，当然还有最重要的配乐。本作的 OST 我是每一首都推荐的，但是如果读者没有玩过此款游戏的话，从头到尾听下来会显得很枯燥，不知道这帮搞交响乐的人想表达什么意思，因此我从里摘出几首理解起来较为轻松的配乐。作为通关此游戏三次的玩家，我在此强烈推荐有条件的玩家一定要入手一个 PSP，自己亲手去体验一把这款游戏，剧情和配乐的结合所产生的 “1+1＞2” 的效果可不是盖的，另外，感性之人游玩的话请备好纸巾（纸巾是用在上面那个头的！），我反正是玩一次哭一次完全抵抗不住滴。最终幻想7_1.jpg《刺客信条2》 OST By Jesper Kyd\nAC 系列尽管如今依然坚挺，但是最让人回味无穷的我还是投第 2 代，不是说 2 代三部曲，就是单纯的指第二代，Ezio 从纨绔子弟到刺客大师的一代。此作所取得的成就在游戏界人尽皆知，跌宕的剧情，令人迷醉的意大利景观，当地当时民风的完美还原，再配上 Jesper 精湛的作曲手艺，共同造就了这款荡气回肠的《刺客信条 2》。刺客信条2.jpg不同于《核心危机》，《刺客信条 2》的 OST 带给人的是空灵的感觉，在游戏中，你会随着 Ezio 一起成长，复仇并带着自己的族人们复兴，期间激情的战斗配乐不用赘述，但是当游戏剧情推动到一定地步的时候（具体什么地步实在不忍心剧透），当那首《Ezio’s Family》响起的时候，当美声和小提琴结合的时候，你定会沉醉于文艺复兴时期的意大利。OST 中的歌曲推荐（网易云音乐没有版权……）：\n《Ezio’s Family》\n《Earth》\n《Venice Rooftops》\n\n《使命召唤6》OST By Hans Zimmer ＆ Lorne Balfe\n使命召唤6.jpg光看这名作曲人，我想此 OST 的质量已无需多言。《使命召唤 6》系列是其现代战争三部曲中的第二代，也是我心目中 15 部使命召唤系列中的最强神作，在《使命召唤》主打剧情的那个年代，6 代无疑是最成功的集大成者，游戏本身的精彩程度可参考电影界的《黑鹰坠落》，甚至比《黑鹰》更扣人心弦：火爆的枪战，有血有肉的人物塑造，完美的剧情节奏，战争阴谋论，反战主义，以及那无与伦比，惊为天人的背景配乐。是的，这两个形容词只能稍稍形容一下这作的 OST 在我心中的地位，如果你挨个听过后你就会发现：哦~原来以前某某电视节目用过。那么，OST 中我推荐哪些配乐呢？答案是全部，没错就是全部，所有的歌都值得听一遍（我就是这么舔使命 6！！！）但是为了杜绝被吐槽懒的可能，还是放上几首尤其优秀的配乐：《最后生还者》OST By Gustavo Santaolalla\n最后生还者.jpg这位作曲人同样是世界级的，但是没有 Zimmer 那么出名，不过他作为《断背山》和《巴别塔》的编曲人，已经足够奠定他世界一流作曲人的地位了。G 叔的作曲向来有着很明显的南美风情，但是在表达感情时又意外的有着东方人的含蓄内敛，这正是造成他曲风暗含忧伤的直接原因。而这样的曲风极其适合《最后生还者》这样的末日游戏。作为一款只要是个正规媒体就评满分，只要是个颁奖典礼都会给其颁奖的游戏，其本身的素质已经无须赘述，而倘若你仔细研读每个媒体给出的满分评价，你会发现总会有单独的一段盛赞这款游戏的配乐。如果大家没有 PS3 或 PS4 却又向往这样一款神作的话，可以去B站观看纯黑做的系列视频（完全当美剧看），免费体验一下这款神作。说到 OST 中推荐的音乐：《巫师3》 By Marcin Przybyłowicz ＆ Emma Hiddleston\n巫师3.jpg作为 2016 年的“Game of the Year”，当年《巫师 3》的上市可谓是技惊四座，强如《辐射 4》也只能沦为配角。我也是早早的就预购的这款游戏，但当时仅是被其强大的画质和剧情所吸引，却没想到游玩之后最让我流连忘返的，除了“众多”女主角的身材以外，就是能展现壮阔猎魔人世界的配乐了。《巫师 3》的系列配乐有很多，不仅仅是 OST 的那部分，波兰蠢驴(liang xin chang jia)还砸一大笔钱在营销上，尤其是各种原生配乐的创作上，这些配乐在结合游戏本身的场景设计和剧情推进的时候，或让人起鸡皮疙瘩，或让人潸然泪下，或耐人寻味。所以还是那句话，请登录 STEAM 喜加一，小花几十块钱购买一下这款最便宜的 3A 大作，充分体验一下这场视听盛宴（请注意不要在游戏中沉迷打牌）。在综合比对了 OST 部分和原生配乐后，我筛选出以下几首供大伙欣赏：巫师 3 的史诗级音乐实在太多，无法一一列出，感兴趣的朋友可以去网易云音乐下载它的 OST 音乐包。巫师3_1.jpg《返校 detention》 By 張衞帆\n不可多得的国产佳作。由于自己对武侠类游戏实在提不起兴趣，所以玩过的经典国产游戏并不多，而玩过的国产游戏中能让我觉得品质优秀的就更寥寥无几。但是今年体验的这款《返校》可是着着实实的惊艳到我了。故事背景是台湾的白色恐怖时期，可以类比于加长版的“那十年”，剧情大致可概括为政治高压与家庭暴力造成的悲剧。游戏表现手法多为象征，需要玩家认真思考理解；且融合了很多中国的鬼神元素（能给亚洲人带来熟悉的恐怖），剧情叙述方式为错叙，游玩过程中会让人摸不着头脑，但是最后随着剧情碎片逐渐拼起来，整体故事也就一目了然。游戏的定位是恐怖游戏，所以过程中的配乐以压抑，怪诞的氛围为主，但是当游戏快结束时，主角的记忆和真实情感被逐渐找回时，配乐和主角一样在一瞬间释怀了。相信最后真相大白，BGM 响起时，每个玩家都会呆滞在屏幕前。音乐推荐：游戏配乐与游戏本身是相辅相成，互相升华的关系，谁也离不开谁。如果读者在听了上面提到的某些歌曲完全无感甚至觉得不知所云的话，也是正常的，毕竟缺失了游戏本体这一环，就像没看过《未闻花名》就觉得《Secret Base》一般般一样。所以我也是建议各位读者有时间有条件一定要体验一下上述的几款游戏，毕竟音乐只是游戏的画龙点睛之笔，离了游戏，光看一点艳丽的颜色在白纸上也是索然无味的。",
      "categories": [
        {
          "name": "Default",
          "slug": "Default",
          "permalink": "https://blog.imalan.cn/category/Default/"
        }
      ],
      "tags": [

      ]
    },
    {
      "title": "Typecho-Plugin-DoubanBoard 发布",
      "date": "2018-10-14T01:23:00+08.00",
      "path": "https://blog.imalan.cn/archives/168/",
      "text": "之前我写过一篇文章，介绍如何把豆瓣读书和豆瓣电影的个人收藏数据拉取过来在博客上展示：把豆瓣读书和电影收藏数据扒过来展示。但是写代码的方式对大多数人来说还是不太友好，而且相当于需要自己搭建 API 服务，于是现在我把代码整合一下，并加上了单独插入某一书籍、电影的功能，制作成了这个插件：DoubanBoard。介绍\n豆瓣书单与豆瓣影单的抓取方法有所不同。书单有接口可以获取，影单没有，只能通过访问豆瓣的网页来解析。具体实现就不多说了。示例页面见：电影 - 熊猫小A的博客 | 读书 - 熊猫小A的博客除此之外，也有单独展示某一部电影或书籍的功能，喜欢写影评和书评的博主可能会喜欢这个功能。理论上，也支持剧集，只要按照单部电影的方式添加就好。食用方式\n去 GitHub 上下载或者 Clone 这个 repo：Typecho-Plugin-DoubanBoard，将解压后的文件夹改名为 DoubanBoard，上传至站点插件目录启用，并在插件设置面板进行必要的设置。设置项有：\n豆瓣 ID：你的豆瓣 ID，一般可以从你的个人主页的 URL 里找到。\n每次加载的数量：从速度和节省流量的考虑，书单和影单不会一次全部加载。你可以填写每次加载的数量。不填默认为 10。\n缓存过期时间：插件对数据做了本地缓存以提高访问速度，你可以在这里填写缓存过期时间，单位为秒。两次访问时间间隔超过该时间则会重新拉取数据，不填默认 24 小时。注意，不建议设置得过短，否则豆瓣可能判定你的 IP 存在异常流量。\n是否加载 JQuery：如果你的主题没有引入则勾选它来引入，否则取消勾选。\n\n注意：要保证 插件目录/cache 这个文件夹可写！插入书单与影单\n想读清单：\n&lt;div data-status=&quot;wish&quot; class=&quot;douban-book-list doubanboard-list&quot;&gt;&lt;/div&gt;\n\n已读清单：\n&lt;div data-status=&quot;read&quot; class=&quot;douban-book-list doubanboard-list&quot;&gt;&lt;/div&gt;\n\n在读清单：\n&lt;div data-status=&quot;reading&quot; class=&quot;douban-book-list doubanboard-list&quot;&gt;&lt;/div&gt;\n\n电影想看清单：\n&lt;div data-status=&quot;wish&quot; class=&quot;douban-movie-list doubanboard-list&quot;&gt;&lt;/div&gt;\n\n电影已看清单：\n&lt;div data-status=&quot;watched&quot; class=&quot;douban-movie-list doubanboard-list&quot;&gt;&lt;/div&gt;\n\n电影在看清单：\n&lt;div data-status=&quot;watching&quot; class=&quot;douban-movie-list doubanboard-list&quot;&gt;&lt;/div&gt;\n\n注意，在某些 Typecho 版本中你可能需要使用 !!! 来包裹住 HTML 代码。插入单部电影、书籍\n插入单部电影：\n&lt;div class=&quot;douban-single&quot; data-type=&quot;movie&quot; data-id=&quot;电影 ID&quot; data-rating=&quot;你的评分&quot;&gt;&lt;/div&gt;\n\n其中电影 ID可以在豆瓣电影页面的 URL 中找到。你的评分修改为你自己的评分，10 分制，可带小数。插入单部书籍\n&lt;div class=&quot;douban-single&quot; data-type=&quot;book&quot; data-id=&quot;书籍 ID&quot; data-rating=&quot;你的评分&quot;&gt;&lt;/div&gt;\n\n其中书籍 ID可以在豆瓣书籍页面的 URL 中找到。你的评分修改为你自己的评分，10 分制，可带小数。注意，在某些 Typecho 版本中你可能需要使用 !!! 来包裹住 HTML 代码。Enjoy.",
      "categories": [
        {
          "name": "Default",
          "slug": "Default",
          "permalink": "https://blog.imalan.cn/category/Default/"
        }
      ],
      "tags": [

      ]
    },
    {
      "title": "漫谈日本动漫配乐",
      "date": "2018-10-01T15:27:00+08.00",
      "path": "https://blog.imalan.cn/archives/165/",
      "text": "去书店时偶然在书架上看到第 52 期知日杂志，标题是《BGM 之魂》（以下简称《知日》）。封面是一张大大的坂本龙一照片，下面几行字写着泽野弘之、菅野洋子等，当时觉得十分对味，于是赶紧买下来。差不多从大一开始就对影视剧中的配乐部分越来越看重，有时甚至会为了配乐去看电影。从直观上来说，配乐确有高下之分，但是为何好为何坏却难以总结出一个普适的道理。有的配乐好在让人根本察觉不到配乐的存在，乐音本身几乎与画面融为一体，观众每时每刻都在被乐音调动情绪而浑然不知，我认为《权利的游戏》系列配乐就属于此类；有的配乐虽十分跳脱，却不至于喧宾夺主，例如《新世纪福音战士》的配乐就是如此。有的配乐与画面情节高度契合，情节炸裂配乐也炸裂，情节抒情配乐也抒情，例如诺兰新作《敦刻尔克》；有的刚好反其道而行之，形成一种奇妙的对比，令我印象最为深刻的是《EVA：破》与《权利的游戏》中的某些片段。因此很难说哪一类配乐好哪一类就是不好，大概由于这是一门精细的艺术，再加上观众的心境各不相同，还是需要音乐家仔细雕琢。《知日》在开始处采访了一些音乐人，一个问题是“你觉得配乐与一部作品是怎样的关系”，跑火车电台创始人 Catson 答道：\n如果硬要讲，我觉得配乐承担了“嗅觉”的部分。人声对话是听觉，画面是视觉。“我闻到了一股危险的味道。”我觉得配乐就是这样无形地触发观看者的。\n虽然从这段话看起来 Catson 更推崇“润物细无声”类型的配乐，不过也不尽然。即使是最跳脱的配乐也很难比画面和台词更引人注意，因此把配乐说成“嗅觉”确实很贴切。“闻到一股危险的味道”这个说法本身也非常有趣，危险哪有味道呢？显然是闻不到的。但人就是这么微妙，环境与心境极细小的差异就能让我们足够警觉，所谓“第六感”就是如此吧。《知日》主要在讲日本的配乐与音乐家。日本的配乐非常多元，各种风格、混合风格都有，而且总是很新颖，出现了好多名曲。Caston 回答“日本配乐有什么特点”时说：\n说到底，日本配乐更加“不配乐”一些。\n\n而在日本的作品中，特别是在动画中，配乐更像是主要组成元素之一，常常非常突出，也常常被重复地使用，但这又恰恰形成了日本的配乐风格。\n其实不光是日本，欧美也有这个趋势，但好多却有其表无其里。这让我想起某次与朋友聊天时，我说以《银河护卫队》为首的一批欧美电影在配乐上落了下乘。这些电影的配乐也极为突出，甚至播出后能直接带火某些冷门歌曲，但是作为配乐却是失败的，更有一种“剧情不够音乐来凑”的感觉。花大价钱买来版权，不分青红皂白就往上怼，这是偷懒的做法。日本动漫配乐给了我们很多极有参考意义的示例。借此我顺便聊聊给我印象极为深刻的一些配乐吧。（聊到的某些曲子可能是 OP 或者 ED，严格说不算配乐，不过我也不想落下，就混在一起讲了。）注意：有时候一些曲子能在我心里排上很高的名次是因为它刚好契合我听它时的心境，也许错过一点就没有那个感觉。所以也许我奉为圭臬的曲子在别人心里非常普通，这是完全有可能的，因此这篇文章仅代表我个人的好恶。宫崎骏 × 久石让聊日本配乐，我认为大多数人都不会错过《天空之城》这部动画电影中的那个熟悉的旋律，只是许多人都直接称其为《天空之城》，其实真正的曲名是《君をのせて（伴随着你）》。这首曲子由宫崎骏作词，久石让作曲，霸占了礼品店里所有的八音盒。\n地球(ちきゅう)は回(まわ)る 君(きみ)をのせて世界不停转动 你隐藏在其中いつかきっと出逢(であ)う僕(ぼく)らをのせて伴着我们，直到我们重逢的那天\n去年有一个乐团在北京演奏久石让的配乐，我没有任何犹豫即买票去听，开场就是这首曲子。演奏本身不能说多好，但听得我几乎落泪。自第一次看《天空之城》已经好多年，听到这首曲子依然有难以言明的感动，这说明某些东西确实有永恒的价值。还有一首总被人叫错名字的曲子，名叫《散步》，许多人都会错叫成《龙猫》，因为这是电影《我的邻居龙猫》中的插曲。《龙猫》这部电影我相对看得比较晚，但是却让这部作品在我心里更崇高了一些。世界上真的有龙猫，真的有精灵，只是由于我们已经变成大人了所以再也看不见了。片尾响起《散步》这首欢快又纯真的歌谣时我根本无法抑制内心的感动，多想永远保持那一份童真。让我对久石让的印象大为不同的是《幽灵公主》，一部在我心里可排在第一位的电影，它的配乐也是极为精妙。《阿西达卡战记》是交响乐的编制，听起来辽阔而纯净；《达达拉女工的主题歌》那清亮的歌声，其中蕴含的正是这部电影的主题：坚韧而不屈的生命力。在情绪低落的时候我就会听这些曲子，非常神奇，明明只是音乐而已，却能真真正正给我带来力量。还有《千と千寻の神隠し》、《空から降ってきた少女》、《Summer》等等说不完的名曲。真的要感谢久石让，给我留下了这么多永恒的回忆。鹭巢诗郎、川井憲次、平泽进《EVA》的配乐是公认的大胆。除开《DECISIVE BATTLE》这样标志性的配乐，也有《Komm, süsser Tod》、《Fly Me  to the Moon》这样新颖的组合。《EVA》的配乐给我印象最深的地方在于它特别喜欢使用与画面形成绝妙对比的音乐。例如正在发生人类大灭绝时却使用极纯净而美好的童声，战斗正酣却使用教堂音乐。鹭巢诗郎确实非常精于此道。对了，新剧场版中有一个片段是第三新东京市的早晨，那一段配乐《2EM09_YAMASHITA》现在已经是我每天通勤路上的固定音乐了（很可惜现在网易云音乐上已经找不到了）。《攻壳机动队》中有一组绝妙的配乐，名叫《傀儡谣》，由三首组成：《謡 I - Making of Cyborg》，《謡 II - Ghost City》、《謡 III - Reincarnation》，出自川井憲次之手，唱法非常特别。当时押井守要求川井憲次一定要把太鼓加入其中，川井憲次于是从祭祀音乐中受到启发，以人声为主旋律，辅以太鼓、神乐铃，写成了《傀儡谣》系列。关于《谣》中特别的唱法，据网上说来自中国先秦时期的「鬼音」，在唐代盛行后流入日本，现在我国已失传了，也是相当有趣的八卦。不过很多人对川井憲次的印象并不来自《攻壳机动队》，因为川井憲次也为另一部作品配乐：《Fate/stay night》。第一次听到平泽进的配乐是在今敏的作品《千年女优》中，其中的一曲《縱列風》一下就抓住了我的注意，无法想象这是《千年女优》这样的作品会有的配乐，让人印象非常深刻。之所以把这三者放一块儿说，是因为我觉得他们的配乐都是比较跳脱的类型，后二者还有些实验性质在里面。日本配乐的多元化就表现在这里，时常让人感到惊喜。泽野弘之、小林未郁、Aimer这三者大概是最为人所知的为日本动漫配乐的音乐家了，他们本身也很爱合作。前二者合作的《βios》名气自不必说，Aimer 为《Fate》系列演唱的《Brave Shine》有多火爆大家都知道。小林未郁和 Aimer，尤其是 Aimer，声线非常特别，辨识度超级高。这三位似乎都很精于“燃曲”，配上中二气质十足的作品总是非常合适。泽野弘之这个人产出非常稳定，不会出现突然作品崩掉的情况。他的曲子有个特点，曲名都是乱七八糟的，所以有个段子说他的曲名使用脸在键盘上滚出来的，《知日》里面采访泽野时他回答：\n……当他们几年后再把专辑拿出来听的时候，我希望他们不要因为歌曲的名字，而是通过自我的感觉享受歌曲。比如说，我为一首歌曲取了曲名叫“战斗”，这首曲子的感觉就会被限制，让人产生固定的印象。所以我取了这样让人看不懂的名字，让听众自由自在地感受音乐。不过总不能只用数字来命名吧，这也太没意思了。所以我会根据企划书和作品本身的人物等相处一些特殊的歌名。\n原来是这样，哈哈。前面提到《Fate》系列的一些配乐是由川井憲次完成的，也有让人印象很深的乐曲，比如：《騎士王の誇り（骑士王的荣耀）》。《Fate》系列不愧是现象级的，不仅在游戏、动画行业创造了各种各样的记录，音乐也是数一数二。漫谈其他我大部分都在说二次元的配乐，因为确实我接触二次元的部分多一些。出自《龙珠》的经典歌曲《摩诃不思议》可以说是一代人的回忆；和田光司去世时有许多人把《Butter-Fly》找出来听以至于泪目，这是音乐的力量，也是回忆的力量。《头文字D》中的《Rage Your Dream》；出自《火影忍者》的《動天》、《ブルーバード（青鸟）》；大野克夫的经典名曲《「名探偵コナン」~メインテーマ》；《灌篮高手》中的《あなただけ見つめてる》；出自《Fate/Zero》的《満天》……这些承载着我无数回忆的曲子根本说不完。不过大概你也看出来了，上面说的那些曲子大都是 OP 或者 ED，这类歌曲容易被传唱，要说配乐恐怕还是《名侦探柯南》中的那几首经典比较让人印象深刻。我发现现在的作品很容易出热门单曲，但是配乐的质量却有所下降。不过当然也有例外，比如 2018 年 4 月番《MEGALOBOX》的同名配乐就非常不错，与番剧本身的特质高度契合，我认为是配乐中的上乘。《白色相簿2》中也有值得一听的配乐，例如《届かない恋》，这也是很有名的曲子了。除开二次元，其实三次元也有很多优秀的日本音乐人与配乐作品，其中我最推崇的还是坂本龙一。坂本龙一为电影《圣诞快乐，劳伦斯先生》作的同名配乐以及他为电影《末代皇帝》作的配乐《Rain》在我看来都是上乘。话说坂本龙一还为《荒野猎人》配乐，不过我没看过这部电影，就不多说。\n我意识到这么写下去这篇文章就会很长很长了……其实以一两句话来描述一部作品或者一个音乐人的配乐是根本不够的，因此本文只能算是粗略地罗列了我所喜欢的一些作品。配乐是一个很大的话题，如果有机会的话，希望能够多写一些文章认真聊聊那些有趣的配乐与厉害的音乐人。不过目前还是到此为止，接下来我得出门去溜达溜达了。",
      "categories": [
        {
          "name": "Default",
          "slug": "Default",
          "permalink": "https://blog.imalan.cn/category/Default/"
        }
      ],
      "tags": [

      ]
    },
    {
      "title": "北京入秋",
      "date": "2018-09-29T13:04:00+08.00",
      "path": "https://blog.imalan.cn/archives/164/",
      "text": "一进入九月，雷打不动的是过敏。自来京后每年春秋都会过敏，折腾了我好几年。如今竟逆来顺受，提前备好了抗敏药，就等症状袭来。像在等一位老朋友似的。另外则是气温以可感知的速度下降。北京少雨，但今年降水似乎多一些。昨天下午开始带着雷声刮起大风，短暂地下了一场阵雨，至晚上则彻底开始下大雨。不巧的是当时我正与朋友们聚会，定好了饭局结束后去唱歌，结果一行人堵在饭店门口看着大雨一筹莫展。叫车无人接单，最终还是凑在一起打着伞说说笑笑一路走去 KTV，衣服、鞋子、书包都湿得差不多了，但好在一路朋友相伴，不觉得寒冷。一场秋雨一场凉，瞥了一眼手机，今天最低气温仅 8 度。也许是托身上脂肪的福，我从今天才开始在短袖外面套上帽衫。其实我觉得不穿外套也无妨，只是没必要在此事上较劲，况且就观感来说，我个人最喜欢的还是春秋季的衣物。昨天和朋友说，我觉得我的身体是越来越好了：高中时不穿秋裤根本过不下去，但大学四年我有三年都仅靠一条牛仔裤过冬，上衣则是内外两件即可。今年我觉得不能大意，还是要老老实实做好保暖。IMG_0235算起来，这是我在北京度过的第五个秋天。有件事很有意思：以我学生的身份来说，一年四季的象征意义有些反常。由于秋季是新学年的开学季，可算是「开始的季节」；而春季往往象征着一学年即将结束，反而是「收获的季节」；一直来的夏季都是「玩耍的季节」；冬季则可以单独另说。今年夏季仅与老友见面二三次，而往常是整个暑假每天都厮混在一起，果真是人生的某个阶段已经彻底地离我们远去了。北京一入秋总要起风。万里无云，阳光极好，同时伴着大风。海淀区尚且如此，遑论昌平沙河等地。刚开始起风尚且算温和，随着时间进入十月、十一月，凉爽的风逐渐变得凛冽起来，吹得生疼，到那时谁也不愿意在室外呆太久。现在室外正是大风，能听到树叶哗哗地响。\n今天本准备写一写近况，也就是「最近的一点 Update」那样的文章。但写了两三段觉得索然无味，无非是千篇一律的吃饭、睡觉、上课、敲代码，再者就是又在玩什么电子产品，若再这么下去恐怕我对自然的敏感度会逐渐降低，因此就随意写了这一篇不知所云的短文。趁着国庆小长假机会难得，出门去体会一下北京这座老城的秋天，也不失为一个好选择。",
      "categories": [
        {
          "name": "Default",
          "slug": "Default",
          "permalink": "https://blog.imalan.cn/category/Default/"
        }
      ],
      "tags": [

      ]
    },
    {
      "title": "Typecho Theme RAW 发布",
      "date": "2018-09-17T00:38:00+08.00",
      "path": "https://blog.imalan.cn/archives/163/",
      "text": "我目前已经没有使用 RAW，因此这个主题转入维护性更新阶段。也就是说它在未来仍然可能收到 bug 修复这样的更新，但是大概率不会有新的功能了。另外，我会在近期重写这个主题的代码，但同样，只是代码层面上的更改，使用上与当前不会有什么变化。项目地址 | 开始使用 | 常见问题 | 欢迎给我 star 与各种 PR！Theme RAW 交流群已建立，目前处于无人打理的自由水状态，欢迎进群讨论：777536599这个主题叫做 RAW，我花了一个周末写出了这个主题的第一版，考虑到我前端零基础1的事实，效率应该还算可以。不过后期删删改改，增添了许多功能，花的时间就不是一个周末而已了。自 2017 年入坑个人博客至今，我稳定使用过 handsome 和 Mirages 主题；也短暂地使用过 Moricolor；购买过 Yodu 和 Giligili 主题，但都未曾长时间使用；短暂地迁移到 Hexo 时用的是自己修改后的 hexo-theme-cactus 。我想自己写一个主题已经很久了。以上说的主题很受欢迎，完成度高，用起来很舒服，只是不能满足我想要自己折腾的冲动。一者，成品（甚至收费的）主题代码都很工程向，功能繁杂，我想插手改动并不容易；二者，在别人的基础上做些修修补补的工作总觉不够味。因此，何不自己写一个呢？所以有了这个主题。写到一半时我突然担心没办法开源了，因为写完之后左顾右看总觉得和别的主题雷同。直到我又花了几天做出了差异性的地方，才敢斗胆把这个主题放出来。大概因为这毕竟是我的第一个主题，不能让她烂在我手里了。另外，毕竟自己从别处学到了很多东西，还是饮水思源吧。几经周折，最近(2018-11-02)我将这个主题从最初版本完全重写，本想新开一个坑，但由于其实整体的样式没有太多改变，因此还是合进了 RAW。主题升级方式请看：如何升级相关文章\n\nRAW主题修改配色\n\n更新日志\n2019-01-03 Ver 0.94\n调整字体加载顺序，减少首页白屏时间\n最近修改日期超过 100 天添加提示\n设置背景图时可选是否启用半透明背景\n新的主页文章列表样式\n添加主页默认头图设置，支持随机图片API\nbug fix\n\n更多日志信息查看：Theme RAW 开发日志外观\n三栏布局 两栏布局你应该已经看到了，整个博客主要分成中间的与两边的小组件。因此我无法称这个主题是「极简主义」的，虽然精简确实是我的初衷。博客有两种版式，三栏与两栏，也是我观察大多数博主会喜欢的两种样式。首页\n首页的文章列表有两形式：短文章、一般文章。说说是一类比较简短的文章，例如一段引言加上自己的评论，或者一段小感想。这样的内容其实不适合在主页上放大大的标题让人点进去（实际上这样的内容想一个标题都很困难）。因此我会直接展示文章的全部内容，仅留一个评论入口。虽说短文章很像说说，但它不是说说。它最好依旧是可以成文的文章，只是篇幅较短。如果你想要使用说说功能，主题同样有提供，见后文。说说当文章设置了主图时，首页文章列表将显示主图，否则不显示。首页两侧分别是作者面板、站点导航、全站友链、最近评论、热门文章。顶部也是导航，不同的是这里的导航在小屏幕下回显示在底部，因此不建议放太多。顶部右侧有搜索与登录按钮。文章页面\n文章页面的总体目标是易于阅读，为了适应我自己的需求，添加了代码高亮功能，同时还借助 fancyBox 添加了好用的图片点击放大功能。文章页面某些技术性文章可能篇幅较长，为了把握整体结构以及快速跳转查阅，我添加了好用的目录功能，可以在文章编辑页面选择是否启用。比如这篇文章就启用了目录，目录显示在右侧。独立页面\n友链\n添加友情链接的语法是：\n&lt;div class=&quot;board-list link-list&quot;&gt;\n[名称](链接)+(头像)\n[名称](链接)+(头像)\n&lt;/div&gt;\n\n你也许需要用 !!! 来把 div 标签包起来，例如：\n!!!\n&lt;div class=&quot;board-list link-list&quot;&gt;\n[名称](链接)+(头像)\n[名称](链接)+(头像)\n&lt;/div&gt;\n!!!\n\n友情链接页归档页面\n归档页面使用方法：新建独立页面，自定义模板选择 Archives，内容为空即可。同时的，我希望来访的人多用搜索功能。数字世界里搜索是极为高效且自然的动作，胜过在归档列表与分类列表里翻找。搜索按钮在页面右上角，点击即可打开搜索面板。希望你（在各种意义上都）能找到自己想要的。说说页面\n说说页面说说页面与主题高度集成，支持登陆后在前台发布，只需要在后台新建一个自定义模板为 Words 的独立页面即可。你可以在首页使用面包屑导航模块上的按钮即可切换，切换是 AJAX 加载的，体验十分自然。特色功能\n响应式设计\n当然，这个主题是响应式的设计。动手之初我给自己定的目标是尽量少用 JS，能用 CSS 解决就 CSS 解决。最后完成度尚可吧，只是有些我实在不知道怎么实现才用了 JS。这个主题 JS 代码量挺小的（除开第三方的项目）。在小屏幕上，侧边栏和目录列表都会隐去，通过底部按钮控制显隐。主页 文章 说说PJAX 无刷新\n目前站点支持 PJAX 无刷新体验，可选择开启（评论暂时不支持）。文章点赞与浏览统计\n文章点赞与浏览统计可以让浏览的交互性更好，并且博主得到的反馈也更多。最多浏览的文章会显示在右侧边栏里，这可以帮助浏览者发现优质内容。文章点赞与浏览统计的使用方式见：常见问题 - 文章浏览统计与热门文章；好用的表情\n评论与文章中均可使用！我特意在 Typecho 后台编辑器顶部添加了表情按钮，方便插入表情~ ::(笑眼)好用的侧边栏组件\n一个三栏主题的最大优势就是侧边栏的存在。目前这个博客有这几种组件：站点统计面板，站点导航，全站友链，最近评论，热门文章；如果你的文章启用了目录的话也会显示目录列表。自定义 CSS 与 JS\n主题开放了在 head 中与 footer 后输出内容的选项，你可以在这些部位引入 JS 与 CSS，达到自定义站点的目标。代码高亮\n借助 highlight.js 实现了代码高亮，对技术博主来说很有用。夜间模式\n可以根据时间切换，也可以手动切换。该模式对 Meting 做了优化。夜间模式可设置博客版式\n支持设置三栏顺序或者是否显示右侧边栏，给你更多自由~图片灯箱与并列排版\n使用普通的 Markdown 语法插入的图片会加入灯箱效果，点击图片可弹出显示。无需更改太多语法就能实现更多排版~ 在文章编辑器顶部添加了「图集」按钮，然后在插入的 photos 短代码中间使用常用的 Markdown 语法插入图片即可实现排版（注意图片之间不要空行，只换行是 OK 的）。你还可以在标签中添加图集描述。例如：[photos des=&quot;摄于 2018 夏、秋&quot;]\n![](https://static.imalan.cn/file/image/post/658ed.jpeg)\n![](https://static.imalan.cn/file/image/post/950ff.jpeg)\n[/photos]\n\n效果： [photos des=&quot;摄于 2018 夏、秋&quot;]\n![](https://static.imalan.cn/file/image/post/39075.jpeg)\n![](https://static.imalan.cn/file/image/post/f02e4.jpeg)\n![](https://static.imalan.cn/file/image/post/215cd.jpeg)\n[/photos]\n\n效果：  这些图片均可点击放大显示。注意，一个 photos 块中的图片会默认显示在一行，图片尺寸可以不同，显示出来的宽度会自动调整。1B8F0A11-97FE-4988-BBFC-C1A196B65E31.JPG 6B478046-C956-479F-AD92-37F7BACE0D8A.JPG写在后面\n其实还有许多别的细节，但我决定先说到这里了。目前主题许多地方不甚完善，我也是仓促之中将一团乱麻的代码稍作整理就上传到了 GitHub，我会继续完善这部分内容。动手之初，除了期待获得一个属于自己的主题之外，也期待能在 JavaScript、CSS、HTML、PHP 等方面有所进步。我没有采用前端框架（但是使用了 JQuery），CSS 样式均使用标准语法2，因此兼容性方面堪忧（IE 上简直一团糟），不过在我这里兼容性优化的优先级是最低的，我不想太多花时间在这上面，除非是非常巨大的问题。简单的 CSS、节制地使用 JavaScript 代码，一者是因为我就这水平；二者也有些对「简洁」的追求。之所以起名字叫做 「RAW」，也是类似的考虑：表达的欲望是很原始而简单的欲望。每个人都应该找到属于自己的表达方式，当然不一定是博客。Credit\n这个主题的写作过程离不开 Mirages、handsome、Memory 等的帮助，感谢。本项目引用了：JQuery | highlight.js | MathJax | fancyBox | scrollTo | OwO | pjax | font-awesome感谢以上项目。如果本项目对你有所帮助，请考虑捐助我  ↓↓↓\n\n其实后端也是零基础，但我觉得前端部分要繁琐得多…&#8617;\n即大都没有带上类似 -moz- 这样的厂商标识&#8617;\n\n\n",
      "categories": [
        {
          "name": "Default",
          "slug": "Default",
          "permalink": "https://blog.imalan.cn/category/Default/"
        }
      ],
      "tags": [

      ]
    },
    {
      "title": "使用「捷径」给 GIF 加上进度条",
      "date": "2018-09-08T20:46:00+08.00",
      "path": "https://blog.imalan.cn/archives/156/",
      "text": "看到一张 GIF，可把我笑坏了，最后那只汪也太不给面子了吧哈哈哈哈~最后那只汪也太不给面子了吧好的，据说大约有 98% 的人承认被这样的 GIF 套路过，还有 2% 的人被套路了却不承认（我瞎编的数）。机智如你，看到这样的 GIF 还是会傻乎乎地一直盯着看，为什么呢？你可能注意到了：这是因为 GIF 图片是可以无限循环的。GIF 图实则可看做是一个反复轮播的图片序列，序列中的每一幅图称作「一帧」，只要巧妙地设置起始帧与末尾帧就能使整个 GIF 无缝循环到天荒地老。这个特性在制作上面的整人图时有奇效，但在某些应用场景中却不然。许多写文章的同学知道有「一图胜千言」的说法，在文章中引入动态内容（比如视频、GIF）来辅助表达可以达到事半功倍的效果，例如少数派的这篇文章，利用 GIF 把浏览器的新特性展现得清清楚楚。可是当 GIF 过长，或者没有明显的起始、结束标志（就像文首那样）时读者可能会产生一种焦虑感：这个 GIF 什么时候完？我到底是不是已经看完一遍了？视频却没有这个问题，这是因为多数视频播放器是有进度条的。进度条，即使是假的进度条，也能有效地缓解观看者的焦虑感。 例如上面提到的那篇少数派文章，你是否注意到了里面的 GIF 就有进度条呢？有了这个点子就好办了。其实实践的原理也并不复杂：假如某个 GIF 共有 n 帧，那么播放到第 i 帧时，其进度（以小数计）就应该是 i÷n。我们考虑往这一帧上添加一个进度条，设帧宽度为 width，进度条的长度就应该是 width×i÷n，是不是？具体的实现方法有许多，可以使用 Photoshop 等专业软件来做，本文介绍一种简单的方法：利用 iOS 12 中内置的应用「捷径」来实现。动作链接：点击下载，使用方式：点击链接导入这个动作，运行它并从相册选择需要处理的 GIF 即可，最后的结果会保存回手机相册。下面我来讲解一下如何一步步制作并优化这个动作，以供参考。动作解析\n需求\n明确需求是（功利性地）做任何东西之前的必须步骤。这里我们的需求是：制作一个动作，它的输入是从相册选择的一张 GIF，输出则是一张带有进度条的 GIF。制作\n过程原理在前文已经讲明了。最为关键的步骤是：提取出 GIF 的每一帧，在每帧上叠加合适长度的进度条，然后再把处理后的帧拼接成新的 GIF。iOS 12 内置的「捷径」应用是 iOS 平台著名效率应用 Workflow 的继任者，里面提供了许多基本的功能模块，用户可自由组合这些模块来实现相对更复杂的需求。在本例中，捷径提供了四个最为关键的动作：Get Frames From Image 、Resize Image、 Combine Images 与 Make GIF。\nGet Frames From Image 动作的输入是一张 GIF，运行后可以提取出 GIF 的每一帧，得到一个包含了多张图片的列表（list）。\nResize Image 动作的输入是一张图片，它可以将这张图片缩放到设定的尺寸。本例中就用它来制作进度条。你想到应该怎么做了吗？所谓进度条，其实就是一张细长的纯色图片，它可以由任何一张纯色图片制得：只要让它的宽度是进度条长度，高度大约两三个像素即可。\nCombine Images 动作的输入是一个图片列表1，它的作用是拼接列表中的图片，纵向或横向皆可，并输出拼接后的图片。本例中就用它来给每一帧加上进度条。\nMake GIF 的输入是一个图片列表，它可以将这个列表中的图片合成为一个 GIF。\n\n不难画出完整的流程图：分析与改进\n按照以上流程图制作的动作固然可以使用，但是有一个很大的缺点：它要求使用者相册中有一张纯色图片以备使用，这……太不优雅了。再说，如果你分享给你女朋友，她却发现不能直接用还要有什么纯色图，她哪里去找什么纯色图？你怎么这么敷衍？你是不是不爱她了？一种解决思路是：运行前检测使用者设备上有没有这个纯色图片，若有，那就继续运行，若没有，则利用 Get Contents of URL 临时下载，并存储备用。存储的位置若可能的话，最好不要是相册，以免污染别人的照片库。很自然的，iCloud Drive 是一个绝佳选择。因此，流程图的前半部分变成了：好的，这次女朋友不会夺命三问了。但是等等……若是女朋友手机没网或者提供这个纯色图片的服务器挂了呢？虽然确实不是你的问题，但是女朋友仍然有可能迁怒于你，怕怕。我们要把隐患扼杀在摇篮中。究其原因，一切都是因为这个动作需要引用外部的资源：一张纯色图。如果它能直接内置到动作里就好了。能不能办到？当然可以。捷径应用里内置了一个动作：Base64 Encode，有编程经验的同学应该就明白了。简单地说，Base642可以把一个二进制文件转换为一串纯文本，也能从文本中解码出原来的文件。既然动作不能存储图片文件，但存储文本却是可以的呀！因此在最顶部放一个 text 块，里面填写上纯色图的 Base64 编码，运行时再从这里解码得到纯色图片即可。应该说到这里，这个动作完成度算是比较高了。再来看看带进度条的 GIF：不能整人了，不开心￣へ￣。延伸\n动作的制作与优化上面就聊完了。这部分是一些额外的讨论和抛砖引玉的内容。Add to Variable\n在前面的流程图中，我很自然地使用了 Add to Variable 这个动作，来临时保存需要拼接的进度条和某帧。捷径应用中对这个步骤的简介是：\nAppends this action's input to the specified variable, creating the variable if it does not exsist.This allows you to make a variable hold multiple items.\n也就是，将这个步骤的输入追加到某个变量的末尾。值得注意的是，并不与某个变量合并，而是追加。举例来说，如果你把一段文本通过这个步骤 add 到另一个变量（也是一段文本）后，并不会得到一段包含了这二者的文本，而是得到了一个「列表」，里面分别包含了两段文本。听上去很绕。但我们只需要知道，这个步骤的输出一般会是一个列表。Add to Variable 这个步骤的作用可归结于暂存多个变量，以待后续处理。为什么这么说？因为「列表」其实是一种特殊的变量——存储变量的变量。暂存变量\n以前使用过这个应用的玩家可能知道，应用中有一个叫做 List 的步骤，可以在运行过程中保存几个变量以供后续处理。在本例中，两次 Add to Variable 然后拼接为新的一帧这一段完全可以这么改写：那么 Add to Variable 还有什么存在的意义？你是否注意到，虽然 List 这个动作在这里的效果要比 Add to Variable 强，使得动作看起来更简洁，但它有一个特点：容量是固定的3。在制作这个动作时只为它预留了两个位置，一个用来放进度条，一个用来放图片帧，那就不能再运行过程中存储更多的东西了。当需要暂存的内容个数不定时，List 动作就力不从心了，这时就轮到 Add to Variable 上场。不论有两个、五个还是十个一百个变量，Add to Variable 都能老老实实地帮你存好。本文中要处理的 GIF 帧数不一，因此即使经过上图的改写，与进度条拼接后的帧仍然要使用 Add to Variable 暂存最后再合成 GIF4。值得注意的是，列表中的数据类型无需是相同的，你可以把图片、音乐、文本等等内容添加到一个 List 里。暂存多个变量的部分至此结束。以待后续处理\n不论使用 List 还是 Add to Variable，你现在得到一个列表了。你能想到对它进行什么操作？抽象地说，操作可分为对列表中的所有元素处理，或者对其中的某些进行处理。本文中拼接列表中的图片属于前者。看一个属于后者的例子。所谓「对某些进行处理」，无非是用户手动选择某些，或者自动过滤出某些。少数派 Shortcuts Gallery 中有个影评日记的动作就是就是这样的。这个动作比较复杂，我不具体介绍里面的内容，它的流程是这样的：从豆瓣根据某个关键字搜索电影，获得前 5 个搜索结果，提取每个搜索结果的重要信息合成一个 List，供使用者选择，再根据选择的结果从豆瓣请求更为详细的信息然后进行后续处理，有兴趣请下载影评日记这个动作看看。这里有一个坑\n回到上面那个流程图，若是把循环中的第一个 Set Variable 也改成 Add to Variable，会发生什么事情？大家可以试一试。结果就完全不对了，但看起来没有什么逻辑问题啊？就是添加到 temp 变量嘛，虽然循环开始时没有这个变量，但苹果的文档也说了，没有 temp 变量时会自动创建的。这里的问题在于，Shortcuts 中的变量是全局有效的。因此在下一次循环开始时，上一次的循环的 temp 变量仍然是有效的，Add to Variable 是在上一次运行结束时 temp 变量上追加，自然就不对了。原动作中的 Set Vriable 相当于是清空了 temp 变量，然后把它的值设为预定的值，如果这个位置非要使用 Add to Variable 的话也不是不可以，那么就需要在每个循环末尾添加两步：Nothing→Set Variable(temp)，这相当于手动清空了 temp 变量。Combine Images\n前文提到，Combine Images 动作的作用是把一个列表里的图片拼接起来。动作上有三个选项：Mode，拼接方式，可选并列或者网格；Direction，方向，可选水平或者竖直，当 Mode 是网格时该选项无效；Spacing，间隔，即拼接时两张图片之间的距离。本文中，Combine Images 的输入是一个图片 list，但我在脚注里说，不一定非得如此。你可以试试在一个 list 中放一段文本和一张图片，然后把这个 list 传给 Combine Images，看看会出现什么结果？没错，动作会将文本转换为图片然后把它们拼接起来，对习惯了严格声明数据类型的程序员来说这看起来是很奇妙的，虽然最终的效果可能不是很好（尺寸会变得很奇怪）。关于这一点在苹果的 Shortcuts 文档中有详细说明：\nWhen an action expects one type of content and you pass it another type of content, the Content Graph automatically converts that content to the appropriate type.\n也就是「自动类型转换」。「捷径」应用的前身是 Workflow，可见这个开发团队为了使任何人都能顺畅地使用这个 app 在背后做了多少工作。要知道，对数据类型、程序代码都一无所知的用户会制作出无数千奇百怪、奇思妙想的动作，要考虑到所有的意外是极为困难的，还不能简单地报错、抛出异常，因为这样太容易「劝退」了。正是开发团队在背后做的工作使我在使用这个应用时屡屡觉得惊喜，这让我想起了小时候偶得一套螺丝刀，才发现原来我仅靠自己的力量就能拆掉那么多东西（误），那是一种发自内心的喜悦。\n\n其并不一定是图片列表，后文会聊到这个问题&#8617;\n这里的原理涉及到文件的编码问题，更细致的内容参考：https://en.wikipedia.org/wiki/Base64&#8617;\n并不是绝对的，有兴趣的读者可以考虑一下如何使用 List 来存储任何长度的内容&#8617;\n同样也不是绝对的，读者可以思考一下如何改写整个 shortcut，使之不使用任何的 Add to Variable 动作。这是可以做到的，但是代价是可读性、可调试性下降。制作大型的动作时不建议使用这类「奇技淫巧」&#8617;\n\n\n",
      "categories": [
        {
          "name": "Default",
          "slug": "Default",
          "permalink": "https://blog.imalan.cn/category/Default/"
        }
      ],
      "tags": [

      ]
    },
    {
      "title": "秋山澪同款 - 大手办 AKG K701 | 揽件日志",
      "date": "2018-08-24T12:09:00+08.00",
      "path": "https://blog.imalan.cn/archives/144/",
      "text": "事出有因，这个暑假我开始每天跑步，自己建了一个跑步歌单，里面一首《Don't Say &quot;Lazy&quot;》我快听了上百遍才知道原来是《轻音少女》的 ED。平日里写代码全靠耳边的音乐进入状态，之前买过的耳机都出手了，一直靠 iPhone 自带耳机凑合，总觉得差点意思。就想着物色一个新的耳机。找来找去目光锁定在因为《轻音少女》的播出而大火的「大手办」K701 上。据说难推，难推有什么？手办手办，看着都开心。一耳朵听感\n不得不说，难推是真的，耳机带了 3.5mm 转接头，首先试试直推。往笔记本上一插声音是真的小。我是不懂内部原理，反正不是功率不够就是电流不足，听感比较混沌。当然即使推不好也比我的 EarPods 强一个档次，但肯定不算是网上流传的那种评价。听 ACG 的话还可以，其实只要是整体在中间偏高频的曲子都还可以。太高的频率下也会比较虚无缥缈，以及一点点刺。动次打次就比较难受了，因为确实低频比较无力。据 HIFI 大佬们说上个 5K 左右的前端能推好低频，我是不太同意这个说法的。这个耳机本来特性就是这么个特性，非要上各种设备把它弄成另一副耳机的感觉，再美其名曰「推好」，有点神经病吧……我平日里听得最多的还是后摇。直推的情况下，会比较混沌一点，细节不是很充分。许多后摇都有很宏大的场面感，这个比较考验耳机的素质，大手办表现得中规中矩。在耳机没有煲开前，发声元件物理上没有充分地震动舒展过，音色与使用了一两个月后肯定是不同的。反正据说 K701 是潜力巨大的耳机，那就慢慢看吧。一耳朵下来，素质肯定符合千元大耳的水平。配合钰龙金丝雀\n一般来讲，某些耳机因为阻抗等物理特性，需要较大的功率或者较高的电流来支撑，而普通的输出端，例如电脑的耳机孔，手机的耳机孔等没有办法提供这样的输出，这就诞生了「耳放」这种东西，用来辅助提高功率或者电流，这是我所理解的耳放。HIFI 玩家还有更多的说法，考究实在太多，我不懂也觉得不必要搞懂，所以我不会去烧线材啦，电源啦什么的，对我来说毫无性价比可言。但耳放是我觉得有必要考虑一下的东西，因为它带来的改变比较明显，简单来说，投入产出比相对较高。K701 出厂是 6.3mm 接口，买的人心里应该有点数。网络上的评价无一例外地说换了前端之后 K701 能变成另一副耳机，变化相当大。但是前端的事，就太玄了。HIFI 穷三代，我不可能上万元设备推一个 1K 的耳机……多方考量之后入了一只钰龙金丝雀来搭配，据说这是 1K 左右性价比之选。也有不少人推荐仿刺猬（SAC K1000 仿制品），但是既然是仿制品，成品质量对制作者的水准要求很高。非工业生产线产品踩雷风险显著增高，权衡之下就没有选择仿刺猬。钰龙金丝雀 一张合照加上耳放之后，一耳朵能听出不同，我着重用两首曲子做了对比（为了方便放了网易云音乐上的版本）：《 Alone(2)》 by Sopor Aeternus《阿西达卡传奇》 by 久石譲其中《 Alone(2)》 这首曲子音色很丰富，高频分量比较多一些，整体感觉是更稳一些，高频毛刺明显减少了很多；《阿西达卡传奇》这首曲子有点交响乐的感觉，能听出更多的细节，混在一起的情况减少了一些。总的来说，一千块钱左右还是比较值得。我是直接 USB 口连接金丝雀作为解码耳放一体机使用的，坊间传闻金丝雀作为耳放的实力要更强一些。其实它本身也提供了接口，可以单独用作耳放，但是我受限于预算不准备再单独买解码了。目前的效果已经达到了我的预期。\n说说 HIFI 吧。HIFI 被认为是典型的烧钱爱好，一个耳放，一个解码器就各能烧去上万元，最重要的耳机更是有「八千听个响，万元入个门」这种吓死人的说法。但我觉得不必要把 HIFI 搞得这么妖魔化。大多数人买好一点的耳机，就是图个听感更好，或者就是样式好看。19.9 包邮的耳机到 100 块的耳机，听感可以有很大的进步；100 的耳机到 1000 的耳机，听感变化就不一定有前者明显；1000 到 10000 呢？我也听过上万的耳机，我觉得以普通人的需求来说，是不必要的。更不提线材、耳放、解码、电源这些东西，对一个平日玩一点游戏、看点影视剧、听一点流行乐的普通用户来说，有一个是一个，都是没必要的。耳机这种东西，终究是服务于人的。有人喜欢造型好看能出街的，那他就花 2000 买 Beats；有人整天乘飞机坐高铁，那就买 QC35 来隔音；有人手上苹果设备比较多，又不喜欢有线耳机，那就花 1000 买 AirPods；有人就是发现买电脑送的耳机听得头疼，花 100 买个淘宝爆款，又有什么不合理呢？非要回怼说 Beats 真正的音乐地摊假货音质更好，AirPods 白开水买就是交智商税，有意思没有？用自己觉得舒服的设备，听自己喜欢的音乐，才是硬道理。",
      "categories": [
        {
          "name": "Default",
          "slug": "Default",
          "permalink": "https://blog.imalan.cn/category/Default/"
        }
      ],
      "tags": [

      ]
    },
    {
      "title": "一点最近的 Update | 2018-07",
      "date": "2018-08-02T12:08:00+08.00",
      "path": "https://blog.imalan.cn/archives/139/",
      "text": "写这篇文章时已经进入八月了，刚好把暑假以来的生活和变化记录一下。生活\n自六月末放假以来，先是在家中休息了一周左右，然后赶回学校，继续手上的项目。这可能是我目前为止最忙也是生活最规律的一个暑假了。工作上的内容无甚可说，在做一个 Qt 项目，不能说多顺利，姑且算是有条不紊吧。除开工作的时间，每天还余下中午约 2 小时的休息时间、下午约 2 小时的休息时间、晚上 9 点以后的休息时间。作息很规律，对健康应该比较有好处。在家里时去医院对血液指标做了个检查，虽然我本来就偏胖，料想也不会太健康；但结果出来吓了我一跳。血压是一直在高线上，其余比较重要的血液指标也出了不少问题，血糖、血脂、尿酸都偏高。考虑到我还非常年轻，问题已经算是很严重了；同样因为一切都刚刚发生，还有补救的余地。所以回到学校之后，我尽量做到自律。作息上仍然没有太大改变，就寝时间一般在 1:00 左右，8 到 9 点起床，中午视情况午睡 1 个小时左右。至今为止的改变主要是在饮食和运动上。都说「病从口入」，我先调整了自己的饮食结构。过去四年之间我的饮食还算规律，但就是没有什么节制，还有吃夜宵喝饮料的习惯。现在夜宵基本不吃了，最多削一个苹果；饮料无法完全戒掉，但是我尽量只喝水或者用茶包泡的茶，饮料仅限于无糖可乐。我咖啡瘾挺重的，以前是一天喝 3 杯（6 袋雀巢速溶，我一般两袋一起冲），也戒不掉，但已经减少到了一天一杯。咖啡热量相当高，多喝肯定发胖。三餐则是多亏了门口的 711 便利店。早上去 711 买两个猪肉白菜包配着立顿的茉莉花茶或者一杯咖啡；午餐除非确实不饿，一般是吃正常的一餐到 8 分饱；晚餐的话是去 711 买一个饭团搞定。不摄入任何高热量食物，比如烧烤、巧克力等等。吃饭防止吃多的一个法门是细嚼慢咽，吃得足够慢的话，饱腹感会阻止自己吃过量。这甚至都算不上节食吧？很多女生吃撑了也就吃这么多。在初期深夜可能会比较饿，忍一段时间就不会了。学校运动场每天 22:00 关门，我就大约 21:00 去操场上跑步，每天 5 千米，慢跑，控制在 28 分钟到 33 分钟之间跑完都可以。目前除了跑步没有别的运动方式，跑 5 公里对我来说负担还是比较重的，等习惯下来再加上核心力量和上肢力量的练习吧。不去健身房的原因是太贵，而且我没有增肌的需求，先这么跑个几个月看看减重效果再说吧。运动还是非常必要的，毕竟程序员的工作性质决定每天要坐上超过 10 个小时，这是很恐怖的，很快颈椎、肩膀、腰部就会出问题。大约一周半左右，体重已经降低了大约 2.5 千克。这个数据是这么来的：我每天早中晚饭前饭后都会测，然后取平均值作为当天的体重，这样可以一部分抵消掉进食、运动脱水导致的误差。那么再继续坚持吧，希望在暑假结束时体重可以回到 70 千克左右。不管能不能完成目标，9 月 1 号我都会在这里补一张假期内体重变化的图表。\n图表就懒得贴了。现在到 8 月 31 日了，来说说近况吧。暑假前定的减到 70Kg 以下的目标看来是达不成了，现在还是 71.5Kg左右，很遗憾。虽然相对暑假前 77Kg  已经有了不小的进步。最大的惊喜还是跑步。从暑假前 6 分半配速跑 5 千米累到想吐，到现在 5 分半配速跑 10 千米都不怎么喘气，进步可说是相当大了，很满意。另外长时间跑步时感觉好像进入了另一个状态，跑完回过神来竟有种恍如隔世的感觉，妙。?\n余兴节目\n忙里偷闲，一旦能把漫无目的刷手机的时间节约下来，能干的事情是相当多的。最近值得一看的电影我基本没有错过，同时在追好几部 7 月新番，并且补了一些剧集，还读了三四本书。新上映的电影中，我最中意《邪不压正》、《我不是药神》。我相当喜欢姜文这个导演在前者中体现的个人风格，那种怪诞和荒唐我很受用；后者我在豆瓣上给了五星的评分，我相当欣赏它在人物塑造上的造诣，特别是王传君的角色，入木三分。另外在中国，一部能引发社会反思的电影，基本上可以确定是值得一看的电影。补看的电影中喜欢的比较多，毕竟烂片我也不会去补。《有话好好说》是姜文早期的作品，cult 味甚浓，同样是怪诞与荒唐，更胜过《邪不压正》，极为过瘾。《最终幻想女孩》、《流浪猫鲍勃》分别讲述了两个人的救赎，前者可能会因为名字而丧失掉一批观众，但错过了肯定是观众的损失。前者至最后仍然有些堵，后者看完只会觉得非常温暖，很适合晚上一个人喝着热红茶看。《三傻大闹宝莱坞》作为阿米尔汗的经典宣扬的价值观和人生观都值得称赞，内容本身也非常有趣。这些成名已久的影片不需要赘述了。《雪国》、《北野武的小酒馆》、《人间便利店》、《真幌站前》三部曲、《血疫 - 埃博拉的故事 》是我暑假开始至今读的所有书。《雪国》这本书可惜我读到的译本不是很理想，不过我仍然可以体会这部小说的出色之处。男欢女爱并不是重点，这部小说让我对雪国这个地方充满了向往。我对《人间便利店》与《真幌站前》这两部作品感兴趣多少是受了 711 的影响，这种什么东西都卖的万能小店让我很感兴趣。不过后来发现我误会了：《真幌站前》讲的不是「便利店」，而是「便利屋」，「便利屋」并不售卖产品，而是提供服务，也就是《银魂》中「万事屋」的概念。据说这部作品的改编电影更胜一筹，我还没看。《血疫》这本书以纪实文学的方式讲述了埃博拉病毒和它的几个变种造成的人类恐慌，可读性非常高，相当值得一读。病毒这种生物早在人类之前很久就存在于世界上，简单，高效，致命。若是按照《自私的基因》中的观点，病毒就是一种极佳的「生存机器」。目前在读的书还有：《失乐园》、《手冢治虫自传：我是漫画家》、《在路上》、《单读 17：人的困境》。《失乐园》无需赘述，这是一部将男女情欲描写到极致的作品。《我是漫画家》是手冢治虫生前唯一的自传，大陆并未出版，只好在淘宝上买了台版；《在路上》作为「垮掉一代」的代表作品，我很期待，想看看凯鲁亚克这个一代人的精神领袖到底魅力在哪里；我从《单读 15》开始读这个系列，算是比较硬核的文艺类书籍吧。对渐渐丧失了长文阅读能力的我们来说，多阅读长篇幅的严肃作品是有意义的。就一篇随笔来说篇幅已经很长了，关于剧集、追番的部分就略去，下次再说。那么，今天就到这里。",
      "categories": [
        {
          "name": "Default",
          "slug": "Default",
          "permalink": "https://blog.imalan.cn/category/Default/"
        }
      ],
      "tags": [

      ]
    },
    {
      "title": "Vintage Web",
      "date": "2018-07-17T20:21:00+08.00",
      "path": "https://blog.imalan.cn/archives/137/",
      "text": "今天干活摸鱼，读到了一篇文章：How the Blog Broke the Web ，正巧，我最近正在思考一些相关的问题，于是就着不成熟的想法写这么一篇短文。读到的这篇文章讲了一件事：面向大众的博客系统如何让 Web 变得千篇一律，变得不「Cool」了。作者谈到，早年间他网上冲浪(Surfing the Net)时，还没有博客(blog)的说法，大家有的是主页(homepage)。那时候一个人要发布一篇内容，步骤何其繁杂：\nWe built every new page by hand. When we had more than one web page, we built the navigation by hand. We managed our Table of Contents by hand. We broke out our calculators to code boundaries for our image maps. We talked unironically about “hyperlinks.”\n以及：\nDiarying was a helluva lot of work. First you had to have something to say, then write, edit it, format it, add clip art, edit your index.html, edit any prev/next links, check those links, and lastly, upload the files.\n门槛不低，就连我读到这里都吃了一惊。最近我有回到静态博客的想法，因为毕竟动态博客系统依赖数据库，而在中国租用 VPS 可不是件便宜的事情，静态博客则有简单的解决方法。手写 HTML 与 CSS，以及需要的 JS 代码是终极的解决方案，但我随即自我否定：每一个页面都自己写一遍 head 标签里的各种 meta 吗？不能愚蠢至此啊，即使是刚发明万维网时也不可能连这等自动化程度都没有。事实证明我错了，依照上面的片段，我们的前辈们是真的在手写每一个页面。后来我在 Hexo 上犹豫不定，Hexo 是一个静态博客生成器，它把输入的 Markdown 文件转换为各个 index.html。这种解决方案与文章中提到的「Movable Type 」同出一辙。「Movable Type 」不是什么大不了的系统，只是一系列的脚本而已，比起 Hexo 尚要落后许多，更不提 Wordpress、Typecho 这些带有数据库的动态博客系统了。然而正是这个东西，被作者认为是 Web 死掉的开端。这是个简单的道理：东西越是简单，用的人越多。上面是「Movable Type 」新建文章的界面，这与如今的 WordPress、Typecho 没什么大的不同。你只要在每个框里输入对应的内容，工具就能帮你生成需要的 HTML 文件。有了这样简单的工具，内容生产者大可把心思放在要写的内容上，而不必忙碌于学习 HTML。坏处是：网站们变得千篇一律，当年自己写页面、百家争鸣的好日子不在了。听上去又是那一套「Golden Ages」的论调，我们很容易在脑袋里构思出一个上了年纪的大叔嘟嘟囔囔地说着“当年可不是这样的……”，不无顽固的感觉，但就这件事上，作者说对了。虽然用着 Hexo、WordPress、Typecho 默认主题的不多，但即使是使用自定义的主题也是大面积地撞车。比如我正在使用的「handsome」主题，在 Typecho 世界是十足的明星主题，使用的人何其多。个人博客的个人特质只能通过「魔改」来实现，但这门槛可不低。即使是 Hexo 也不可谓不复杂，Typecho、Wordpress 可不是简单的静态博客生成器，它们是动态博客。在 2018 年一个人想要自己定制博客，除了 HTML、CSS、JS 外，还要掌握服务端的语言，比如 PHP、NodeJS 等。若使用这些博客系统有一个难度曲线的话，从「使用一切默认功能」到「做出自己的改变」之间有陡峭的难度提升，绝大多数人难以越过。结果就是，[Cool but difficult] VS [Ordinary but simple]，绝大多数人会选择，也只能选择后者。这就是为什么How the Blog Broke the Web 这篇文章的作者说“Blog broked the Web”。虽然这个说法显得过于斩钉截铁，忽略了简单的工具带来的好处，但我们可以接受作者的这一点说法：博客系统的出现让网络世界不再丰富多彩了。「要和别人不一样」听上去更像一个 15 岁少年想要标新立异时的想法，很可能会被一些实用主义者嘲笑。但仔细想想其实历来如此，如果你总是与别人做一样的事，you are never cool。网络世界可从来没有因为「整洁划一」或者「井井有条」被人们称道。The online world is destined to be diverse.我不是在倡导大家回去过原始生活，去“手写 index.html”。这谁也倡导不了，历史有它前进的方向。有一件事我们得明确，不是“手写 index.html”造就了人们怀念的 「Vintage Web」，而是那种纯粹、创造力、多样性造就了「Vintage Web」。我要倡导的是：去折腾，去玩，去创造，去用尽你的想象力做出真正有趣的东西。Live like a 16 year old boy, forever.",
      "categories": [
        {
          "name": "Default",
          "slug": "Default",
          "permalink": "https://blog.imalan.cn/category/Default/"
        }
      ],
      "tags": [

      ]
    },
    {
      "title": "乐山 | 与学校有关的一些记忆",
      "date": "2018-06-28T20:43:00+08.00",
      "path": "https://blog.imalan.cn/archives/136/",
      "text": "今天先去了四川峨眉山，然后回到乐山市区，吃晚饭时路过了乐山师范学院的门口。以大门为中心，上下长约两三百米的街道开满了学生们喜欢的奶茶、冷饮、小吃、文具店，也有大片大片的廉价餐馆。四处都能看到三三两两勾肩搭背的几个哥们儿，或者看上去非常甜蜜的情侣。路边吃串的吃串，聊天的聊天，市井气很浓，年轻的气息也很浓。不由得有些羡慕。北航体育场后面曾经是小吃一条街，称“北航CBD”，一段时间里我会在早上经过那里。北京冬天的早晨很冷，但那个小巷子里沿路都是蒸笼冒出来的白汽，学生排队买上两三个包子或者一个煎饼，一边吃一边走着去上课。那种场景让我觉得很有生活的味道。如今这条小巷子已经拆掉，剩下的只有贴着“核心价值观”的灰色围墙。随着消失的还有篮球场边上卖冰镇饮料的大叔大娘，所以现在见不到篮球场上大汗淋漓的小伙子从围栏缝里塞钱出来，嘴里叫着“大叔，来一瓶脉动，冰的！”了。某天下午和室友散步时我说：“我觉得这些拆迁都非常可惜，这些「脏乱差」的地方真正蕴含了一个学校的人文气息。不论学生愿不愿意承认，多年以后追忆大学的时光，第一件想起的事恐怕不是校园多么干净，而是三朋四友打球后一起喝冷饮吃冰棍、在学校说不上高档的餐馆里喝酒聊天的时光”。再回忆得久些。高中时我在新校区就读，四周基础设施都待建设，周末除非「进城」没别的地方可去。后来小商小贩都嗅到了商机，就在校门对面的空地上支起帐篷，开起了小店，条件简陋，但是该有的一点不少。刚巧从历史书上学来“草市”一词，这个小市场就被学生们称为“草市”。周末时就去那里买炒饭、鸡翅，或者买些零食水果供下周消耗。也有杂志图书教辅文具。这些小摊周五而作周一而息，和学校、学生、城管保持着微妙的默契。曾经有几次默契被打破，城管不许摆摊，学校里一片哀嚎。我格外气愤，白纸黑字写了一篇“檄文”贴在食堂门口的公告牌上，谴责不让摆摊的行为。过两天去看，竟然有好些学生在下面签名表示同意。几年没有再回母校，听说学校周围修起了商业街，“草市”已不复存在了。",
      "categories": [
        {
          "name": "Default",
          "slug": "Default",
          "permalink": "https://blog.imalan.cn/category/Default/"
        }
      ],
      "tags": [

      ]
    },
    {
      "title": "一点最近的 Update | 2018-06",
      "date": "2018-06-13T20:27:00+08.00",
      "path": "https://blog.imalan.cn/archives/133/",
      "text": "基本完成了毕业流程\n到六月中下旬，随着北京少见的几场雨，我也快走完毕业流程了。前前后后在博客上就毕业这件事情发了好几篇短文，自己都有点不好意思了。这个暑假不会有什么假期的味道，需要留在实验室帮着做一些正事。有人评价说我是工作狂，因为一旦闲下来就会很狂躁，宁愿一直保持忙碌的状态。其实我不是狂躁，只是一旦不干正事就会有很重的负罪感。我经常自我审视，自认为如果我想要在我现在的这一行做得还算不错的话，我还差得很远，因此就会觉得非常紧张。所以对加班我一般不会抗拒，对更多的任务我也不会有什么怨言，也很愿意自己去多学习新的概念、技术。目前我觉得这个状态还算可以，在我身体还吃得消的前提下可以继续。今天把宿舍里一些杂物收拾了一下，准备把不重要的东西寄回家。发现自己最多的东西就是实体书。我一直都有 Kindle，iPad、iPhone 也都有，也不抗拒电子书，但仍然是控制不住买实体书。买了倒也不浪费，都是好好地读过了。只是实体书在搬家时实在是累赘，我暗自下决心：以后尽量买电子书，虽然我已经不记得这是我第几次下这样的决心了（笑另外就是大量的电子产品和电子垃圾。这些东西都是多年的折腾累积下来的，又不愿意扔。同样的东西还有不少淘宝上买的物件、衣服。近一年我逐渐改变自己买东西的策略，尽量多花功夫对比，买好一些的产品。其实对比下来不会多花多少钱，而且拥有的东西少一些但是精致一些反而能提高幸福感。我并没有囤积物品的癖好，更喜欢简洁的生活。最近在追、补的剧与番\n首先是四月番 Megalo Box。这番真神了，虽然剧情上有些落了俗套，但是画风音乐我是真佩服，一股 90 年代风铺面而来。很久没有看番时燃起中二魂了，后宫番看得越来越多，脑子里全是纸片人。渐渐丧失了对现实世界的感受力。我意识到这不是好事，我希望自己一直保持敏锐。然后是经典日剧《东京爱情故事》，一部有年头的剧了。不是很能表述自己看这剧的感觉，大概自己的心境已经难以与这部剧产生共鸣了吧？但是剧中的感情真是美好啊！最后是今年的一月番《Darling in the Franxx》。之前我看了第一集，给我很强的劣化版 EVA 的感觉，就搁置了。后来屡屡听到好评，然后又捡起来。到第十三集，我对这部番的好感达到了顶峰。可惜的是后来的几集，包括最新的 20 集，那种劣化 EVA 的感觉又上来了。看还是会看的，最后几集决定它究竟能在多大程度上对得起「国家队」这个称号。今天就扯到这里吧，下楼跑会儿步去。",
      "categories": [
        {
          "name": "Default",
          "slug": "Default",
          "permalink": "https://blog.imalan.cn/category/Default/"
        }
      ],
      "tags": [

      ]
    },
    {
      "title": "熊猫追番 (PandaBangumi) for Typecho 发布！",
      "date": "2018-05-30T23:00:00+08.00",
      "path": "https://blog.imalan.cn/archives/128/",
      "text": "熊猫追番是一个可以给 Typecho 博客增加番剧展示功能的插件。我之前有写过一个独立页面模板，也是把 Bangumi 上的数据拉过来展示，我觉得也还蛮不错的，但是用起来还是不够方便，且功能不是很完善。这两天鼓捣鼓捣弄了一个插件版出来，用起来应该蛮舒服的～\n展示页面：我的追番\n更新\n2018-11-18：2.0移除了大量使用频率低的功能，仅保留追番列表功能。\n移除了追番日历\n移除了公共 CDN\n移除了单个番剧展示\n无需填写账号与密码，只需 ID\n重写样式\n\n2018-10-28：开启了精简的版本。在该版本中，去掉了番剧日历与展示单个番剧的功能。如要使用这个版本，请从 Github clone 最新的代码至本地，然后执行 git checkout simple-ver，然后在后台禁用再重新启用插件。新版本不需要账户与密码，只需要填写你的 ID，即你用户主页链接 user 后面那一串数字。2018-08-29：重新写了样式，现在不只是单个展示的番剧，追番列表中的番剧也可以点击显示简介。请手动清除一下缓存的数据文件（插件设置页有删除缓存的按钮）。移除了并没有什么用的“黑暗模式”。由于增加了简介的缓存，首次加载时间会变长一些……简单的功能列表\n\n可展示追番列表与追番进度，带分页功能，可设置每页显示的数量，AJAX 加载\n可展示番剧播放日历\n可以单独展示某部番剧，一篇文章可以展示多部\nAJAX 加载 + 数据缓存，用起来应该还满顺畅的\n\n使用\n插件版添加了分页功能，这样追番很多时能节约流量，加快速度。追番列表与追番日历功能都可以自己选择要不要开启，在插件里设置就好。使用方法：去 GitHub 上下载插件：https://github.com/AlanDecode/PandaBangumi-Typecho-Plugin解压后把文件夹改名为 PandaBangumi ，上传到服务器 /usr/plugins 目录下，在 Typecho 后台启用本插件，填写 ID（即用户主页链接后的那串数字），设置一下每页展示的数量。如果你的博客没有引入 JQuery 的话可以在插件里选择引入。在任何页面，不论是独立页还是一般的文章页面，在文章里插入代码：在看&lt;div data-type=&quot;watching&quot; class=&quot;bgm-collection&quot;&gt;&lt;/div&gt;\n\n动漫已看&lt;div data-type=&quot;watched&quot; data-cate=&quot;anime&quot; class=&quot;bgm-collection&quot;&gt;&lt;/div&gt;\n\n三次元已看&lt;div data-type=&quot;watched&quot; data-cate=&quot;real&quot; class=&quot;bgm-collection&quot;&gt;&lt;/div&gt;\n\n保存发布，这个位置就会展开成追番展示面板。加载和分页都使用 AJAX 请求～插件带了缓存功能，可以极大地提升速度，但是记得要保证 插件目录/json/bangumi.json 这个文件可写。注意事项\n服务器需要启用 PHP curl 扩展。不一定所有主题都完美。模板会向 插件目录/json/bangumi.json 文件写入缓存数据，请保证这个文件可写。如果你发现 PJAX 切换页面时番剧都不加载了，你需要去主题的 PJAX 回调函数中添加一句 initCollection();如果你的主题没有引入 JQuery，记得在插件设置里选择引入。引用与参考的项目\nBangumi API 部分参考了梓喵出没大佬写的一篇Bangumi的几个API及使用PHP调用的简单测试 。如果有帮助到你，欢迎在 GitHub 给我 star 哦～",
      "categories": [
        {
          "name": "Default",
          "slug": "Default",
          "permalink": "https://blog.imalan.cn/category/Default/"
        }
      ],
      "tags": [

      ]
    },
    {
      "title": "一点最近的 Update | 毕业季 2018-05",
      "date": "2018-05-15T23:43:00+08.00",
      "path": "https://blog.imalan.cn/archives/125/",
      "text": "一、从上学期（2017下半年）我搭建这个博客开始，关于页面里的自我介绍就是“即将上研的首都大学生”，如今到了2018年中旬，毕业才真正地临近了。我的一些不同学校的朋友，许多已经走完了毕业流程，开始了毕业后的生活。毕业旅行也好，找工作进入职场也好，实习也好，大家都开始了人生的一个新阶段。我真心为他/她们感到开心。我的接下来两年的路径大致已经确定，就是读研，搞科研，精进技术，然后去做一份开发工作。虽然是半路出家的野生程序员，但是对开发的热情渐浓，目前所考虑的路径就如上了。我不是一个很爱做计划的人，或者不如说，我不是一个很能遵循计划的人。今天早上有位朋友在一条旧微博下面@我，给我看两年前的一张聊天截图：photo_2018-05-15_23-36-00人生充满了惊喜，这句话永远都是对的。虽说我两年对自己的预言如今多半成真了，但实现过程中零零碎碎的过程还是无法预料，既然无法预料，那就不要想着去掌控一切，做自己觉得正确的事，享受生活给自己的惊喜就好了。二、最近，学院要求应届生做一个 presentation，总结大学四年的收获遗憾。我本是不 care 的，知道这是一项政治任务，但是在展示现场，看同班同学一个个上台展示，把一些陈年老照片拿出来展示，还是难免有些感慨。四年的时间，比初中长，比高中长，但却给我留下了远不如初高中深刻的印象。一个侧面展示出我这四年多少还是不够充实吧。不过从个人成长的角度来说，除了体重从120斤突飞猛进到150斤外，思想境界也有了不错的长进。不是说我脑子里多了多少知识，而是我思考问题的方式在朝我理想中的方向前进，这是最重要的。一个特点没有改变，就是对感兴趣的事情充满了热情，一定要做到最好，做到自己满意为止。三、大一军训把过眉毛的长发（毕竟男生，还挺长的）剪成了不到 5mm 的寸头之后就再也没有搭理过头发的事情，大概是没有了女朋友，也没有太多交际，对自己的外在形象就没那么在意了。如今想要把头发再留回来，遮一下日渐宽广的额头，另外也提醒自己：不过20多岁而已，I still have every reason to be young。我的头发一旦处于不长不短的状态时就会乱翘，非常不服帖，最关键的是，还只是一部分乱翘、不服帖，另一部分却乖乖的。索性去烫了头，现在所有的头发都乱翘，满意。胡子也是一周也不刮一次。今天用电动剃须刀试着刮了一下，发现胡子太长，缠住了刀片，扯得疼得不行，只好用刀片手动刮了。四、过去四年，浪费了两年。其余两年受了拖累，没有做任何真正酷的东西。如今是一个契机，我希望能够从事真正有趣的工作。没有什么比兴趣更能激发我的潜力。大概会参与一些开源项目，甚至自己启动一两个也说不定，把浪费的时间补回来。学习手绘，学习日语，谁知道呢？不希望再随波逐流了，天高任我飞。太功利过不好这一生，至少难开心。",
      "categories": [
        {
          "name": "Default",
          "slug": "Default",
          "permalink": "https://blog.imalan.cn/category/Default/"
        }
      ],
      "tags": [

      ]
    },
    {
      "title": "为什么每个人都应该有自己的 Wiki",
      "date": "2018-04-29T19:54:00+08.00",
      "path": "https://blog.imalan.cn/archives/108/",
      "text": "我们不是生来就具有知识，知识是学习来的、总结来的。但由于人类大脑的原因，习得的知识并不总是那么稳当，当你需要的时候它们经常消失在大脑里，因此你不得不做无用功，去搜索，再一次习得这部分知识。这个过程周而复始，已经成了一个我觉得只有蠢人才不会在意的问题。想要让知识在脑海里保持稳固，一个方法是不停地去重复使用、重复学习它，这是无数人提倡多练多用的原因，例如对学习一门语言来讲这种方法不是最轻松的，但是却很稳妥。你可以确信，只要你每天都念同一句话，这一句话总不至于在下一次要说的时候想不起来。但是这种方法不是所有场景都适合，特别是对某些知识点特别繁杂、但是使用机会却不多的领域。你可以某天都背单词，但我觉得你不愿意每天默写一遍二叉树前中后序遍历的代码，也不愿意每天都温习一遍更改 grub 启动顺序的方法。这类场景和学英语有本质的不同，学英语的目标是融会贯通，内化成自己的一种本能，要求学习者建立起相对完整的知识体系；但我可能一年半载都不会写一次遍历二叉树的代码，这就导致我每天去重复练习它性价比太低。另外，零零散散的知识点何其多，重复练习就是简单地不具有可行性。对这类知识，最好的办法是招之即来挥之即去，用的时候习得，不用时就不要让它占据自己的大脑太久。这是我推崇印象笔记这类软件的原因。像它声称的一样，要做你的「第二大脑」，意在让人把当下不重要的零散知识 dump 出来，保持大脑的干净整洁，同时也保证知识并没有丢失，它们一直在笔记库里静静等待你的调用。为什么不直接去互联网搜索？原因其实挺显而易见。互联网是变化的，一个信息来源，下一次去访问就不一定还存在，而且从搜索结果中剔除出需要的内容耗费的精力也不低，而这种精力本没必要每次都付出。每个人都应该具有这样的一个系统：它能装下上文所述的那些零散知识，同时能够在你需要的时候方便地找到。我把这样的系统都叫做「个人 Wiki」。背后的实现方式重要性却没有那么高，你可以用印象笔记，可以用为知笔记，甚至纸笔、系统自带的备忘录也可以（其实系统自带备忘录挺强大的）。Wiki 这个词本来指的是多人维护的写作系统，但是我曲解它，把它解释成像维基百科那样由一个个词条组成的知识网络。以我为例，我要求这个系统至少具有一项功能：搜索。能够搜索词条标题，不错；能够搜索词条全文，很好；能够搜索包含的附件内容，完美！从这个角度来看，印象笔记高级版完美实现了，它甚至还能搜索照片中出现的内容（应该是通过 OCR 实现的）。当然，也可以选择自己搭建一个 Wiki 站点。方案有很多，最经济低成本的是基于 Hexo + GitHub Pages（或者国内的 Coding Pages）服务来搭建，这样不仅自己能有一个 Wiki 站点，由于内容发布到了互联网上，所以还有可能帮助到更多的人。在选择站点主题时要注意一点，记得选择对分类和搜索功能支持良好的主题。有的主题虽然很美观，但是作为一个 Wiki 系统而言可能没有那么合适。我自己是选择了一个 Hexo 主题：zthxxx/hexo-theme-Wikitten 。这个主题的作者也说这是专门为个人 Wiki 设计的，支持多层级分类，支持全局搜索。我特别喜欢它的搜索功能，随着搜索词输入实时更新结果，非常舒服。我的 Wiki：熊猫小A的Wiki我真心呼吁每个人都搭建自己的一个 Wiki 系统，用什么方式实现，发布在哪里都不重要，但有和没有区别很大。",
      "categories": [
        {
          "name": "Default",
          "slug": "Default",
          "permalink": "https://blog.imalan.cn/category/Default/"
        }
      ],
      "tags": [

      ]
    },
    {
      "title": "关于最近的一点 Update | 2018-03",
      "date": "2018-03-26T23:59:00+08.00",
      "path": "https://blog.imalan.cn/archives/101/",
      "text": "开学也快一个月了，毕业设计什么的在有条不紊（毫无头绪）地进行，不过最近身上的任务还不算重，有时间折腾点硬件软件。简单记点流水账吧。Surface Pro\n前段时间发神经一样地出掉了手上的 iPad Pro 9.7 寸，出发点主要有几个：iPad Pro 说实话还是比较难参与到我的日常学习工作中来，码代码的话，iPad Pro 写点脚本语言，Python、JS 什么的还勉勉强强，用来写 C、C++ 实在是不适合，另外 iPad Pro 确实没有便携、舒适的外接键盘，这是真话，即使是 Smart Keyboard 也缺点火候。我用 iPad Pro 主要的用处基本上就是看 PDF，在这一点上，配上 Apple Pencil 的 iPad Pro 确实是无敌的。总之我还是咬咬牙入手了 Surface Pro 乞丐版，体验了一周左右，现在怎么说呢……中规中矩吧，也没有特别惊艳的感觉。我有一个失误：以为配上了 Surface Pen 的 Surface Pro 可以至少与 iPad Pro 一拼，其实在触控、书写体验上，真的还差得远。差到我赶紧把 Surface Pen 给退了，因为我知道我基本上不会去用它。之所以说是失误，现在的 Surface Pro 基本上被我当做一个普通笔记本来用了，白白浪费了触控功能。其实这个价格我完全可以去买一台小米笔记本的……好的地方嘛，作为一台平板来讲，有出色的键盘和触控板（除了 Surface 系列，我基本没看到过不是垃圾的 Windows 笔记本触控板，），美妙的全功能 Win10，比较优秀的屏幕，还有让我很满意的 Windows Hello；作为 Windows 笔记本来讲，轻薄便携，续航优秀，外形酷炫，非常帅气。从使用的角度来讲，最轻度的笔记本电脑使用需求：网页浏览，Typora 写点小文章，Office 套件，一些基础的 Win32 应用、UWP 应用都毫无问题；中度使用，VS Code 写点 Python 啥的也 OK；重度一点的嘛……我是勉勉强强把 VS 2015 和 Matlab 给装上了，只能说，非常非常勉强，我是没有用来干活的欲望，顶多借助 VS 的智能跳转和智能提示看看我用 Dropbox 同步过来的项目，真正干货还是滚回我那个又大又厚又重又丑陋的联想 R720。现在的期待：求大佬们赶紧搞好 New Surface Pro 的 Ubuntu 驱动！我要装 Ubuntu！触屏什么的无所谓，只要能连 WiFi 和蓝牙以及键盘能用我就满足了！WSL\nWindows Subsystem for Linux，简称 WSL，让我们能在 Windows 里直接使用 Linux。关于这个的教程蛮多的。我主要使用的系统是 Windows，但是有时候要进行一些开发调试，比如这个博客，本地有个 LNMP 环境还是比在远程服务器上搞轻松一点的。开始我是用的虚拟机装 Ubuntu，资源消耗有点厉害，后来听说了 WSL 就想试着看看能不能部署好。但是失败了……不管是 PHP 还是 Nginx 还是 MySQL 在 WSL 里的表现都怪怪的，学艺不精，搞不明白，所以暂时就放那儿了。不过我也没把 WSL 卸了，有个 Bash 环境很方便，某些小的命令行工具用起来很舒服的~环太平洋\n今晚刚去看，我是第一部的粉丝，真心没有办法拒绝这种机甲的设定！之所以喜欢机甲，其实很大程度上是因为 EVA。所以虽然这第二部评价不佳，但是我看到了更多借鉴 EVA 的元素，弄得我很兴奋~比如一开始，可以说是把 EVA 中的量产机、无人驾驶机、dummy system 几个设定揉在了一起，甚至还有侵入性使徒这种设定的影子，后来东京那场戏让我觉得可能把第三新东京市都造好了……行人躲进一个电梯一样的东西里，这玩意儿就径直下地了，这不是第三新东京市是啥哈哈。路边的铁桩、门上的警戒标识基本上完全是 EVA 的风格，甚至连机甲本身都更像 EVA 了：有一架（名字忘了）跟零号机长得非常像~庵野秀明不让我看新剧场版，我就去《环太平洋》里过瘾，哼 ╭(╯^╰)╮还有，景甜竟然没有打酱油，还是个相当重要（混乱）的角色。但这不是她锅，是剧本的锅。\n时间也不早啦，就说到这里吧。明天还要苦逼的早起……",
      "categories": [
        {
          "name": "Default",
          "slug": "Default",
          "permalink": "https://blog.imalan.cn/category/Default/"
        }
      ],
      "tags": [

      ]
    },
    {
      "title": "说说最近沉迷的东西 | 2018-01",
      "date": "2018-01-28T23:44:00+08.00",
      "path": "https://blog.imalan.cn/archives/2018-01/",
      "text": "虽说最近算是名义上的放假了，但可能还要在学校呆上一段时间。说实话没有什么干正事的动力，从一周前就基本进入了划水状态；当已经进入划水状态时逼自己干正事真的很痛苦。所以就继续划水吧。一月新番的话，因为事情还蛮多的，所以只看了几部。其中最对我胃口的是这几部。《卫宫家今天的饭》\n卫宫家的饭.png前段时间推荐室友看了 Fate 系列，我自己也重温了其中的某些片段，好像又找回了大一时第一次看的感觉。最中意的是《Fate/Zero》，特别喜欢对切嗣的刻画。第一次看时，到切嗣用火箭筒轰掉飞机，渐渐响起那一曲《満天》时整个人都怔在那里了。这是给我印象最深的一幕。当初看《Fate/Apocrypha》时我觉得，在看 HF 线之前还是不要再碰 Fate 系列了吧……但《卫宫家今天的饭》看了第一集就觉得炒鸡治愈。打什么圣杯战争，大家一起坐在被炉前美美地吃荞麦面吧~非常日常的剧情，非常让人舒服的作画，非常恰到好处的节奏，让我因为琐事而紧绷的神经放松了不少。这只是 13 分钟的第一集而已。期待后续。《擅长调情捉弄人的高木同学》\n这番简直给单身狗无限暴击，让我想滚回去重新来一遍九年义务教育。虽然是搞笑日常，但我觉得搞笑倒还好，真的让人觉得很甜很甜。其实嘛，也不必那么羡慕。回头想想自己的初高中也类似，虽然一般自己才是捉弄别人的一方。现在想起来，可能当时真的很招人讨厌吧？（笑）没事就喜欢逗逗别人，突然吓别人一下什么的，都是为了吸引对方的注意，想起来超幼稚的。啥也不懂，啥也不会的小孩，能给的只有最浅显易懂，但又最不为人知的那点心意罢了。《紫罗兰 · 永恒花园》\n所谓「世纪霸权，人类圣经」哈哈。这番最让我觉得震撼的是作画，那种精良程度我觉得无出其右。这个就不多说，有兴趣看看它的一支 PV 吧：我对原作剧情一无所知，直接看的番，看第一集的时候其实我稍稍有点失望。一开始指明是战争背景，主角又是一位被用作兵器、能力非凡，却冷冰冰的少女；虽然冷冰冰但唯独对一个人有懵懵懂懂的情愫。我本来以为是一个比较宏大的世界观，比较宏大的故事。后面的展开比我想的要“小气”一些。但就这个主题好好把故事讲下去也很值得期待。还看了大概看了几部别的，但觉得无甚可说，就略过了。\n果然还是要白一下。《白色相簿 2》还剩最后的冬马 TE 没有通，我准备留下来找时间慢慢来。好东西总是要留在最后。目前来看，CC 的四条线，雪菜、千晶、麻理、小春我最喜欢的是千晶线，作为故事来说最引人入胜。之后按顺序来是小春、麻理、雪菜线。如果再加上 Coda 的话，我目前最满意的是浮气线（所谓冬马 NE）。说冬马 NE 不是很到位，还是应该叫做浮气线。这条线，不论是对冬马党还是雪菜党来说都很虐，但我觉得这条线是最具美感的。春希把对冬马的感情放在心底藏起来，其实与冬马一见面就根本压抑不住。两个人整整一周如同原始人一样足不出户，做爱，睡觉，缠绵，然后去看雪，然后分别永不再见。冬马最终放手，春希则回到那个永远都在承受、永远都在原谅的人身边，用下半辈子去赎自己的罪。特别中意一早醒来，春希发现身边的冬马不见，急忙出去找后看见一篇雪原上身着黑衣的冬马这一幕。wa2.png我向来觉得人一生里，总有些事非得在某些时间段做不可。这些事，不在那时做不好；这些时间，不做那事没意义。对春希来说，那段时间就应该与冬马来一场原始的、激情的、疯狂的恋爱。还剩下的冬马 TE 当然我会玩，大概会让我一个冬马党很满足，但是我自信最后我还是更喜欢浮气线。\n接下来要恢复一下，我还是尽量现充吧。",
      "categories": [
        {
          "name": "Default",
          "slug": "Default",
          "permalink": "https://blog.imalan.cn/category/Default/"
        }
      ],
      "tags": [

      ]
    },
    {
      "title": "随笔 | 北京忘了下雪",
      "date": "2018-01-22T15:59:00+08.00",
      "path": "https://blog.imalan.cn/archives/20180122sui-bibei-jing-wang-le-xia-xue/",
      "text": "昨晚看预报说北京今早可能有雪。于是我怀着期待地睡了，想着今早能就着雪来开题答辩也是蛮好的。但早上起床一看……雪的影子都没有。我记得去年冬天也少雪。北京已经忘了冬天要下雪这回事了。虽然我也不是很稀罕雪这种东西，毕竟小时候看得很多了。但四季多少要有四季的样子，冬季最好的代表就是白色相簿雪。不只是雪，雨啦风啦雷啦都会让我觉得很舒服。在这些场景中，我最喜欢的是这样一种场景：\n暴雨从早上开始下，现在看来也丝毫没有要停的意思，虽然只到下午三四点钟的样子，窗外的天空却昏暗得像傍晚。室内的灯光也昏昏黄黄，照明灯像我一样打不起精神来；不知道外面的风多大，只能听见因为年久而松动的窗框不停发出“哐当哐当”的声音。虽然很享受这些嘈杂的“噪音”，但我好像全然不顾，只用一杯热茶暖手，翻动一本发黄的旧书。若身边再有一位与我同样心境的人，那就更是妙不可言了。\n我印象中，这样的场景在初中的时候发生过。那时候很罕见地连着下了一周的暴雨。小城里的排水系统不堪重负，路面低洼处蓄起了好几厘米深的积水。可能对许多人来说都觉得糟透了，只是吃个饭上个学都会把鞋子裤脚弄得湿透，但我很享受。又想到偶然看到的一条微博，原文和出处我找不着了，大致是这么一句：\n人在年轻时，要尽可能地去体验、见识一些超越时间空间的事物。例如用千万年时间拍打岩壁的海浪、轻而易举就能吞没巨型油轮的风暴、让人产生深深无力感的沙漠、一望无际的冰原、雨林里相互交错盘杂的巨形树根。这样一来，当感觉属于自己的地方是如此逼仄、自己的心境又是如此阴暗潮湿时，能用更宏大的视角来看待生活与生命。\n我写得没有原文好，但意思我传达到了。暴风雨有这样摄人心魄的力量。雪也有，雷暴也有，地震也有，海啸也有。本质上来说，是自然本身在让我敬畏。越是去探究自然，越是觉得无法理解自然，越是觉得自身之渺小，之不值一提。只好乖乖臣服于自然。\n这学期，虽然正式的课程已经早就结束了，但是仍然被课程设计啦毕设开题啦缠到现在。今早毕设开题完，觉得稍稍轻松一点。下午去唱 K，发现自己近来根本没听什么中文歌，甚至没听什么英文歌，都是日文……所以完全不可能唱得出来，有点痛苦。但前段时间弄得有些疲倦，出去只是嚎一嚎也是蛮好的。说到了雪，顺便提一下白色相簿。虽然是有一定年头的番了，但我最近才看。看了觉得……嗯……想要看后续，然后又把游戏找来玩。目前走了雪菜TE，然后倒回去再走别的线。游戏很优秀这已经是有定论了，竟然让我这个中年大叔也有点春心荡漾，就更想看下雪了。不论如何，还有两句话我想放在这篇雨雪主题的杂文里：\n隐约雷鸣，阴霾天空，但盼风雨来，能留你在此；\n隐约雷鸣，阴霾天空，即使天无雨，我亦留此地。\n",
      "categories": [
        {
          "name": "Default",
          "slug": "Default",
          "permalink": "https://blog.imalan.cn/category/Default/"
        }
      ],
      "tags": [

      ]
    },
    {
      "title": "被捂住的十亿张嘴",
      "date": "2017-11-26T01:03:00+08.00",
      "path": "https://blog.imalan.cn/archives/shut-one-billion-mouths/",
      "text": "前段时间逛万圣书园，买到了《东京本屋》这本书。一本讲东京各种书店的书，以及一些对书店从业人员的采访。读起来很有兴致，特别是其中一章，讲位于东京都新宿区的书店「模索舍」：\n它的诞生和日本学生运动关系密切，还有一段时间曾被认为是“过激左翼派”场所。\n……\n踏进店门，收银台左手边的角落是最能呈现该书店特色的“新左翼系”党派机关报、右翼团体的小册子、公害或人权有关的市民运动小册子、被判死刑囚犯的支援报告、日本边缘社会“部落问题”的研究书。离店门最近的书架两侧都被比较软性的亚文化系刊物占领：曾经为我和模索舍前线的同志主题同人志、露宿指南书、台日混血儿的台湾旅游记、年轻女子“援助交际”的体验记录等等。\n总而言之，一家「大家只要想“表达”，什么东西都可以拿来在这儿销售」的书店，是许多自由主义者的天堂。因为在 2017 年的今天，显然即使有口有手，也不是想说什么就能说、想写什么就能写的了。Twitter 诞生时我年纪尚小，对互联网还没有什么概念。如今只能从一些纪录片1中了解这样的开放社交网络曾为信息传播带来怎样的革命。即使互联网从诞生之日起就担负着促进全人类交流的重任，但是我想，还是 Twitter 这样的社交网络第一次让人们见识到，一条条不足 140 个字符的“推文”能形成怎样的星火燎原之势。Twitter 在大陆已经无法正常访问，其在中国的模仿者新浪微博接过了一面大旗。一个层面来说，微博做得很好。比如最近就顺利地扛过了“鹿晗公布恋情”这样的服务器大考验，前段时间相似的还有“王宝强离婚”这样的舆论大事件，形成了全民讨论的奇观，叹为观止。但是问题不出在微博。2017 年 7 月 23 日，中国性学家李银河在朋友圈发表了一段话，此前李银河因在微博发表《我们为什么应该彻底取消审查制度》一文而被微博禁言三个月：\n事情为什么不可言说呢？仔细观察，其中必定有做错的事不肯承认。然而，不承认事实真相对于历史公论没有丝毫用处。\n目前，《我们为什么应该彻底取消审查制度》一文已被删除。2017 年 7 月 24 日，媒体《好奇心日报》联系了李银河，问其就禁言一事是否愿意接受采访，她的助理回复：“商量了一下，先不说话了。”我在微博看到了越来越多的美好。国泰民安，如此盛世。但是，为什么一提到肮脏与污秽，大家就都不「说话」了？《东京本屋》中关于模索舍的采访中有一段：\n吉井(采访者)：我都不知道日本也有思想警察。\n榎本(受采访者)：有。这你都不知道啊…… 1995 年奥姆真理教事件发生时，最忙碌的就是他们呢。说及思想控制，这是现代日本的一个问题。最近也有过报道，“爆笑事件”2事先准备的政治家相关内容未被 NHK 采用，都不能播放。这是自我审查，也是思想控制。\n我当然不至于期待中国变成一个没有思想控制的社会，如果有任何一个政权愚蠢到对民众脑子里想的东西不管不顾，那估计也是快完蛋了。但我觉得，在这个问题上，中国正在一条错误的路上越走越远。微博的言论审查制度，当然不止删帖：\n……\n2017 年 7 月，“小熊维尼”竟成为了“政治敏感词”，而被禁止发布在微博等社交平台上。原因可能是小熊维尼与领导人形象相似。\n同样是 7 月，李银河因在微博发表《我们为什么应该彻底取消审查制度》一文而被微博禁言三个月。\n2017 年 9 月，微博宣布公开招聘 1000 名“微博监督员”，举报被认为是违法和有害信息，帮助微博删帖。每月有效举报数超过 200 条，微博给予 200 人民币补贴。\n2017 年 11 月，北京红黄蓝幼儿园被曝虐童、性侵幼儿，多条初期爆料贴被删除，微博热搜榜关键词“红黄蓝”被删除。\n……\n\n我们大概都需要去模索舍买一本《救援笔记：被逮捕前必读》3。今天，即使是在这种程度的半残互联网下，已经不再有完全封锁住一则新闻的可能了。当人民无法得到真相，又无法讨论时，信息就劣化成了谣言，在更为不堪的渠道里求生。一则如都市传说般的新闻，混杂了性、暴力及其它人性深处的欲望，能指望它为所谓的真善美出什么力呢？然而无法获取信息，竟仍需要把希望寄托于谣言。「以史为镜，可以知兴替」。 只消回过头去看几十年，就知道大兴文字狱是什么后果。不给予最基本的言论自由保障，没有发声渠道，十亿张嘴，生生被捂住。换来了表面上的良民，但这样的「良民」，内里如“阴燃的煤堆”，只等一个偶然，燃起大火。被抑制时，只是在为爆发蓄力。「防民之口，甚于防川」，然而治水之道，宜疏不宜堵。若要驯化十亿人民所组成的庞大力量，用一种无形的、弥散的力量来从内塑造，比用有形的权威式力量与民意硬碰硬要稳妥。很可惜的是，中国的这种力量，从来就是权威的，有形的，集中制的，不讲理的。帝制时如此，共和国时还是如此。要做好准备，新浪微博4们不会一夜之间变好。不要再叫嚷“冬天即将来临”了，我们正在漫长的冬日里。\n\n比如 BBC 电视台出品的《虚拟革命》&#8617;\n日本一个搞笑艺人组合&#8617;\n介绍被逮捕时如何应对、在拘留所的生活、“默秘权”的重要性、警察的追究、调查方法、家人如何对待等等&#8617;\nTwitter 这位模仿者，如今正凭借「优秀的市场把控和卓越的商业技巧」超越 Twitter，成为另一个体量庞大的社交网络。以及，Twitter 正广泛借鉴微博的做法，在商业模式上下功夫。&#8617;\n\n\n",
      "categories": [
        {
          "name": "Default",
          "slug": "Default",
          "permalink": "https://blog.imalan.cn/category/Default/"
        }
      ],
      "tags": [

      ]
    },
    {
      "title": "《新世纪福音战士》观看指南",
      "date": "2017-11-11T19:48:00+08.00",
      "path": "https://blog.imalan.cn/archives/neon-genesis-evangelion/",
      "text": "话说我在网上看到好多人问《新世纪福音战士》（EVA）的观看顺序到底是什么。确实作为一个传奇般的神番，衍生作品和重制作品很多，我刚入坑也觉得很乱。所以写一篇简介放在这里。EVA 目前可以大致分为三条线\n电视播出版本\nTV 版 01-24 话 + TV 版 25、26 话。这条线是当时电视播出的版本，当时因为经费不足的原因，25、26 话比较意识流，也比较敷衍。EOE 线\nTV 版 01-24 话 + 《Air/真心为你》（《THE END OF EVANGELION》）。《THE END OF EVANGELION》分为两部分：「Air」、「真心为你」。这两部分作为替换原 25、26 话而存在。可以算作是 EVA 的 TV 版正式结局。新剧场版\n《序》+《破》+《Q》+《休止符》。其中《休止符》尚未上映。新剧场版是相对独立的故事线。看完以上作品即可对 EVA 的内容有足够的掌握另外的作品\n\n21-24 话导演剪辑版。是基于原 TV 版的重制内容，差别不是太大。\n《死与新生》（《DEATH&amp;REBIRTH》）。分为两部分，「Death」 和 「Rebirth」。 「Death」 长60分钟，是电视版前 24 话 的总编，与电视版对比，「Death」 多了 20 分钟的新内容，新内容之后流入 21-24 话的“导演剪辑版 (Director's Cut)”。「Rebirth」 是全新内容，是《THE END OF EVANGELION》第25话 「Air」 的前30分钟。所以其实《死与新生》看看就好，没有太重要的作用。\n《REVIVAL OF EVANGELION》。是《死与新生》以及《THE END OF EVANGELION》电影并作为一部电影。分为三部分：「Death(true)2」、「Air」 和 「真心为你」。其中 「Death(true)2」 是 「Death」 的再修正版。\n\n我的观看顺序\n首先看原 TV 版 01-26 话，然后忘掉第 25、26 话，看剧场版《Air/真心为你》。然后再看新剧场版《序》+《破》+《Q》+《休止符》。当然《休止符》就不知道有生之年能不能看到了……另外的一些想法\nEVA 这部动漫，自播出以来就引发了大量的讨论，掀起了一波舆论热潮。运用非常特别的拍摄手法，以及很意识流的叙事方式，让许多人觉得完全看不懂，一头雾水。没错，整部动漫不仅仅是驾驶机甲打怪兽这么简单的剧情。庵野秀明想要通过这部作品探讨更宏大的议题：亲情、爱情、友情、生命的意义。整部作品充斥着各种隐喻，涉及到哲学、神学、宗教各方面，确实不是简简单单就能看懂的。最初看这部动漫时，大概是心志不定吧，看得整个人状态都不好了，以至于整天像魔怔了一样，许久才缓过劲来。但现在我逐渐能“站在作品外欣赏作品”了，能够思考的也更多。这是一部值得多次反复观看的作品，每次看我都能有全新的感受。能遇到这么一部作品，我感到很庆幸。借用 EVA-FANS 制作组注释文档1中的一句话：\nEVA不是宇航研究，也不是宗教圣经。它是个科幻型动画，讲故事的，给你思考成长的。\n大概抱着这样的一个心态去看 EVA，就是最适合我的打开方式吧。\n\nEVA-FANS 注释文档：百度网盘：https://pan.baidu.com/s/1qYHTZqc，密码：ktxk。\n\n\n\n这是一个相当全面的注释文档，推荐想要深入了解 EVA 的人阅读&#8617;\n\n\n",
      "categories": [
        {
          "name": "Default",
          "slug": "Default",
          "permalink": "https://blog.imalan.cn/category/Default/"
        }
      ],
      "tags": [

      ]
    },
    {
      "title": "随笔 | 手帐足月",
      "date": "2017-10-21T23:08:00+08.00",
      "path": "https://blog.imalan.cn/archives/techo/",
      "text": "最近因为上研以及其它学业上的事，非常忙碌。虽然最后结果不坏，但也没有什么沾沾自喜的感觉。自己又开始多项个人计划，都在紧锣密鼓地推进中。期待今年年末回顾时会发现 2017 下半年值得自己骄傲。这半年，除了捡起了自己读书的爱好之外，还入了「手帐」这个坑，如今已成了手帐足月生。时间虽短，但使用的过程中我一直保持思考：我为什么要写手帐？手帐能带给我什么特别的东西？「手帐」的概念在中国其实非常宽泛：日程本、日记本、账本，甚至读书笔记、观影体会都可以叫做「手帐」，也都有人玩得很棒。我是一个电子设备爱好者，以上所说的每一点，基本上在我的电脑、手机、iPad 上都有对应的工具可以实现；但我又无法无视网络上手帐达人们 PO 出来的自己的手帐照片，有的秩序井然，有的相当随性。但无论哪种，作者都宣称自己的生活因为手帐而得到了改善，甚至直接因为手帐而更热爱生活。我不能抵抗这种诱惑。b7c4c492afa959d925bd4f0c52b82358.jpeg另外我想说明，我看到了不少我觉得并不是「手帐爱好者」，而直接是「文具爱好者」的例子。虽然二者之间可能有很高的重合率，但我认为二者应该分开来讲。我憧憬的应该是专注于手帐内容、创意、排版的达人们；对拥有极大量钢笔、胶带、本子、书衣、贴纸等道具的达人们我只静静地表达一下自己的敬意。我先后尝试了将手帐作为日程本、日记本、观影体会本来使用。现在的结果是：完全抛弃了日程本这个用法，日记本用起来不错，观影体会我还在体会中，在这里我迫不及待想要来分享一下我的感受。但我不想把这篇随笔变成只抛出立场的「站队文」，因为我确实意识到，这个过程相当受个人因素的影响。日程安排还是在电子设备上做好一些\n手帐作为日程本来使用应该是最为广泛的一种用法。为了将这种用法优化到极致，产生了 Bullet Journal 这种专门的手帐术，也催化出了专门为此而设计的手帐本内页，如 DIY Fish 活页内芯等等。IMG_1057.JPG\n课间或者通勤路上，随手掏出一个小本子查看自己今天的安排或者来安排自己接下来的行程，一整天因为良好的计划安排而井井有条。\n这是一个相当美好的描述，但不太适用于我。最大的原因大概是我做不到随身掏出一个本子同时掏出一支能写的笔来（笑）。说正经的，用本子来进行日程安排，最大的优点应该是录入快捷，纸笔用起来更顺手。不过其它的我认为一个任务管理系统应该具有的特性，纸笔实现都要欠缺一些。以我目前的任务量，一个任务管理系统应该具有的特性有：方便的录入环节；通知；任务推迟、提前、重复、删除、归档；基于项目与场景的整理方式。纯粹的纸笔无法满足以上的大部分条件。通知自不必说，想要不漏掉任务记在本子上就要求自己随时去看它。任务的迁移很容易让本子变得一团糟，虽然像 Bullet Journal 这样的手帐术专门制定了任务推迟的书写规范（用一个小箭头来表示推迟，然后在相应日期重新录入），但直观性与便利性与在手机上拖拽或者点击一下推迟不可同日而语。在本子上也难以把任务按照项目或场景来整理，二者总是难以兼顾。拼图.JPG在这一点上，可以说电子产品把我惯坏了，也可以说崇尚数字效率生活的少数派把我惯坏了。我已经习惯了在手机上利用 Todoist 或者 2Do 或者 Things 或者别的什么 App 来进行简单的任务管理，虽不能说用得非常深，但用来管理自己的小生活也挺得心应手的。所以最终我放弃了用手帐本来进行日程管理。那就来做日记本吧\n抛弃了手帐的效率用法之后，找到了还算舒服的用法：写日记。这部分我用的本子是 Hobonichi A5 一日一页。我原本就有在 Day One 里每天写日记的习惯，所以转到本子上来写不会有太大的习惯上的转变。在本子上写起日记来有特殊的快感，因为可以相当随意的发挥：纸面上，做怎样的排版都看自己，用胶带、图片随意装饰，可以随意张贴小票、照片等等，心情好了还能画上两笔。手上握着一只喜欢的钢笔在纸面上书写，相比起在 iPhone 的虚拟键盘上敲字，心里面觉得实在得多。看着随着自己的使用，张贴了不少图片的本子慢慢厚起来，心里面有一种成就感。IMG_1065.JPG在写日记这件事上，我没有那么功利。我明白 Day One 能提供很多不错的特性：标签、搜索、那年今日等等，但我不太觉得这些是写日记时必须的特性。在我心里面，日记是一种比较仪式性的东西，在桌子前正襟危坐，把自己不会对别人说的一些不着边际的话说给本子听，翻过一页或者合上本子，日记本就像一位最沉默可靠的朋友，倾听我发牢骚、帮我保守住秘密。我不会刻意地去查阅我在日记里写的东西，需要查阅的东西我会记在备忘录里、印象笔记里，我翻看日记的方式就是随意翻到一页，体会当时写下这些字的自己是怎样的心境。装饰手帐是另一种乐趣。许多人喜欢用很有特色的贴纸、胶带来装饰手帐，精心设计排版，效果非常赏心悦目。这个我只能靠看别人的照片来体会了，因为是设计排版白痴，字也写得非常马马虎虎，看自己的版面很难有「赏心悦目」的感觉，不过毕竟是自己写的，还是挺喜欢的。IMG_1048.jpg在本子上写日记，一个问题是会花更多的时间。这就看个人对这件事愿意投入多少了。如果足够看重这件事，少看一集动漫，挤一挤时间总还是有的。所以有没有让我「更热爱生活」\n我记手帐的时间可以算是短得可怜，目前难以说能看到什么深刻的改变，写这篇随笔，是因为一些结论不需要太久的体验就能总结出来。而「有没有更热爱生活」这个问题，需要更久的体验。但手帐让我每天都有一段时间是在桌前，平心静气面对纸面，总结自己的一天，记录自己的所思所想，顺便厘清自己可能一团糟的大脑。不需要非常长的一段时间，在这段时间里放下冰冰凉凉的 Unibody 铝合金机身的设备，关掉刺眼的电子设备屏幕，在沙沙的书写声中我确实能感到一种心安。",
      "categories": [
        {
          "name": "Default",
          "slug": "Default",
          "permalink": "https://blog.imalan.cn/category/Default/"
        }
      ],
      "tags": [

      ]
    },
    {
      "title": "AirPods 体验报告 | 揽件日志",
      "date": "2017-07-06T22:26:00+08.00",
      "path": "https://blog.imalan.cn/archives/airpods-hands-on/",
      "text": "前几天没有忍住，下单了苹果的无线耳机：AirPods。这款耳机去年随 iPhone 7 发布，直到现在仍然处于缺货状态，任何时候去苹果官网看发货时间都是六周以后。拿到了之后非常兴奋，简单写写我的体验。\n一般来说若是提到「无线耳机」、「蓝牙耳机」，最容易想起来的是单只售卖的、黑色的、有着比较庞大的外观的话务式蓝牙耳机，也就是常见到司机开车时接电话用的那种。AirPods 的定位完全不是如此：它就是一款普通的耳机，在 iPhone 7 取消耳机孔之后用来接替 EarPods 的耳机，一款用来听音乐、通话的全功能耳机。AirPods 虽然在平时没有见到几个人戴过，但是戴过的人普遍评价很高。苹果官方为它制定的宣传语是「无线，无繁琐，只有妙不可言」，这几天体验下来，我觉得这非常贴切。现在去网上翻一圈评论，说它易丢，说它外形不好看的大有人在，但是普遍对它的简单的配对方法、多设备切换的方便性赞不绝口。这些方面，我一个个来说一下我的体验。\n开箱、外观\n拿到的 AirPods 是一个简单的苹果风格的盒子，里面除了充电盒与耳机本体外，不带别的配件，所以充电线与适配器需要与 iPhone 共用。充电盒给我的第一感觉是非常漂亮、精致、小巧，拿到手上感觉温润圆滑，浑然一体。整个盒子除了底部充电口与背部转轴处是银色金属材质，其余部分是一个纯白的塑料盒。重量适中，不会给人轻飘飘的劣质感，我觉得带在身上也不会显得太重（不过厚度比 iPhone 要厚上许多）。盒盖与盒体我觉得是通过磁力来吸附的，只需要在正面凹陷处轻轻一拨盒盖即翻开，转动过程中几乎无阻尼感。打开后放置耳机的位置中间位置有一个小灯，用于判断目前耳机与充电盒的情况：包括电量与配对指示。耳机本体几乎就是 EarPods 剪掉线的样子，但是从耳机头延伸出来的部分比 EarPods 稍微粗一些。外观总体上是一个仁者见仁的事。许多人觉得 AirPods 很难看，带上去非常尴尬根本不敢上街，我倒觉得还好。相比起来，AirPods 已经算是造型优雅很不扎眼了。戴一个巨大的头戴式耳机都能出街，AirPods 洒洒水啦。\n连接与配对\n这个部分是 AirPods 最为人称道的部分。由于 AirPods 配备了所谓的 W1 芯片，再加上与 iOS 深度整合，AirPods 不需要一般配对蓝牙设备时的繁琐步骤（虽然对其他设备比如 Windows 设备仍然可以通过长按充电盒背部的按钮让它进入配对模式，像普通的蓝牙耳机一样使用）。我第一次使用时仅仅是把手机解锁，将 AirPods 放在距手机 10 厘米左右的地方然后打开盒盖，约过了一两秒钟手机上就自动弹出了配对提示，下图是配对后的样子。以后无需再次配对，只要在控制中心第二页选取播放设备为 AirPods 既可既可开始使用。过程还是非常流畅的。与 iPad 的配对比较 tricky，之前听说配对信息是通过 iCloud 自动同步的，于是我就直接打开 iPad 的控制中心等着 AirPods 的选项出现……等到海枯石烂也没等出来。我觉得很奇怪，在 iPad 旁边打开充电盒也不会出现配对提示，抱着试一试的心态按之前说的，在盒盖打开的基础上按住充电盒背部的按钮，直到盒内指示灯为白色闪烁，然后在 iPad 上打开蓝牙选项当作普通的蓝牙设备配对。配对成功后 iPad 自动识别出了这是一个 AirPods，随后就能够正常使用了。一旦与 iPhone 配对成功，Apple Watch 也就自动的配对成功了。macOS 上由于需要 macOS 10.12 及以上所以未测试，我估计也需要先配对一次？\n使用与多设备切换\n这是普通的蓝牙耳机最恼人的部分，据说 AirPods 将这个问题解决到了几乎完美的地步，所谓的能实现「无缝切换」。据我的体验，方便是确实是方便了不少，但还做不到所谓的「无缝」，还是有那么一点缝的。使用\n使用很简单，只要将耳机从充电盒里取出塞进耳朵里，AirPods 会根据传感器信息自动判断出已经处于佩戴模式，这时耳机里会有提示音。这时候在手机或者别的设备上选择输出为 AirPods 然后开始使用即可。在使用过程中，如果取下一只耳机，会停止播放，戴回去之后会自动开始（或者手动开始也可以继续播放）；如果同时取下两只耳机，同样会停止播放而且戴回去之后也不会自动开始。这个 feature 我尝试了十来次，基本能成功，只有一两次摘下一只耳机后，另一只耳机延迟了五六秒才停止播放。虽然等得久一点，但总还是停了，这个功能总体还是值得信赖的。在佩戴状态下，轻敲任意一只耳机可以唤出 Siri，这时可以通过语音执行操作。虽然苹果觉得 Siri 是可以作为一个个人助理无处不在的存在，但我还是不能在众人面前说出「调高音量」、「下一首」，太尴尬了。iOS 11 里增加了轻敲耳机进行「上一曲」和「下一曲」等操作，音量控制我觉得，要不就用手机控制，要不就用手表吧……我可不想在地铁上 Siri 打死听不懂我的话然后对它发飙：「你特么听不懂调高音量吗！？」。多设备切换\n多设备切换时，只需在需要使用的设备上选择 AirPods 作为播放源即可，原来使用的设备会自动停止播放，把控制权交给新的设备。这是比较理想的情况。实际上比如 AirPods 在 iPhone 上使用时打开 iPad 的控制中心，会看见播放设备并没有 AirPods，需要稍等一会儿才能看见它出现。这就说明 AirPods 不是随时与所有附近的设备保持联系，当你尝试切换播放源的时候，是有一个事件同步机制的，设备会通过 iCloud 传送信息，然后是一个寻找并切换的过程。由于有 iCloud 的介入，整个过程就变得比较靠人品了。我在使用的过程中，出现了多次打开了控制中心等了好久才出现 AirPods 选项的情况；即使出现了 AirPods 选项，点击之后也要等那个菊花转啊转转半天。这就是我说为什么还没有做到「无缝切换」，还是有点缝的。这个问题在使用过程中有时会变得很恼人，也许是我的网络问题，如果是软件的问题，我希望苹果能够优化一下。\n其它\n舒适度与隔音\nAirPods 不是一个隔音耳机。虽然耳机头和一般的平头塞不太相同，但是当然也不属于入耳塞，所以基本没有「听诊器效应」。因为不隔音，AirPods 不适合戴到公共场合，因为需要将音量调到相当高才能听清内容，而高音量对听力相当有害。舒适度上，我一向喜欢平头塞。戴眼镜的人想要找到一款舒适的头戴式耳机很难，头戴式耳机也容易给人闷闷的感觉；可能由于我的耳朵构造异于常人，入耳式耳机无论如何都要往外掉，试了各种耳机套都是这样（很郁闷，这代表我与大量的高端耳机无缘），另外入耳式耳机的听诊器效应让我也非常难受。自我遇见 EarPods 时我就觉得天哪怎么早没发现还有这么棒的佩戴感！可以预见我对 AirPods 的佩戴感也非常满意。至于是否容易掉落，我的答案是在我耳朵里完全不会。正常佩戴时，我把脑袋像嗑药了似的摇 AirPods 甚至没有松动的迹象，运动时还没有试。所以只要能正常佩戴 EarPods 我觉得就没必要太担心这个问题。续航与充电\nAirPods 通过与之配套的充电盒充电，充电盒本身可以和 iPhone 共用充电器。只要将耳机放进充电盒，即可通过耳机底部的金属部分和充电盒内部金属触点接触充电。据苹果官方网站描述：\n由于低功耗的 W1 芯片对电池续航时间的管理十分出色，因此 AirPods 一次充电即可最长聆听 5 小时，表现出众。它们经过精心打造，旨在供你随时使用；由于充电盒额外提供多次充电，使这款耳机可满足超过 24 小时的电量使用。需要快速充电？只需放入充电盒中 15 分钟即可获得最长可达 3 小时的使用时间。\n我一般是相信苹果从不在续航上撒谎。在实际使用过程中，我还没有遇到电量不足的问题。养成不用时将 AirPods 收进充电盒的习惯，充电盒本身保持一两天一充，中度使用应该是够用了。查看电量有几种方式：\n通过 iPhone 上的电量小部件查看 AirPods 的电量。\n在当 AirPods 在盒子里的时候在 iPhone 边打开盖子，iPhone 上会弹出电量信息。\n电量盒里的小灯也可以指示充电盒的电量。\n控制中心也可以查看耳机与充电盒的电量。\n\n信号强度与连接质量\n我简单在自己家里测试了一下，家中蓝牙环境比较好，蓝牙设备不多，所以可能发生的信号干扰比普通办公室环境少一些。虽然普通的蓝牙设备是保证在 10 米开阔范围内能够正常使用，我测试的结果（与 iPhone 连接）是直到 15 米的开阔场合也能正常工作。弱中间有障碍物（墙），大约在 10 米以下可以工作，再远就有明显的连接质量下降，传送音频断断续续，Siri 几乎不可用。普通的使用场景下，AirPods 的连接质量与普通的蓝牙耳机相似，所以不要指望它有秒杀其它产品的能力。音质\n这就不是我的能力范畴了。我个人感觉，与 EarPods 别无二致。当然我也没有对它的音质抱有很高期待。\n总结\n说了半天，流水账式的把我的体验描述了一遍。我觉得 AirPods 应该是苹果相当得意的产品，据称客户满意度高达 98%。从我在社交网络上的观察来看，大家也都很喜欢这款产品。我得承认，以后的电子产品将会是无线的天下，云的天下；而苹果在这个方向已经缓步推进了好些时日了。通过云平台（iCloud）的能力，苹果让自家设备配合默契，对外表现就是用起来极为顺手，直观。AirPods 这款产品，满足了我对一副日常使用的无线耳机的几乎所有期待，即使有一些小问题，仍然瑕不掩瑜。不论是初代 iPhone 和别的苹果初代产品，一般苹果都会有些保守，然后才慢慢完善，而 AirPods 从一开始就以完成度很高的姿态亮相，也不枉大家的盛赞。当然啦，作为一个使用 iPhone 7 还想边充电边听音乐的人，能怎么办呢？只能买买买呀！",
      "categories": [
        {
          "name": "Default",
          "slug": "Default",
          "permalink": "https://blog.imalan.cn/category/Default/"
        }
      ],
      "tags": [

      ]
    },
    {
      "title": "用 Workflow 从网易云音乐迁移数据至 Apple Music 或 Spotify",
      "date": "2016-12-14T20:18:00+08.00",
      "path": "https://blog.imalan.cn/archives/migrate-to-apple-music-with-workflow/",
      "text": "注意：由于网易云音乐使用的 API 时常变动，文中 Workflow 无法使用时，请在本文下面留言，并附上具体的无法使用的链接，我看到后会尽快排查。另外因为学业繁忙，可能处理不是很及时，还请谅解2017 年 11 月 29 日更新：修改了转移歌单所使用的网易云音乐 API。新的 Workflow 链接：网易云音乐➡️ Apple Music关于音乐平台的选择，通常可以分为两类人：一是只关心纯净的聆听体验，这类人的音乐平台是Apple Music、Spotify 等；二是在前者之外还喜欢有一些社交元素，比如在评论区参与讨论，这类人的音乐平台则是网易云音乐、虾米等。我之前一直在使用网易云音乐，直到我慢慢意识到听歌是一件非常私人的事，纯净的聆听体验于我可能更重要。前段时间 Apple Music 推出了针对大学生的特价活动，再加上 Apple Music 相对全面的曲库，想必很多人心里已经在痒痒了，跃跃欲试；另一方面 Spotify 在音乐爱好者之间口碑一向不错，高质量的推荐和基于场景的歌单符合许多人对优秀播放器的定义。但即使这样，我也难以做到从网易云音乐无痛转移，原因则是我在网易云音乐收集的大量歌单。歌单对很多人都很重要，经过长时间聆听、筛选，最终留下来的一定是最能体现自己音乐品味的那部分。这篇文章就为这样一群人而写：想要尝试新的平台、但是无论如何不能放弃自己的珍藏的这群人。转移大量的音乐，一首一首手动添加自然是不行，这里介绍借用自动化工具 Workflow 和 IFTTT 进行迁移的方法。如何将歌单转移到 Apple Music\n先将 Workflow 链接放到这里： 网易云音乐➡️ Apple Music。使用时在网易云音乐客户端里复制歌单分享链接，然后运行这个 Workflow。分析\n取得对应歌单信息的最好方法是利用平台的 API，API 信息查询官方文档一般能找到。对网易云音乐来说，可以用以下 API 获得歌单信息。GET http://music.163.com/api/v3/playlist/detail?id=歌单ID&amp;n=5000这个 API 里只有一个未知参数：歌单 ID 。这个 ID 也很容易取到，我们给别人发送歌单链接的时候，复制出来的链接都是这样的形式：\niOS版：http://music.163.com/playlist/437754500/45408568?userid=45408568\n桌面版：http://music.163.com/#/m/playlist?id=437754500&amp;userid=45408568\n\n对比这二者，在 Playlist 后面都能发现一串数字，这就是歌单 ID。在实际的情况中，歌单位数不一定是 9 位，可能是其它位数「感谢微博上的 @Mini_Goooo」。取数的方法很多，可以用 Split Text 按照 / 一个个截断再选择到目标，这里用更简单高效的正则匹配的方法，也就是使用 Match Text 这个动作，Pattern填正则表达式：\\d{4,11}这个表达式的意思就是取得字串中连续的 4 到 11 位数字。这样取的原因是可以避开前面的的 163，也能囊括目前我遇到的大部分歌单 ID，如果你要转移的歌单 ID 位数不在这个范围内，对应修改上面括号内的数使之符合你的歌单 ID 位数即可。URL 的格式是歌单 ID 在前面，取第一个结果也就取得了歌单 ID。006tLtW4jw1fap2x593h4j30ko0k8ta9.jpg重写 API 到这里：GET http://music.163.com/api/v3/playlist/detail?id=歌单ID&amp;n=5000在这个 URL 后面跟上 Get Contents of URL，Method 选择 GET，运行成功将返回 JSON 格式的数据块。我们只用关注里面的几个 Key：\nplaylist，里面包含了返回的歌单数据；\nplaylist 下名叫 name 的 key ，里面包含了歌单名称；\nplaylist 下名叫 tracks 的 key ， 里面包含了每首歌的信息；\ntracks 下又有一个名叫 name 的 key ，里面包含的是歌曲名；\ntracks 下名叫 ar 的 key ，里面包含歌曲的演奏者。\n\n这些信息在 Apple Music 里创建歌单以及添加歌曲时都会用到。所以用多个 Get Dictionary Value 来取出来。这里解释一下为什么 ar 要取 First Item，这是因为有的歌曲演奏者不止一个，为了防止在运行过程中需要手动选择哪一个，就索性只用第一个演奏者。在实际的 iTunes 匹配时一个演唱者也够了。需要遍历的是歌曲，歌曲信息包含在 tracks 里，于是我们需要在 tracks 后面跟上 Repeat With Each ，对每首歌都分别取得歌曲名和演奏者，然后在 iTunes 里匹配，取得的结果添加到Apple Music 里，这就是基本逻辑。这里要指出在使用前请保证 Search iTunes Store 里的 Country 要和你的 Apple Music 的所在区域对应，否则会报错。在实际的应用中，有可能出现匹配不到歌曲的情况，这种情况我们也要处理。这里借用了我之前在微博上看到的一个 Workflow 的思路，来源记不清了。总的来说如果没有找到歌曲，Search iTunes Store 这一步必然不返回结果，于是在这一步后面接上一个 Count Items ，如果值等于 0 ，那就在失败记录里添上一条；如果值不等于零就执行添加到 Apple Music 的动作。 Workflow 结束的地方再把这个失败记录展示出来，便于后期再手动添加。整个 Workflow 就解析到这里。006tLtW4jw1fadzkmfz2rj30ku1ysn3q.jpg注意事项与存在的问题\n经反应有人会遇到这些问题，我把我现在听说过的总结一下。\n提示遇到「未知错误」请检查 Workflow 是否有权限访问你的 Apple Music 资料库，并保证 Search iTunes Store 里的 Country 与你的 Apple Music 所在区域一致。\n提示「The requested operation is not enabled for this device」这应该是一个 Apple Music 方面的 Bug，你可以尝试重启你的设备，或者关闭再重新开启 iCloud 音乐资料库。一般来说尝试这两步后就能解决。\nWorkflow 中途停止检查你要转移的歌单 ID 位数是否出现了我前文说到的问题，另外这个 Workflow 是用来迁移歌单的，不适用于单曲。适用单曲的版本请看文末。\n\n网易云音乐是做得很好的国内音乐平台，但由于一些历史遗留原因，歌曲信息有不少错误、缺失、张冠李戴的情况，再加上 Apple Music 自身的曲库问题，歌曲匹配不到的可能性还是很高的。如果你的 Apple Music 是中区的，平常用网易云音乐听的歌又比较小众，失败率就进一步升高。这一点我也没有办法，只能靠这俩公司自己去完善自己的数据库。==由于我不再使用 Spotify，因此以下有关 Spotify 的内容暂时不会再更新。内容可能过时，但原理是不会变的，还请自助排查。==如何将歌单转移到 Spotify\n分析\n有了上文的铺垫，我们已经能够获取到歌单信息了。但是如果要转移到的是 Spotify 还有一点困难：Workflow 中没有对应的 Spotify 的动作。这里可以借助 IFTTT 来完成，用 IFTTT 其实有好处，就是运行速度比较快。首先使用 Workflow 获取到歌单的歌单名称，每首歌的歌曲名和每首歌的演唱者，一首一首地传入 IFTTT。Workflow 链接：网易云音乐 ➡️ Spotify006tLtW4jw1fajsuxcuu3j31kw16odqq.jpg然后在 IFTTT 中制作一个 Applet，触发条件就是 Workflow 中的 trigger，执行动作是添加到 Spotify，对应填入歌单名，歌曲名和歌手。点击 Workflow 中 Trigger IFTTT Applet 这一步中的 Create Recipe，跳转到 IFTTT 中，如图填写信息即可。006tLtW4jw1fajt41sqsaj315k16gdlt.jpgBonus：如果要转移单曲呢？\n经过了前面的分析和实践，转移单曲也是很简单了，不过是改变一下使用的 API 和解析数据的方式。转移网易云音乐单曲到 Apple Music\nWorkflow 链接：网易云音乐 ➡️ Apple Music 单曲版使用方式，在网易云音乐里复制单曲分享链接，然后运行这个 Workflow。如果添加失败将会将这首歌的信息放进你的提醒事项，方便你后续手动再添加。转移网易云音乐单曲到 Spotify\nWorkflow 链接：网易云音乐 ➡️ Spotify 单曲版同样需要借助 IFTTT 来添加歌曲。在 Workflow 中取得歌曲信息后如图设置 Trigger：006tLtW4jw1fap31ifh24j30ku0gs764.jpg然后点击 Create Recipe 跳转到 IFTTT 里创建对应的 Applet 即可。006tLtW4jw1fap32bq9tzj315y112qal.jpg结语\nApple Music、Spotify、网易云音乐三家各有所长，分享本文的目的是希望大家能更无障碍地愉快玩耍。另一方面，Workflow 于我而言是能力非凡的自动化工具，工具放在这里，能做到什么事还是看使用者的能力和脑洞。学习成本是有的，不过当用这个工具真正实现了自己的需求，成就感无与伦比。祝大家在音乐世界玩得开心～",
      "categories": [
        {
          "name": "Default",
          "slug": "Default",
          "permalink": "https://blog.imalan.cn/category/Default/"
        }
      ],
      "tags": [

      ]
    },
    {
      "title": "瓦力 • 娱乐至死",
      "date": "2016-11-19T22:47:00+08.00",
      "path": "https://blog.imalan.cn/archives/wall-e/",
      "text": "《垃圾星球》\n《机器人瓦力》这部电影最开始的名字叫做《垃圾星球》，正式的翻译一般叫做《机器人总动员》。要我说，如果真的用《垃圾星球》这个名字，虽然可能有文不对题之嫌，但我在给一百个赞之后，还要加上几个。影片描述的是700年后一片荒芜垃圾遍地的地球，人们早就离开了这个星球在宇宙里飘荡暂时延续种族。走之前留下了“瓦力”——Waste Allocation Load Lifter-Earth——WALL-E，来为地球做清扫工作。700年过去，“瓦力”们慢慢因为环境恶劣渐渐坏掉了，唯独剩下一个“瓦力”还在继续重复这个不可能完成的工作。瓦力有了自我意识，有了自己的兴趣爱好，在见到回地球探测环境的机器人 EVA 之后，爱上了她。继而追随 EVA 进入太空，进行了一系列的历险。历险、战胜反派、成功抱得美人归，都不是我欣赏的重点。真真让我叹服、直击我内心的，是对环境，对“人物”，对背景的刻画，还有我觉得精确得让人嗟叹的现实讽刺。\n除了电影的爱情主题，影片普遍被认为讽刺了美国的生活方式，包括肥胖、环境破坏、消费主义、领导能力等问题。当故事进行到了离开地球，到达太空城的时候，一些社会问题也在这部科幻动画电影中被以隐藏化的形式郑重地提了出来。当虚拟的绚烂服装消失才有机会注意到彼此的眼睛，后来的一切改变都源于瓦力的勇气和浪漫，以及去除物质的简单和纯真，电影的意图已经格外明显，与那些肥胖到无法直立行走的人类相比，整部电影中也许只有瓦力才是真正的活人，在追寻人类业已丢失的内在感动和无悔情感。 ——新华网评\n如前所述，这部电影痛斥了美国式的消费注意生活方式。肥胖、环境恶化、病态的科技依赖、底下的政府领导力，这些美国社会（其实不论哪个社会都一样）亟待解决的问题一一得到展现，而且是以一种耸人听闻——但毫不过分的方式。\n瓦力的爱好之一是收集“史前文明”——人类——留下的遗物。打火机、玩偶，只要是有趣瓦力都会放进自己的背包里拿回家里。直到后来瓦力偶然发现了电影关键——一株绿植。电影用庞大而精细的画面展现了这一点：渺小的瓦力在堆积成山的垃圾间奔波，履带在毫无生机的沙地上碾压出一道道痕迹。没有比走一条永远只有自己脚印的路更伤感的事了。这个世界是一个垃圾场，而这，就是所谓的后现代：被商业和消费主义蹂躏践踏的社会的最终形态。问题在于：这真的是700年后吗？\n在太空遨游避难的人们的生活，恰恰是美式生活的现实写照。这一点在后面会说到。\n瓦力欣赏的音乐剧恰恰说明了：瓦力才是整部电影里唯一的人。与之形成对比的是在飞船上的“人们”：肥胖到已经失去了站立行走的能力、沉迷在电子娱乐节目中。这是对现代生活的最大胆预测，但谁敢肯定，这不会成真呢？\n机器人 EVA 形似一台 iPod，其设计者正是苹果公司著名设计师 Jony Ive；瓦力用来播放音乐剧的设备是一台 iPod；瓦力每天早晨起床充电开机时的声音就是 Mac 电脑的开机音效。不论这代表着主创团队是 Apple 的超级粉丝还是仅仅因为 Apple付了一笔可观的广告费，Apple 实实在在的是走了一步好棋：身为消费级电子产品的行业巨头，换句话说就是最可能让人类走到电影里那个境地的公司之一，顺利地把自己和正牌形象联系在一起，即代表了正义、爱、生机、人性。再看看苹果这两年在环保方面的举措，这家公司的调性，是扎根在 DNA 里的。\n\n被《娱乐至死》诅咒的美国，现在被《瓦力》再诅咒了一次\n《娱乐至死》宣称：美国逐渐脱离了印刷机的统治进入了被电视统治的时代。至此电视接管了公众话语权，美国人也失去了包括缜密逻辑、思辨在内的由文字读写带来的诸多好处。我们可以在《瓦力》里看到对这些论断的印证：《瓦力》里的人除了吃喝和对眼前的屏幕傻笑之外别无作为。而贯穿整部电影的一家公司：巨购公司，似乎是一家政企合一的公司，从各种意义上接管了公众的生活。我敢说，这一定在现实里有所映照：不论是 Google 还是 Apple 还是 Amazon，编剧和导演的批评是严肃的。有趣的细节：瓦力和 Eva 在太空遨游时，飞船里的一男一女不小心牵上了手，随后才如梦初醒——估计也是他们各自一生中第一次——向对方说了“你好”。这是里程碑式的一刻：到这里就说明这电影十有八九会有正面结局了。\n一代比一代肥胖的舰长到最后已经完全忘记了包括社交、舞会、舞蹈这些 “Old fashion” 的娱乐方式，但是实际上舰长随时都处在娱乐的中心。这么看来，娱乐至死的同时还伴随着遗忘一切。影片里以一株绿植代表生命的萌芽（似乎必须是绿植，因为 Eva 寻找生命时对瓦力的一直蟑螂同伴视而不见），其实瓦力和 Eva 才是电影里整个人类世界的人性的火种。现在地球的问题出在：地球快变成瓦力生活的那个地球了，但我还没看到一个瓦力。",
      "categories": [
        {
          "name": "Default",
          "slug": "Default",
          "permalink": "https://blog.imalan.cn/category/Default/"
        }
      ],
      "tags": [

      ]
    }
  ],
  "pages": [

  ]
}